// Auto-generated file. Do not edit manually.
import 'shia_data.dart';

final List<Dua> additionalDuas = [
  Dua(
    title: "دعاء السمات",
    text: r'''اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ الْعَظِيمِ الْأَعْظَمِ  الْأَعَزِّ الْأَجَلِّ الْأَكْرَمِ ، الَّذِى إِذا دُعِيتَ بِهِ عَلىٰ مَغالِقِ أَبْوابِ السَّماءِ لِلْفَتْحِ بِالرَّحْمَةِ انْفَتَحَتْ ، وَ إِذا دُعِيتَ بِهِ عَلىٰ مَضائِقِ أَبْوابِ الْأَرْضِ لِلْفَرَجِ انْفَرَجَتْ ، وَ إِذا دُعِيتَ بِهِ عَلَى الْعُسْرِ لِلْيُسْرِ تَيَسَّرَتْ ، وَ إِذا دُعِيتَ بِهِ عَلَى الْأَمْواتِ لِلنُّشُورِ انْتَشَرَتْ ، وَ إِذا دُعِيتَ بِهِ عَلىٰ كَشْفِ الْبَأْسَاءِ وَالضَّرَّاءِ انْكَشَفَتْ؛

وَبِجَلالِ وَجْهِكَ الْكَرِيمِ أَكْرَمِ الْوُجُوهِ وَأَعَزِّ الْوُجُوهِ الَّذِى عَنَتْ لَهُ الْوُجُوهُ ، وَخَضَعَتْ لَهُ الرِّقابُ ، وَخَشَعَتْ لَهُ الْأَصْواتُ ، وَوَجِلَتْ لَهُ الْقُلُوبُ مِنْ مَخافَتِكَ ، وَبِقُوَّتِكَ الَّتِى بِها  تُمْسِكُ السَّماءَ أَنْ تَقَعَ عَلَى الْأَرْضِ إِلّا بِإِذْنِكَ وَتُمْسِكُ السَّماواتِ وَالْأَرْضَ أَنْ تَزُولا ،

وَبِمَشِييَّتِكَ الَّتِى دَانَ لَهَا  الْعالَمُونَ؛ وَبِكَلِمَتِكَ الَّتِى خَلَقْتَ بِهَا السَّمَاوَاتِ وَالْأَرْضَ ، وَبِحِكْمَتِكَ الَّتِى صَنَعْتَ بِهَا الْعَجائِبَ ، وَخَلَقْتَ بِهَا الظُّلْمَةَ وَجَعَلْتَها لَيْلاً ، وَجَعَلْتَ اللَّيْلَ سَكَناً ، وَخَلَقْتَ بِهَا النُّورَ وَجَعَلْتَهُ نَهاراً ، وَجَعَلْتَ النَّهارَ نُشُوراً مُبْصِراً ، وَخَلَقْتَ بِهَا الشَّمْسَ وَجَعلْتَ الشَّمْسَ ضِياءً ، وَخَلَقْتَ بِهَا الْقَمَرَ وَجَعَلْتَ الْقَمَرَ نُوراً؛

وَخَلَقْتَ بِهَا الْكَواكِبَ وَجَعلْتَها نُجُوماً وَبُرُوجاً وَمَصابِيحَ وَزِينةً وَرُجُوماً ، وَجَعَلْتَ لَها مَشارِقَ وَمَغارِبَ ، وَجَعَلْتَ لَها مَطالِعَ وَمَجارِىَ ، وَجَعَلْتَ لَها فَلَكاً وَمَسابِحَ ، وَقَدَّرْتَها فِى السَّماءِ مَنازِلَ فَأَحْسَنْتَ تَقْدِيرَها ، وَصَوَّرْتَها فَأَحْسَنْتَ تَصْوِيرَها ، وَأَحْصَيْتَها بِأَسْمائِكَ إِحْصاءً ، وَدَبَّرْتَها بِحِكْمَتِكَ تَدْبِيراً ، وَأَحْسَنْتَ تَدْبِيرَها ، وَسَخَّرْتَها بِسُلْطانِ اللَّيْلِ وَسُلْطانِ النَّهارِ وَالسَّاعاتِ وَعَدَدِ السِّنِينَ وَالْحِسابِ ، وَجَعَلْتَ رُؤْيَتَها لَجَمِيعِ النّاسِ مَرْئً واحِداً؛

وَأَسْأَلُكَ اللّٰهُمَّ بِمَجْدِكَ الَّذِى كَلَّمْتَ بِهِ عَبْدَكَ وَرَسُولَكَ مُوسَى بْنَ عِمْرانَ عَلَيْهِ السَّلامُ فِى الْمُقَدَّسِينَ ، فَوْقَ إِحْساسِ الْكَرُوبِينَ ، فَوْقَ غَمائِمِ النُّورِ ، فَوْقَ تابُوتِ الشَّهادَةِ ، فِى عَمُودِ النَّارِ ، وَفِى طُورِ سَيْناءَ ، وَفِى جَبَلِ حُورِيثَ ، فِى الْوادِى الْمُقَدَّسِ فِى الْبُقْعَةِ الْمُبارَكَةِ مِنْ جانِبِ الطُّورِ الْأَيْمَنِ مِنَ الشَّجَرَةِ ، وَفِى أَرْضِ مِصْرَ بِتِسْعِ آياتٍ بَيِّناتٍ ، وَيَوْمَ فَرَقْتَ لِبَنِى إِسْرائِيلَ الْبَحْرَ ، وَفِى الْمُنْبَجِساتِ الَّتِى صَنَعْتَ بِهَا الْعَجائِبَ فِى بَحْرِ سُوفٍ؛

وَعَقَدْتَ ماءَ الْبَحْرِ فِى قَلْبِ الْغَمْرِ كَالْحِجارَةِ ، وَجاوَزْتَ بِبَنِى إِسْرائِيلَ الْبَحْرَ ، وَتَمَّتْ كَلِمَتُكَ الْحُسْنىٰ عَلَيْهِمْ بِما صَبَرُوا ، وَأَوْرَثْتَهُمْ مَشارِقَ الْأَرْضِ وَمَغارِبَهَا الَّتِى بارَكْتَ فِيها لِلْعالَمِينَ ، وَأَغْرَقْتَ فِرْعَوْنَ وَجُنُودَهُ وَمَراكِبَهُ فِى الْيَمِّ ، وَبِاسْمِكَ الْعَظِيمِ الْأَعْظَمِ  الْأَعَزِّ الْأَجَلِّ الْأَكْرَمِ ، وَبِمَجْدِكَ الَّذِى تَجَلَّيْتَ بِهِ لِمُوسىٰ كَلِيمِكَ عَلَيْهِ السَّلامُ فِى طُورِ سَيْناءَ ، وَ لِإِبْراهِيمَ عَلَيْهِ السَّلامُ خَلِيلِكَ مِنْ قَبْلُ فِى مَسْجِدِ الْخَيْفِ ، وَلِإِسْحاقَ صَفِيِّكَ عَلَيْهِ السَّلامُ فِى بِئْرِ شِيعٍ ، وَ لِيَعْقُوبَ نَبِيِّكَ عَلَيْهِ السَّلامُ فِى بَيْتِ إِيلٍ؛

وَأَوْفَيْتَ لِإِبْراهِيمَ عَلَيْهِ السَّلامُ بِمِيثاقِكَ ، وَلِإِسْحاقَ بِحَلْفِكَ ، وَ لِيَعْقُوبَ بِشَهادَتِكَ ، وَ لِلْمُؤْمِنِينَ بِوَعْدِكَ ، وَ لِلدَّاعِينَ بِأَسْمائِكَ فَأَجَبْتَ ، وَبِمَجْدِكَ الَّذِى ظَهَرَ لِمُوسَى بْنِ عِمْرانَ عَلَيْهِ السَّلامُ عَلىٰ قُبَّةِ الرُّمّانِ  ، وَبِآياتِكَ الَّتِى وَقَعَتْ عَلىٰ أَرْضِ مِصْرَ بِمَجْدِ الْعِزَّةِ وَالْغَلَبَةِ ، بِآياتٍ عَزِيزَةٍ ، وَبِسُلْطانِ الْقُوَّةِ ، وَبِعِزَّةِ الْقُدْرَةِ ، وَبِشَأْنِ الْكَلِمَةِ التَّامَّةِ؛

وَبِكَلِماتِكَ الَّتِى تَفَضَّلْتَ بِها عَلىٰ أَهْلِ السَّماواتِ وَالْأَرْضِ ، وَأَهْلِ الدُّنْيا وَأَهْلِ الْآخِرَةِ ، وَبِرَحْمَتِكَ الَّتِى مَنَنْتَ بِها عَلىٰ جَمِيعِ خَلْقِكَ ، وَبِاسْتِطاعَتِكَ الَّتِى أَقَمْتَ بِها عَلَى الْعالَمِينَ ، وَبِنُورِكَ الَّذِى قَدْ خَرَّ مِنْ فَزَعِهِ طُورُ سَيْناءَ ، وَبِعِلْمِكَ وَجَلالِكَ وَكِبْرِيائِكَ وَعِزَّتِكَ وَجَبَرُوتِكَ الَّتِى لَمْ تَسْتَقِلَّهَا الْأَرْضُ ، وَانْخَفَضَتْ لَهَا السَّماواتُ ، وَانْزَجَرَ لَهَا الْعُمْقُ الْأَكْبَرُ  ،وَرَكَدَتْ لَهَا الْبِحارُ وَالْأَنْهارُ ، وَخَضَعَتْ لَهَا الْجِبالُ ، وَسَكَنَتْ لَهَا الْأَرْضُ بِمَناكِبِها؛

وَاسْتَسْلَمَتْ لَهَا الْخَلائِقُ كُلُّها ، وَخَفَقَتْ لَهَا الرِّياحُ فِى جَرَيانِها ، وَخَمَدَتْ لَهَا النِّيرانُ فِى أَوْطانِها ، وَبِسُلْطانِكَ الَّذِى عُرِفَتْ لَكَ بِهِ الْغَلَبَةُ دَهْرَ الدُّهُورِ ، وَحُمِدْتَ بِهِ فِى السَّماواتِ وَالْأَرَضِينَ ، وَبِكَلِمَتِكَ كَلِمَةِ الصِّدْقِ الَّتِى سَبَقَتْ لِأَبِينا آدَمَ عَلَيْهِ السَّلامُ وَذُرِّيَّتِهِ بِالرَّحْمَةِ ، وَأَسْأَلُكَ بِكَلِمَتِكَ الَّتِى غَلَبَتْ كُلَّ شَىْءٍ ، وَبِنُورِ وَجْهِكَ الَّذِى تَجَلَّيْتَ بِهِ لِلْجَبَلِ فَجَعَلْتَهُ دَكّاً وَخَرَّ مُوسىٰ صَعِقاً؛

وَبِمَجْدِكَ الَّذِى ظَهَرَ عَلىٰ طُورِ سَيْناءَ فَكَلَّمْتَ بِهِ عَبْدَكَ وَرَسُولَكَ مُوسَى بْنَ عِمْرانَ ، وَبِطَلْعَتِكَ فِى ساعِيرَ ، وَظُهُورِكَ فِى جَبَلِ فارانَ ، بِرَبَواتِ الْمُقَدَّسِينَ وَجُنُودِ الْمَلائِكَةِ الصَّافِّينَ ، وَخُشُوعِ الْمَلائِكَةِ الْمُسَبِّحِينَ ، وَبِبَرَكاتِكَ الَّتِى بارَكْتَ فِيها عَلىٰ إِبْراهِيمَ خَلِيلِكَ عَلَيْهِ السَّلامُ فِى أُمَّةِ مُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَآلِهِ ، وَبارَكْتَ لِإِسْحاقَ صَفِيِّكَ فِى أُمَّةِ عِيسىٰ عَلَيْهِمَا السَّلامُ ، وَبارَكْتَ لِيَعْقُوبَ إِسْرائِيلِكَ فِى أُمَّةِ مُوسىٰ عَلَيْهِمَا السَّلامُ ، وَبارَكْتَ لِحَبِيبِكَ مُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَآلِهِ فِى عِتْرَتِهِ وَذُرِّيَّتِهِ وَأُمَّتِهِ؛

اللّٰهُمَّ وَكَما غِبْنا عَنْ ذٰلِكَ وَلَمْ نَشْهَدْهُ ، وَآمَنَّا بِهِ وَلَمْ نَرَهُ ، صِدْقاً وَعَدْلاً ، أَنْ تُصَلِّىَ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ ، وَأَنْ تُبارِكَ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ ، وَتَرَحَّمَ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَأَفْضَلِ ما صَلَّيْتَ وَبارَكْتَ وَتَرَحَّمْتَ عَلىٰ إِبْراهِيمَ وَآلِ إِبْراهِيمَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ فَعَّالٌ لِما تُرِيدُ وَأَنْتَ عَلىٰ كُلِّ شَىْءٍ قَدِيرٌ.

اللّٰهُمَّ بِحَقِّ هٰذَا الدُّعاءِ ، وَبِحَقِّ هَذِهِ الْأَسْماءِ الَّتِى لَايَعْلَمُ تَفْسِيرَها وَلَا يَعْلَمُ باطِنَها غَيْرُكَ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَافْعَلْ بِى ما أَنْتَ أَهْلُهُ وَلَا تَفْعَلْ بِى ما أَنَا أَهْلُهُ ، وَاغْفِرْ لِى مِنْ ذُنُوبِى ما تَقَدَّمَ مِنْها وَما تَأَخَّرَ ، وَوَسِّعْ عَلَىَّ مِنْ حَلالِ رِزْقِكَ ، وَاكْفِنِى مَؤُونَةَ إِنْسانِ سَوْءٍ ، وَجارِ سَوْءٍ ، وَقَرِينِ سَوْءٍ ، وَسُلْطانِ سَوْءٍ ، إِنَّكَ عَلىٰ ما تَشاءُ قَدِيرٌ ، وَبِكُلِّ شَىْءٍ عَلِيمٌ ، آمِينَ رَبَّ الْعالَمِينَ.

اللّٰهُمَّ بِحَقِّ هٰذَا الدُّعاءِ ، وَبِحَقِّ هَذِهِ الْأَسْماءِ الَّتِى لَايَعْلَمُ تَفْسِيرَها وَلَا تَأْوِيلَها وَلَا باطِنَها وَلَا ظاهِرَها غَيْرُكَ ، أَنْ تُصَلِّىَ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ ، وَأَنْ تَرْزُقَنِى خَيْرَ الدُّنْيا وَالْآخِرَةِ.

وَافْعَلْ بِى ما أَنْتَ أَهْلُهُ ، وَلَا تَفْعَلْ بِى ما أَنَا أَهْلُهُ ، وَانْتَقِمْ لِى مِنْ فُلانِ بْنِ فُلانٍ.

وَاغْفِرْ لِى مِنْ ذُ نُوبِى مَا تَقَدَّمَ مِنْها وَمَا تَأَخَّرَ ،وَ لِوالِدَىَّ وَ لِجَمِيعِ الْمُؤْمِنِينَ وَالْمُؤْمِناتِ ، وَوَسِّعْ عَلَىَّ مِنْ حَلالِ رِزْقِكَ ، وَاكْفِنِى مَؤُونَةَ إِنْسانِ سَوْءٍ ، وَجارِ سَوْءٍ ، وَسُلْطانِ سَوْءٍ ، وَقَرِينِ سَوْءٍ ، وَيَوْمِ سَوْءٍ ، وَساعَةِ سَوْءٍ ، وَانْتَقِمْ لِى مِمَّنْ يَكِيدُنِى ، وَمِمَّنْ يَبْغِى عَلَىَّ ، وَيُرِيدُ بِى وَبِأَهْلِى وَأَوْلادِى وَ إِخْوانِى وَجِيرانِى وَقَراباتِى مِنَ الْمُؤْمِنِينَ وَالْمُؤْمِناتِ ظُلْماً ، إِنَّكَ عَلىٰ ما تَشَاءُ قَدِيرٌ ، وَبِكُلِّ شَىْءٍ عَلِيمٌ ، آمِينَ رَبَّ الْعالَمِينَ.

اللّٰهُمَّ بِحَقِّ هٰذَا الدُّعاءِ تَفَضَّلْ عَلىٰ فُقَراءِ الْمُؤْمِنِينَ وَالْمُؤْمِناتِ بِالْغِنىٰ وَالثَّرْوَةِ ، وَعَلىٰ مَرْضَى الْمُؤْمِنِينَ وَالْمُؤْمِناتِ بِالشِّفاءِ وَالصِّحَّةِ ، وَعَلىٰ أَحْياءِ الْمُؤْمِنِينَ وَالْمُؤْمِناتِ بِاللُّطْفِ وَالْكَرامَةِ ، وَعَلىٰ أَمْواتِ الْمُؤْمِنِينَ وَالْمُؤْمِناتِ بِالْمَغْفِرَةِ وَالرَّحْمَةِ ، وَعَلىٰ مُسافِرِى الْمُؤْمِنِينَ وَالْمُؤْمِناتِ بِالرَّدِّ إِلىٰ أَوْطانِهِمْ سالمِينَ غانِمِينَ ، بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ ، وَصَلَّى اللّٰهُ عَلىٰ سَيِّدنا مُحَمَّدٍ خاتَمِ النَّبِيِّينَ وَعِتْرَتِهِ الطَّاهِرِينَ وَسَلَّمَ تَسْلِيماً كَثِيراً.

اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِحُرْمَةِ هٰذَا الدُّعاءِ ، وَبِما فاتَ مِنْهُ مِنَ الْأَسْماءِ ، وَبِما يَشْتَمِلُ عَلَيْهِ مِنَ التَّفْسِيرِ وَالتَّدْبِيرِ الَّذِى لَايُحِيطُ بِهِ إِلّا أَنْتَ ، أَنْ تَفْعَلَ بِى كَذا وَكذا. (وتذكر حاجتك بدلاً من كذا وكذا)''',
    benefits: "يُعرف هذا الدعاء بدعاء الشَّبُّور (دعاء العطاء والمنّ)، ويُستحبّ قراءته في الساعة الأخيرة من نهار يوم الجمعة، وهو من الأدعية المشهورة التي واظب عليها كبار العلماء.",
  ),
  Dua(
    title: "دعاء المشلول",
    text: r'''اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيمِ ، يَا ذَا الْجَلالِ وَالإِكْرامِ ، يَا حَىُّ يَا قَيُّومُ  يَا حَىُّ لَاإِلٰهَ إِلّا أَنْتَ ، يَا هُوَ يَا مَنْ لَايَعْلَمُ ما هُوَ ، وَلَا كَيْفَ هُوَ ، وَلَا أَيْنَ هُوَ ، وَلَا حَيْثُ هُوَ إِلّا هُوَ ، يَا ذَا الْمُلْكِ وَالْمَلَكُوتِ ، يَا ذَا الْعِزَّةِ وَالْجَبَرُوتِ ، يا مَلِكُ يَا قُدُّوسُ ، يَا سَلامُ يَا مُؤْمِنُ يَا مُهَيْمِنُ ، يَا عَزِيزُ يَا جَبّارُ يَا مُتَكَبِّرُ ، يَا خالِقُ يَا بارِئُ يَا مُصَوِّرُ ، يَا مُفِيدُ يَا مُدَبِّرُ ، يَا شَدِيدُ يَا مُبْدِئُ ، يَا مُعِيدُ يَا مُبِيدُ ، يَا وَدُودُ يَا مَحْمُودُ يَا مَعْبُودُ؛

يَا بَعِيدُ يَا قَرِيبُ يَا مُجِيبُ ، يَا رَقِيبُ يَا حَسِيبُ ، يَا بَدِيعُ يَا رَفِيعُ ، يَا مَنِيعُ يَا سَمِيعُ ، يَا عَلِيمُ يَا حَلِيمُ يَاكَرِيمُ يَا حَكِيمُ يَا قَدِيمُ ، يَا عَلِىُّ يَا عَظِيمُ ، يَا حَنَّانُ يَا مَنَّانُ ، يَا دَيَّانُ يَا مُسْتَعانُ ، يَاجَلِيلُ يَا جَمِيلُ ، يَا وَكِيلُ يَا كَفِيلُ ، يَا مُقِيلُ يَا مُنِيلُ ، يَا نَبِيلُ يَا دَلِيلُ ، يَا هادِى يَا بادِى ، يَا أَوَّلُ يَا آخِرُ ، يَا ظاهِرُ يَا باطِنُ ، يَا قائِمُ يَا دائِمُ ، يَا عالِمُ يَا حاكِمُ ، يَا قاضِى يَا عادِلُ ، يَا فاصِلُ يَا واصِلُ ، يَا طاهِرُ يَا مُطَهِّرُ ، يَا قادِرُ يَا مُقْتَدِرُ ، يَا كَبِيرُ يَا مُتَكَبِّرُ ، يَا واحِدُ يَا أَحَدُ يَا صَمَدُ ،

يَا مَنْ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ ، وَلَمْ يَكُنْ لَهُ صاحِبَةٌ وَلَا كانَ مَعَهُ وَزِيرٌ؛ وَلَا اتَّخَذَ مَعَهُ مُشِيراً ، وَلَا احْتاجَ إِلىٰ ظَهِيرٍ ، وَلَا كانَ مَعَهُ مِنْ إِلٰهٍ غَيْرُهُ لَاإِلٰهَ إِلّا أَنْتَ ، فَتَعالَيْتَ عَمَّا يَقُولُ الظَّالِمُونَ عُلُوّاً كَبِيراً ، يَا عَلِىُّ يَا شامِخُ يَا باذِخُ ، يَا فَتَّاحُ يَا نَفَّاحُ يَا مُرْتاحُ ،يَامُفَرِّجُ يَاناصِرُ يَامُنْتَصِرُ يَامُدْرِكُ يَامُهْلِكُ يَامُنْتَقِمُ ، يَاباعِثُ يَاوارِثُ ، يَاطالِبُ يَاغالِبُ ، يَامَنْ لَايَفُوتُهُ هارِبٌ ، يَاتَوَّابُ يَاأَوَّابُ يَاوَهَّابُ ، يَامُسَبِّبَ الْأَسْبابِ ، يَامُفَتِّحَ الْأَبْوابِ ، يَامَنْ حَيْثُ ما دُعِىَ أَجابَ ، يَاطَهُورُ يَاشَكُورُ ، يَاعَفُوُّ يَاغَفُورُ ، يَانُورَ النُّورِ ، يَامُدَبِّرَ الْأُمُورِ؛

يَالَطِيفُ يَاخَبِيرُ ، يَامُجِيرُ يَامُنِيرُ ، يَابَصِيرُ يَاظَهِيرُ يَاكَبِيرُ ، يَاوِتْرُ يَافَرْدُ ، يَاأَبَدُ يَاسَنَدُ يَاصَمَدُ ، يَاكافِى يَاشافِى ، يَاوافِى يَامُعافِى ، يَامُحْسِنُ يَامُجْمِلُ ، يَامُنْعِمُ يَامُفْضِلُ ، يَامُتَكَرِّمُ يَامُتَفَرِّدُ ، يَامَنْ عَلا فَقَهَرَ ، يَامَنْ مَلَكَ فَقَدَرَ ، يَا مَنْ بَطَنَ فَخَبَرَ ، يَا مَنْ عُبِدَ فَشَكَرَ ، يَا مَنْ عُصِىَ فَغَفَرَ ، يَا مَنْ لَاتَحْوِيهِ الْفِكَرُ ، وَلَا يُدْرِكُهُ بَصَرٌ ، وَلَا يَخْفىٰ عَلَيْهِ أَثَرٌ ، يَا رازِقَ الْبَشَرِ ، يَا مُقَدِّرَ كُلِّ قَدَرٍ؛

يَا عالِىَ الْمَكانِ ، يَا شَدِيدَ الْأَرْكانِ ، يَا مُبَدِّلَ الزَّمانِ ، يَا قابِلَ الْقُرْبانِ ، يَا ذَا الْمَنِّ وَالْإِحْسانِ ، يَا ذَا الْعِزَّةِ وَالسُّلْطانِ ، يَا رَحِيمُ يَا رَحْمٰنُ ، يَا مَنْ هُوَ كُلَّ يَوْمٍ فِى شَأْنٍ ، يَا مَنْ لَايَشْغَلُهُ شَأْنٌ عَنْ شَأْنٍ ، يَا عَظِيمَ الشَّأْنِ ، يَا مَنْ هُوَ بِكُلِّ مَكانٍ ، يَا سامِعَ الْأَصْواتِ، يَا مُجِيبَ الدَّعَواتِ ، يَا مُنْجِحَ الطَّلِباتِ ، يَا قاضِىَ الْحاجاتِ ، يَا مُنْزِلَ الْبَرَكاتِ ، يَا راحِمَ الْعَبَراتِ ، يَا مُقِيلَ الْعَثَراتِ ، يَا كاشِفَ الْكُرُباتِ ، يَا وَلِىَّ الْحَسَناتِ ، يَا رافِعَ الدَّرَجاتِ؛

يَا مُؤْتِىَ السُّؤْلاتِ ، يَا مُحْيِىَ الْأَمْواتِ ، يَا جامِعَ الشَّتاتِ ، يَا مُطَّلِعاً عَلَى النِّيَّاتِ ، يَا رادَّ ما قَدْ فاتَ ، يَا مَنْ لَاتَشْتَبِهُ عَلَيْهِ الْأَصْواتُ ، يَا مَنْ لَاتُضْجِرُهُ الْمَسْأَلاتُ ، وَلَا تَغْشاهُ الظُّلُماتُ ، يَا نُورَ الْأَرْضِ وَالسَّماواتِ ، يَا سابِغَ النِّعَمِ ، يَا دافِعَ النِّقَمِ ، يَا بارِئَ النَّسَمِ ، يَا جامِعَ الْأُمَمِ ، يَا شافِىَ السَّقَمِ ، يَا خالِقَ النُّورِ وَالظُّلَمِ ، يَا ذَا الْجُودِ وَالْكَرَمِ ، يَا مَنْ لَا يَطَأُ عَرْشَهُ قَدَمٌ ، يَاأَجْوَدَ الْأَجْوَدِينَ ، يَاأَكْرَمَ الْأَكْرَمِينَ ، يَاأَسْمَعَ السَّامِعِينَ ، يَاأَبْصَرَ النَّاظِرِينَ ، يَاجارَ الْمُسْتَجِيرِينَ؛

يَاأَمانَ الْخائِفِينَ ، يَاظَهْرَ اللَّاجِينَ ، يَاوَلِىَّ الْمُؤْمِنِينَ ، يَاغِياثَ الْمُسْتَغِيثِينَ ، يَاغايَةَ الطَّالِبِينَ ، يَاصاحِبَ كُلِّ غَرِيبٍ ، يَامُونِسَ كُلِّ وَحِيدٍ ، يَامَلْجَأَ كُلِّ طَرِيدٍ ، يَامَأْوىٰ كُلِّ شَرِيدٍ ، يَاحافِظَ كُلِّ ضَّالَّةٍ ، يَاراحِمَ الشَّيْخِ الْكَبِيرِ ، يَارازِقَ الطِّفْلِ الصَّغِيرِ ، يَاجَابِرَ الْعَظْمِ الْكَسِيرِ ، يَافَاكَّ كُلِّ أَسِيرٍ ، يَامُغْنِىَ الْبَائِسِ الْفَقِيرِ ، يَاعِصْمَةَ الْخائِفِ الْمُسْتَجِيرِ ، يَا مَنْ لَهُ التَّدْبِيرُ وَالتَّقْدِيرُ ، يَا مَنِ الْعَسِيرُ عَلَيْهِ سَهْلٌ يَسِيرٌ ، يَا مَنْ لَايَحْتاجُ إِلىٰ تَفْسِيرٍ؛

يَا مَنْ هُوَ عَلَىٰ كُلِّ شَىْءٍ قدِيرٌ ، يَا مَنْ هُوَ بِكُلِّ شَىْءٍ خَبِيرٌ ، يَا مَنْ هُوَ بِكُلِّ شَىْءٍ بَصِيرٌ ، يَا مُرْسِلَ الرِّياحِ ، يَافَالِقَ الْإِصْباحِ ، يَا بَاعِثَ الْأَرْواحِ ، يَاذَا الْجُودِ وَالسَّماحِ ، يَا مَنْ بِيَدِهِ كُلُّ مِفْتاحٍ ، يَا سَامِعَ كُلِّ صَوْتٍ ، يَاسَابِقَ كُلِّ فَوْتٍ ، يَا مُحْيِىَ كُلِّ نَفْسٍ بَعْدَ الْمَوْتِ ، يَا عُدَّتِى فِى شِدَّتِى ، يَاحافِظِى فِى غُرْبَتِى ، يَا مُونِسِى فِى وَحْدَتِى ، يَا وَلِيِّى فِى نِعْمَتِى ، يَاكَهْفِى حِينَ تُعْيِينِى  الْمَذَاهِبُ ، وَتُسَلِّمُنِى الْأَقارِبُ ، وَيَخْذُلُنِى كُلُّ صَاحِبٍ ،

يَا عِمَادَ مَنْ لَا عِمادَ لَهُ؛ يَا سَنَدَ مَنْ لَاسَنَدَ لَهُ ، يَا ذُخْرَ مَنْ لَاذُخْرَ لَهُ ، يَاحِرْزَ مَنْ لَاحِرْزَ لَهُ ، يَا كَهْفَ مَنْ لَاكَهْفَ لَهُ ، يَا كَنْزَ مَنْ لَاكَنْزَ لَهُ ، يَا رُكْنَ مَنْ لَارُكْنَ لَهُ ، يَا غِياثَ مَنْ لَاغِياثَ لَهُ ، يَا جَارَ مَنْ لَاجَارَ لَهُ ، يَا جَارِىَ اللَّصِيقَ ، يَا رُكْنِىَ الْوَثِيقَ ، يَاإِلٰهِى بِالتَّحْقِيقِ ، يَارَبَّ الْبَيْتِ الْعَتِيقِ ، يَا شَفِيقُ يا رَفِيقُ ، فُكَّنِى مِنْ حَلَقِ الْمَضِيقِ ، وَاصْرِفْ عَنِّى كُلَّ هَمٍّ وَغَمٍّ وَضِيقٍ ، وَاكْفِنِى شَرَّ مَا لَاأُطِيقُ ،وَأَعِنِّى عَلَىٰ ما أُطِيقُ ،

يَا رَادَّ يُوسُفَ عَلَىٰ يَعْقُوبَ ، يَا كاشِفَ ضُرِّ أَيُّوبَ ، يَاغافِرَ ذَنْبِ داوُدَ ، يَا رافِعَ عِيسَىٰ بْنِ مَرْيَمَ وَمُنْجِيَهُ مِنْ أَيْدِى الْيَهُودِ ، يَامُجِيبَ نِداءِ يُونُسَ فِى الظُّلُماتِ ، يَا مُصْطَفِىَ مُوسىٰ بِالْكَلِماتِ؛ يَا مَنْ غَفَرَ لاِدَمَ خَطِيئَتَهُ ، وَرَفَعَ إِدْرِيسَ مَكَاناً عَلِيّاً بِرَحْمَتِهِ ، يَا مَنْ نَجَّىٰ نُوحاً مِنَ الْغَرَقِ ، يَا مَنْ أَهْلَكَ عاداً الْأُولىٰ وَثَمُودَ فَما أَبْقَىٰ ، وَقَوْمَ نُوحٍ مِنْ قَبْلُ إِنَّهُمْ كَانُوا هُمْ أَظْلَمَ وَأَطْغَىٰ ، وَالْمُؤْتَفِكَةَ أَهْوَىٰ ، يَا مَنْ دَمَّرَ عَلىٰ قَوْمِ لُوطٍ ، وَدَمْدَمَ عَلىٰ قَوْمِ شُعَيْبٍ ،

يَا مَنِ اتَّخَذَ إِبْراهِيمَ خَلِيلاً ، يَا مَنِ اتَّخَذَ مُوسىٰ كَلِيماً ، وَاتَّخَذَ مُحَمَّداً صَلَّى اللّٰهُ عَلَيْهِ وَآلِهِ وَعَلَيْهِمْ أَجْمَعِينَ حَبِيباً ، يَا مُؤْتِىَ لُقْمانَ الْحِكْمَةَ ، وَالْواهِبَ لِسُلَيْمانَ مُلْكاً لَايَنْبَغِى لِأَحَدٍ مِنْ بَعْدِهِ ، يَا مَنْ نَصَرَ ذَا الْقَرْنَيْنِ عَلَى الْمُلُوكِ الْجَبابِرَةِ ، يَا مَنْ أَعْطَى الْخِضْرَ الْحَياةَ ، وَرَدَّ لِيُوشَعَ بْنِ نُونٍ الشَّمْسَ بَعْدَ غُرُوبِها؛

يَا مَنْ رَبَطَ عَلىٰ قَلْبِ أُمِّ مُوسىٰ ، وَأَحْصَنَ فَرْجَ مَرْيَمَ ابْنَةِ عِمْرانَ ، يا مَنْ حَصَّنَ يَحْيَى بْنَ زَكَرِيَّا مِنَ الذَّنْبِ ، وَسَكَّنَ عَنْ مُوسَى الْغَضَبَ ، يَا مَنْ بَشَّرَ زَكَرِيَّا بِيَحْيىٰ ، يَا مَنْ فَدَىٰ إِسْماعِيلَ مِنَ الذَّبْحِ بِذِبْحٍ عَظِيمٍ ، يَا مَنْ قَبِلَ قُرْبانَ هابِيلَ ، وَجَعَلَ اللَّعْنَةَ عَلىٰ قابِيلَ ، يَا هازِمَ الْأَحْزابِ لِمُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَآلِهِ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَعَلىٰ جَمِيعِ الْمُرْسَلِينَ وَمَلائِكَتِكَ الْمُقَرَّبِينَ وَأَهْلِ طَاعَتِكَ أَجْمَعِينَ ،

وَأَسْأَلُكَ بِكُلِّ مَسْأَلَةٍ سَأَلَكَ بِها أَحَدٌ مِمَّنْ رَضِيتَ عَنْهُ ، فَحَتَمْتَ لَهُ عَلَى الْإِجابَةِ ، يَا اللّٰهُ يَا اللّٰهُ يَا اللّٰهُ ، يَا رَحْمٰنُ يَا رَحْمٰنُ يَا رَحْمٰنُ ، يا رَحِيمُ يَا رَحِيمُ يَا رَحِيمُ؛ يَا ذَا الْجَلالِ وَالْإِكْرامِ ، يَا ذَا الْجَلالِ وَالْإِكْرامِ ، يَا ذَا الْجَلالِ وَالْإِكْرامِ ، بِهِ بِهِ بِهِ بِهِ بِهِ بِهِ بِهِ ، أَسْأَلُكَ بِكُلِّ اسْمٍ سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ أَنْزَلْتَهُ فِى شَىْءٍ مِنْ كُتُبِكَ ، أَوِ اسْتَأَثَرْتَ بِهِ فِى عِلْمِ الْغَيْبِ عِنْدَكَ ، وَبِمَعاقِدِ الْعِزِّ مِنْ عَرْشِكَ ، وَبِمُنْتَهَى الرَّحْمَةِ مِنْ كِتابِكَ وَبِما ﴿لَوْ أَنَّ مٰا فِي الْأَرْضِ مِنْ شَجَرَةٍ أَقْلاٰمٌ وَ الْبَحْرُ يَمُدُّهُ مِنْ بَعْدِهِ سَبْعَةُ أَبْحُرٍ مٰا نَفِدَتْ كَلِمٰاتُ اللّٰهِ إِنَّ اللّٰهَ عَزِيزٌ حَكِيمٌ﴾ ،

وَأَسْأَلُكَ بِأَسْمائِكَ الْحُسْنَى الَّتِى نَعَتَّها فِى كِتابِكَ فَقُلْتَ: ﴿وَ لِلّٰهِ الْأَسْمٰاءُ الْحُسْنىٰ فَادْعُوهُ بِهٰا﴾ وَقُلْتَ : ﴿اُدْعُونِي أَسْتَجِبْ لَكُمْ﴾، وَقُلْتَ : ﴿وَ إِذٰا سَأَلَكَ عِبٰادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدّٰاعِ إِذٰا دَعٰانِ﴾ ، وَقُلْتَ : ﴿يٰا عِبٰادِيَ الَّذِينَ أَسْرَفُوا عَلىٰ أَنْفُسِهِمْ لاٰ تَقْنَطُوا مِنْ رَحْمَةِ اللّٰهِ إِنَّ اللّٰهَ يَغْفِرُ الذُّنُوبَ جَمِيعاً إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ﴾ وَ أَنَا أَسْأَلُكَ يَا إِلٰهِى ، وَ أَدْعُوكَ يَا رَبِّ ، وَ أَرْجُوكَ يَا سَيِّدِى ، وَأَطْمَعُ فِى إِجابَتِى يَامَولاىَ كَما وَعَدْتَنِى وَقَدْ دَعَوْتُكَ كَما أَمَرْتَنِى ، فَافْعَلْ بِى ما أَنْتَ أَهْلُهُ يَاكَرِيمُ ، وَالْحَمْدُ لِلّٰهِ رَبِّ الْعالَمِينَ ، وَصَلَّى اللّٰهُ عَلىٰ مُحَمَّدٍ وَآلِهِ أَجْمَعِينَ.''',
    benefits: "يُعرف بدعاء 'الشاب المأخوذ بذنبه' وهو مروي عن أمير المؤمنين (عليه السلام) علّمه لشابّ شُلّت يده بسبب عقوق والده، وهو نافع جداً لكشف الكروب والهموم وقضائها.",
  ),
  Dua(
    title: "دعاء الجوشن الكبير",
    text: r'''سُبْحانَكَ يَا لَاإِلٰهَ إِلّا أَنْتَ ، الْغَوْثَ الْغَوْثَ ، خَلِّصْنا مِنَ النَّارِ يَا رَبِّ.

سُبْحانَكَ يَا لَاإِلٰهَ إِلّا أَنْتَ ، الْغَوْثَ الْغَوْثَ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِهِ وَخَلِّصْنا مِنَ النَّارِ يَا رَبِّ ، يَا ذَا الْجَلالِ وَالْإِكْرامِ ، يَا أَرْحَمَ الرَّاحِمِينَ .

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

﴿۱﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا اللّٰهُ ، يَا رَحْمٰنُ ، يَا رَحِيمُ ، يَا كَرِيمُ ، يَامُقِيمُ ، يَا عَظِيمُ ، يَا قَدِيمُ ، يَا عَلِيمُ ، يَا حَلِيمُ ، يَا حَكِيمُ ، سُبْحانَكَ يَا لَاإِلٰهَ إِلّا أَنْتَ ، الْغَوْثَ الْغَوْثَ ، خَلِّصْنا مِنَ النَّارِ يَا رَبِّ.

﴿٢﴾ يَا سَيِّدَ السَّاداتِ ، يَا مُجِيبَ الدَّعَواتِ ، يَا رَافِعَ الدَّرَجَاتِ ، يَا وَلِىَّ الْحَسَناتِ ، يَا غَافِرَ الْخَطِيئاتِ ، يَا مُعْطِىَ الْمَسْأَلاتِ ، يَا قابِلَ التَّوْباتِ ، يَا سَامِعَ الْأَصْواتِ ، يَا عَالِمَ الْخَفِيِّاتِ ، يَا دَافِعَ الْبَلِيِّاتِ.

﴿۳﴾ يَا خَيْرَ الْغافِرِينَ ، يَا خَيْرَ الْفاتِحِينَ ، يَا خَيْرَ النَّاصِرِينَ ، يَا خَيْرَ الْحَاكِمِينَ ، يَا خَيْرَ الرَّازِقِينَ ، يَا خَيْرَ الْوَارِثِينَ ، يَا خَيْرَ الْحَامِدِينَ ، يَا خَيْرَ الذَّاكِرِينَ ، يَا خَيْرَ الْمُنْزِلِينَ ، يَا خَيْرَ الْمُحْسِنِينَ.

﴿۴﴾ يَا مَنْ لَهُ الْعِزَّةُ وَالْجَمالُ ، يَا مَنْ لَهُ الْقُدْرَةُ وَالْكَمالُ ، يَا مَنْ لَهُ الْمُلْكُ وَالْجَلالُ، يَا مَنْ هُوَ الْكَبِيرُ الْمُتَعالِ ، يَا مُنْشِئَ السَّحابِ الثِّقالِ ، يَا مَنْ هُوَ شَدِيدُ الِْمحالِ ، يَا مَنْ هُوَ سَرِيعُ الْحِسابِ ، يَا مَنْ هُوَ شَدِيدُ الْعِقابِ ، يَا مَنْ عِنْدَهُ حُسْنُ الثَّوابِ ، يَا مَنْ عِنْدَهُ أُمُّ الْكِتابِ.

﴿۵﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا حَنَّانُ ، يَا مَنَّانُ ، يَا دَيَّانُ ، يَا بُرْهانُ ، يَا سُلْطانُ ، يَا رِضْوانُ ، يَا غُفْرانُ ، يَا سُبْحانُ ، يَا مُسْتَعانُ ، يَا ذَا الْمَنِّ وَالْبَيانِ .

﴿۶﴾ يَا مَنْ تَواضَعَ كُلُّ شَىْءٍ لِعَظَمَتِهِ ، يَا مَنِ اسْتَسْلَمَ كُلُّ شَىْءٍ لِقُدْرَتِهِ ، يَا مَنْ ذَلَّ كُلُّ شَىْءٍ لِعِزَّتِهِ ، يَا مَنْ خَضَعَ كُلُّ شَىْءٍ لِهَيْبَتِهِ ، يَا مَنِ انْقادَ كُلُّ شَىْءٍ مِنْ خَشْيَتِهِ ، يَا مَنْ تَشَقَّقَتِ الْجِبالُ مِنْ مَخافَتِهِ ، يَا مَنْ قامَتِ السَّمَاوَاتُ بِأَمْرِهِ ، يَا مَنِ اسْتَقَرَّتِ الْأَرَضُونَ بِإِذْنِهِ ، يَا مَنْ يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ ، يَا مَنْ لَايَعْتَدِى عَلىٰ أَهْلِ مَمْلَكَتِهِ.

﴿۷﴾ يَا غافِرَ الْخَطايا ، يَا كاشِفَ الْبَلايا ، يَا مُنْتَهَى الرَّجايَا ، يَا مُجْزِلَ الْعَطايَا ، يَا واهِبَ الْهَدايَا ، يَا رازِقَ الْبَرايا ، يَا قَاضِىَ الْمَنايا ، يَا سَامِعَ الشَّكَايا ، يَا بَاعِثَ الْبَرايا ، يَا مُطْلِقَ الْأُسارىٰ.

﴿۸﴾ يَا ذَا الْحَمْدِ وَالثَّناءِ ، يَا ذَا الْفَخْرِ وَالْبَهاءِ ، يَا ذَا الْمَجْدِ وَالسَّناءِ ، يَا ذَا الْعَهْدِ وَالْوَفاءِ ، يَا ذَا الْعَفْوِ وَالرِّضاءِ ، يَا ذَا الْمَنِّ وَالْعَطَاءِ ، يَا ذَا الْفَصْلِ وَالْقَضاءِ ، يَا ذَا الْعِزِّ وَالْبَقاءِ ، يَا ذَا الْجُودِ وَالسَّخاءِ ، يَا ذَا الْآلاءِ وَالنَّعْماءِ.

﴿۹﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا مانِعُ ، يَا دافِعُ ، يَا رافِعُ ، يَا صانِعُ ، يَا نافِعُ ، يَا سامِعُ ، يَا جامِعُ ، يَا شافِعُ ، يَا واسِعُ ، يَا مُوسِعُ.

﴿۱۰﴾ يَا صانِعَ كُلِّ مَصْنُوعٍ ، يَا خالِقَ كُلِّ مَخْلُوقٍ ، يَا رازِقَ كُلِّ مَرْزُوقٍ ، يَا مالِكَ كُلِّ مَمْلُوكٍ ، يَا كَاشِفَ كُلِّ مَكْرُوبٍ ، يَا فَارِجَ كُلِّ مَهْمُومٍ ، يَا رَاحِمَ كُلِّ مَرْحُومٍ ، يَا نَاصِرَ كُلِّ مَخْذُولٍ ، يَا سَاتِرَ كُلِّ مَعْيُوبٍ ، يَا مَلْجَأَ كُلِّ مَطْرُودٍ.

﴿۱۱﴾ يَا عُدَّتِى عِنْدَ شِدَّتِى ، يَا رَجَائِى عِنْدَ مُصِيبَتِى ، يَا مُؤْ نِسِى عِنْدَ وَحْشَتِى ، يَا صَاحِبِى عِنْدَ غُرْبَتِى ، يَا وَلِيِّى عِنْدَ نِعْمَتِى ، يَا غِياثِى عِنْد كُرْبَتِى ، يَا دَلِيلِى عِنْدَ حَيْرَتِى ، يَا غَنائِى عِنْدَ افْتِقارِى ، يَا مَلْجَئِى عِنْدَ اضْطِرارِى ، يَا مُعِينِى عِنْدَ مَفْزَعِى.

﴿۱۲﴾ يَا عَلَّامَ الْغُيُوبِ ، يَا غَفَّارَ الذُّنُوبِ ، يَا سَتَّارَ الْعُيُوبِ ، يَا كَاشِفَ الْكُرُوبِ، يَا مُقَلِّبَ الْقُلُوبِ ، يَا طَبِيبَ الْقُلُوبِ ، يَا مُنَوِّرَ الْقُلُوبِ ، يَا أَنِيسَ الْقُلُوبِ ، يَا مُفَرِّجَ الْهُمُومِ ، يَا مُنَفِّسَ الْغُمُومِ.

﴿۱۳﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا جَلِيلُ ، يَا جَمِيلُ ، يَا وَكِيلُ ، يَا كَفِيلُ ، يَا دَلِيلُ ، يَا قَبِيلُ، يَا مُدِيلُ ، يَا مُنِيلُ ، يَا مُقِيلُ ، يَا مُحِيلُ.

﴿۱۴﴾ يَا دَلِيلَ الْمُتَحَيِّرِينَ ، يَا غِياثَ الْمُسْتَغِيثِينَ ، يَا صَرِيخَ الْمُسْتَصْرِخِينَ ، يَا جارَ الْمُسْتَجِيرِينَ ، يَا أَمانَ الْخَائِفِينَ ، يَا عَوْنَ الْمُؤْمِنِينَ ، يَا رَاحِمَ الْمَساكِينَ ، يَا مَلْجَأَ الْعَاصِينَ ، يَا غافِرَ الْمُذْنِبِينَ ، يَا مُجِيبَ دَعْوَةِ الْمُضْطَرِّينَ.

﴿۱۵﴾ يَا ذَا الْجُودِ وَالْإِحْسانِ ، يَا ذَا الْفَضْلِ وَالْامْتِنانِ ، يَا ذَا الْأَمْنِ وَالْأَمانِ ، يَا ذَا الْقُدْسِ وَالسُّبْحانِ ، يَا ذَا الْحِكْمَةِ وَالْبَيانِ ، يَا ذَا الرَّحْمَةِ وَالرِّضْوانِ ، يَا ذَا الْحُجَّةِ وَالْبُرْهانِ ، يَا ذَا الْعَظَمَةِ وَالسُّلْطَانِ ، يَا ذَا الرَّأْفَةِ وَالْمُسْتَعانِ ، يَا ذَا الْعَفْوِ وَالْغُفْرانِ.

﴿۱۶﴾ يَا مَنْ هُوَ رَبُّ كُلِّ شَىْءٍ ، يَا مَنْ هُوَ إِلٰهُ كُلِّ شَىْءٍ ، يَا مَنْ هُوَ خالِقُ كُلِّ شَىْءٍ ، يَا مَنْ هُوَ صَانِعُ كُلِّ شَىْءٍ ، يَا مَنْ هُوَ قَبْلَ كُلِّ شَىْءٍ ، يَا مَنْ هُوَ بَعْدَ كُلِّ شَىْءٍ ، يَا مَنْ هُوَ فَوْقَ كُلِّ شَىْءٍ ، يَا مَنْ هُوَ عَالِمٌ بِكُلِّ شَىْءٍ ، يَا مَنْ هُوَ قادِرٌ عَلَىٰ كُلِّ شَىْءٍ ، يَا مَنْ هُوَ يَبْقىٰ وَيَفْنىٰ كُلُّ شَىْءٍ.

﴿۱۷﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا مُؤْمِنُ ، يَا مُهَيْمِنُ ، يَا مُكَوِّنُ ، يَا مُلَقِّنُ ، يَا مُبَيِّنُ ، يَا مُهَوِّنُ ، يَا مُمَكِّنُ ، يَا مُزَيِّنُ ، يَا مُعْلِنُ ، يَا مُقَسِّمُ.

﴿۱۸﴾ يَا مَنْ هُوَ فِى مُلْكِهِ مُقِيمٌ ، يَا مَنْ هُوَ فِى سُلْطانِهِ قَدِيمٌ ، يَا مَنْ هُو فِى جَلالِهِ عَظِيمٌ، يَا مَنْ هُوَ عَلَىٰ عِبادِهِ رَحِيمٌ ، يَا مَنْ هُوَ بِكُلِّ شَىْءٍ عَلِيمٌ ، يَا مَنْ هُوَ بِمَنْ عَصاهُ حَلِيمٌ ، يَا مَنْ هُوَ بِمَنْ رَجاهُ كَرِيمٌ ، يَا مَنْ هُوَ فِى صُنْعِهِ حَكِيمٌ ، يَا مَنْ هُوَ فِى حِكْمَتِهِ لَطِيفٌ ، يَا مَنْ هُوَ فِى لُطْفِهِ قَدِيمٌ.

﴿۱۹﴾ يَا مَنْ لَايُرْجىٰ إِلّا فَضْلُهُ ، يَا مَنْ لَايُسْأَلُ إِلّا عَفْوُهُ ، يَا مَنْ لَايُنْظَرُ إِلّا بِرُّهُ ، يَا مَنْ لَايُخافُ إِلّا عَدْلُهُ ، يَا مَنْ لَايَدُومُ إِلّا مُلْكُهُ ، يَا مَنْ لَاسُلْطانَ إِلّا سُلْطانُهُ ، يَا مَنْ وَسِعَتْ كُلَّ شَىْءٍ رَحْمَتُهُ ، يَا مَنْ سَبَقَتْ رَحْمَتُهُ غَضَبَهُ ، يَا مَنْ أَحاطَ بِكُلِّ شَىْءٍ عِلْمُهُ ، يَا مَنْ لَيْسَ أَحَدٌ مِثْلُهُ.

﴿۲۰﴾ يَا فارِجَ الْهَمِّ ، يَا كَاشِفَ الْغَمِّ ، يَا غَافِرَ الذَّنْبِ ، يَا قَابِلَ التَّوْبِ ، يَا خَالِقَ الْخَلْقِ ، يَا صَادِقَ الْوَعْدِ ، يَا مُوفِىَ الْعَهْدِ ، يَا عَالِمَ السِّرِّ ، يَا فَالِقَ الْحَبِّ ، يَا رَازِقَ الْأَنامِ.

﴿۲۱﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا عَلِىُّ ، يَا وَفِىُّ ، يَا غَنِىُّ ،يَا مَلِىُّ ، يَا حَفِىُّ ، يَا رَضِىُّ ، يَا زَكِىُّ ، يَا بَدِىُّ ، يَا قَوِىُّ ، يَا وَلِىُّ.

﴿۲۲﴾ يَا مَنْ أَظْهَرَ الْجَمِيلَ ، يَا مَنْ سَتَرَ الْقَبِيحَ ، يَا مَنْ لَمْ يُؤاخِذْ بِالْجَرِيرَةِ ، يَا مَنْ لَمْ يَهْتِكِ السِّتْرَ ، يَا عَظِيمَ الْعَفْوِ ، يَا حَسَنَ التَّجاوُزِ ، يَا وَاسِعَ الْمَغْفِرَةِ ، يَا بَاسِطَ الْيَدَيْنِ بِالرَّحْمَةِ ، يَا صَاحِبَ كُلِّ نَجْوىٰ ، يَا مُنْتَهىٰ كُلِّ شَكْوىٰ.

﴿۲۳﴾ يَا ذَا النِّعْمَةِ السَّابِغَةِ ، يَا ذَا الرَّحْمَةِ الْواسِعَةِ ، يَا ذَا الْمِنَّةِ السَّابِقَةِ ، يَا ذَا الْحِكْمَةِ الْبَالِغَةِ ، يَا ذَا الْقُدْرَةِ الْكَامِلَةِ ، يَا ذَا الْحُجَّةِ الْقَاطِعَةِ ، يَا ذَا الْكَرامَةِ الظَّاهِرَةِ ، يَا ذَا الْعِزَّةِ الدَّائِمَةِ ، يَا ذَا الْقُوَّةِ الْمَتِينَةِ ، يَا ذَا الْعَظَمَةِ الْمَنِيعَةِ.

﴿۲۴﴾ يَا بَدِيعَ السَّمَاواتِ ، يَا جَاعِلَ الظُّلُماتِ ، يَا رَاحِمَ الْعَبَراتِ ، يَا مُقِيلَ الْعَثَراتِ ، يَا سَاتِرَ الْعَوْراتِ ، يَا مُحْيِىَ الْأَمْواتِ ، يَا مُنْزِلَ الْآياتِ ، يَا مُضَعِّفَ الْحَسَنَاتِ ، يَا مَاحِىَ السَّيِّئاتِ ، يَا شَدِيدَ النَّقِماتِ.

﴿۲۵﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا مُصَوِّرُ ، يَا مُقَدِّرُ ، يَا مُدَبِّرُ ، يَا مُطَهِّرُ ، يَا مُنَوِّرُ ، يَا مُيَسِّرُ ، يَا مُبَشِّرُ ، يَا مُنْذِرُ ، يَا مُقَدِّمُ ، يَا مُؤَخِّرُ.

﴿۲۶﴾ يَا رَبَّ الْبَيْتِ الْحَرامِ ، يَا رَبَّ الشَّهْرِ الْحَرامِ ، يَا رَبَّ الْبَلَدِ الْحَرامِ ، يَا رَبَّ الرُّكْنِ وَالْمَقامِ ، يَا رَبَّ الْمَشْعَرِ الْحَرامِ ، يَا رَبَّ الْمَسْجِدِ الْحَرامِ ، يَا رَبَّ الْحِلِّ وَالْحَرامِ ، يَا رَبَّ النُّورِ وَالظَّلامِ ، يَا رَبَّ التَّحِيَّةِ وَالسَّلامِ ، يَا رَبَّ الْقُدْرَةِ فِى الْأَنامِ.

﴿۲۷﴾ يَا أَحْكَمَ الْحاكِمِينَ ، يَا أَعْدَلَ الْعادِلِينَ ، يَا أَصْدَقَ الصَّادِقِينَ ، يَا أَطْهَرَ الطَّاهِرِينَ ، يَا أَحْسَنَ الْخالِقِينَ ، يَا أَسْرَعَ الْحاسِبِينَ ، يَا أَسْمَعَ السَّامِعِينَ ، يَا أَبْصَرَ النَّاظِرِينَ ، يَا أَشْفَعَ الشَّافِعِينَ ، يَا أَكْرَمَ الْأَكْرَمِينَ.

﴿۲۸﴾ يَا عِمادَ مَنْ لَاعِمادَ لَهُ ، يَا سَنَدَ مَنْ لَاسَنَدَ لَهُ ، يَا ذُخْرَ مَنْ لَا ذُخْرَ لَهُ ، يَا حِرْزَ مَنْ لَاحِرْزَ لَهُ ، يَا غِياثَ مَنْ لَاغِياثَ لَهُ ، يَا فَخْرَ مَنْ لَافَخْرَ لَهُ ،يَا عِزَّ مَنْ لَاعِزَّ لَهُ ، يَا مُعِينَ مَنْ لَامُعِينَ لَهُ ، يَا أَنِيسَ مَنْ لَاأَنِيسَ لَهُ ، يَا أَمانَ مَنْ لَاأَمانَ لَهُ.

﴿۲۹﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا عَاصِمُ ، يَا قائِمُ ، يَا دائِمُ ، يَا راحِمُ ، يَا سالِمُ ، يَا حاكِمُ ، يَا عالِمُ ، يَا قاسِمُ ، يَا قابِضُ ، يَا باسِطُ.

﴿۳۰﴾ يَا عاصِمَ مَنِ اسْتَعْصَمَهُ ، يَا راحِمَ مَنِ اسْتَرْحَمَهُ ، يَا غافِرَ مَنِ اسْتَغْفَرَهُ ، يَا ناصِرَ مَنِ اسْتَنْصَرَهُ ، يَا حافِظَ مَنِ اسْتَحْفَظَهُ ، يَا مُكْرِمَ مَنِ اسْتَكْرَمَهُ ، يَا مُرْشِدَ مَنِ اسْتَرْشَدَهُ ، يَا صَرِيخَ مَنِ اسْتَصْرَخَهُ ، يَا مُعِينَ مَنِ اسْتَعانَهُ ، يَا مُغِيثَ مَنِ اسْتَغاثَهُ.

﴿۳۱﴾ يَا عَزِيزاً لَايُضامُ ، يَا لَطِيفاً لَايُرامُ ، يَا قَيُّوماً لَايَنامُ ، يَا دائِماً لَا يَفُوتُ ، يَا حَيّاً لَايَمُوتُ ، يَا مَلِكاً لَايَزُولُ ، يَا باقِياً لَايَفْنىٰ ، يَا عالِماً لَا يَجْهَلُ ، يَا صَمَداً لَايُطْعَمُ ، يَا قَوِيّاً لَايَضْعُفُ.

﴿۳۲﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا أَحَدُ ، يَا واحِدُ ، يَا شاهِدُ ، يَا ماجِدُ ، يَا حامِدُ ، يَا راشِدُ، يَا باعِثُ ، يَا وارِثُ ، يَا ضارُّ ، يَا نافِعُ.

﴿۳۳﴾ يَا أَعْظَمَ مِنْ كُلِّ عَظِيمٍ ، يَا أَكْرَمَ مِنْ كُلِّ كَرِيمٍ ، يَا أَرْحَمَ مِنْ كُلِّ رَحِيمٍ ، يَا أَعْلَمَ مِنْ كُلِّ عَلِيمٍ ، يَا أَحْكَمَ مِنْ كُلِّ حَكِيمٍ، يَا أَقْدَمَ مِنْ كُلِّ قَدِيمٍ ، يَا أَكْبَرَ مِنْ كُلِّ كَبِيرٍ، يَا أَ لْطَفَ مِنْ كُلِّ لَطِيفٍ ، يَا أَجَلَّ مِن كُلِّ جَلِيلٍ ، يَا أَعَزَّ مِنْ كُلِّ عَزِيزٍ.

﴿۳۴﴾ يَا كَرِيمَ الصَّفْحِ ، يَا عَظِيمَ الْمَنِّ ، يَا كَثِيرَ الْخَيْرِ ، يَا قَدِيمَ الْفَضْلِ ، يَا دائِمَ اللُّطْفِ، يَا لَطِيفَ الصُّنْعِ ، يَا مُنَفِّسَ الْكَرْبِ ، يَا كاشِفَ الضُّرِّ ، يَا مالِكَ الْمُلْكِ ، يَا قاضِىَ الْحَقِّ.

﴿۳۵﴾ يَا مَنْ هُوَ فِى عَهْدِهِ وَفِيٌّ ، يَا مَنْ هُوَ فِي وَفائِهِ قَوِيٌّ ، يَا مَنْ هُوَ فِي قُوَّتِهِ عَلِيٌّ ، يَا مَنْ هُوَ فِى عُلُوِّهِ قَرِيبٌ ، يَا مَنْ هُوَ فِى قُرْبِهِ لَطِيفٌ ، يَا مَنْ هُوَ فِى لُطْفِهِ شَرِيفٌ ، يَا مَنْ هُوَ فِى شَرَفِهِ عَزِيزٌ ،يَا مَنْ هُوَ فِى عِزِّهِ عَظِيمٌ ، يَا مَنْ هُوَ فِى عَظَمَتِهِ مَجِيدٌ ، يَا مَنْ هُوَ فِى مَجْدِهِ حَمِيدٌ.

﴿۳۶﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا كافِى ، يَا شافِى ، يَا وافِى ، يَا مُعافِى ، يَا هادِى ، يَا داعِى ، يَا قاضِى ، يَا راضِى ، يَا عالِى ، يَا باقِى.

﴿۳۷﴾ يَا مَنْ كُلُّ شَىْءٍ خاضِعٌ لَهُ ، يَا مَنْ كُلُّ شَىْءٍ خاشِعٌ لَهُ ، يَا مَنْ كُلُّ شَىْءٍ كائِنٌ لَهُ ، يَا مَنْ كُلُّ شَىْءٍ مَوْجُودٌ بِهِ ، يَا مَنْ كُلُّ شَىْءٍ مُنِيبٌ إِلَيْهِ ، يَا مَنْ كُلُّ شَىْءٍ خائِفٌ مِنْهُ ، يَا مَنْ كُلُّ شَىْءٍ قائِمٌ بِهِ ، يَا مَنْ كُلُّ شَىْءٍ صائِرٌ إِلَيْهِ ، يَا مَنْ كُلُّ شَىْءٍ يُسَبِّحُ بِحَمْدِهِ ، يَا مَنْ كُلُّ شَىْءٍ هالِكٌ إِلّا وَجْهَهُ.

﴿۳۸﴾ يَا مَنْ لَامَفَرَّ إِلّا إِلَيْهِ ، يَا مَنْ لَامَفْزَعَ إِلّا إِلَيْهِ ، يَا مَنْ لَامَقْصَدَ إِلّا إِلَيْهِ ، يَا مَنْ لَامَنْجٰا مِنْهُ إِلّا إِلَيْهِ ، يَا مَنْ لَايُرْغَبُ إِلّا إِلَيْهِ، يَا مَنْ لَاحَوْلَ وَلَا قُوَّةَ إِلّا بِهِ ، يَا مَنْ لَايُسْتَعانُ إِلّا بِهِ ، يَا مَنْ لَايُتَوَكَّلُ إِلّا عَلَيْهِ ، يَا مَنْ لَايُرْجىٰ إِلّا هُوَ ، يَا مَنْ لَايُعْبَدُ إِلّا هُوَ.

﴿۳۹﴾ يَا خَيْرَ الْمَرْهُوبِينَ ، يَا خَيْرَ الْمَرْغُوبِينَ ، يَا خَيْرَ الْمَطْلُوبِينَ ، يَا خَيْرَ الْمَسْؤُولِينَ ، يَا خَيْرَ الْمَقْصُودِينَ ، يَا خَيْرَ الْمَذْكُورِينَ، يَا خَيْرَ الْمَشْكُورِينَ ، يَا خَيْرَ الْمَحْبُوبِينَ ، يَا خَيْرَ الْمَدْعُوِّينَ ، يَا خَيْرَ الْمُسْتَأْنِسِينَ.

﴿۴۰﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا غافِرُ ، يَا ساتِرُ ، يَا قادِرُ ، يَا قاهِرُ ، يَا فاطِرُ ، يَا كاسِرُ ، يَا جابِرُ ، يَا ذاكِرُ ، يَا ناظِرُ ، يَا ناصِرُ.

﴿۴۱﴾ يَا مَنْ خَلَقَ فَسَوَّىٰ ، يَا مَنْ قَدَّرَ فَهَدىٰ ، يَا مَنْ يَكْشِفُ الْبَلْوىٰ ، يَا مَنْ يَسْمَعُ النَّجْوىٰ ، يَا مَنْ يُنْقِذُ الْغَرْقىٰ ، يَا مَنْ يُنْجِى الْهَلْكىٰ ، يَا مَنْ يَشْفِى الْمَرْضىٰ ، يَا مَنْ أَضْحَكَ وَأَبْكىٰ ، يَا مَنْ أَماتَ وَأَحْيىٰ ، يَا مَنْ خَلَقَ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنْثىٰ.

﴿۴۲﴾ يَا مَنْ فِى الْبَرِّ وَالْبَحْرِ سَبِيلُهُ ، يَا مَنْ فِى الْآفاقِ آياتُهُ ، يَا مَنْ فِى الْآياتِ بُرْهانُهُ ، يَا مَنْ فِى الْمَماتِ قُدْرَتُهُ ، يَا مَنْ فِى الْقُبُورِ عِبْرَتُهُ ، يَا مَنْ فِى الْقِيامَةِ مُلْكُهُ ، يَا مَنْ فِى الْحِسابِ هَيْبَتُهُ ، يَا مَنْ فِى الْمِيزانِ قَضاؤُهُ ، يَا مَنْ فِى الْجَنَّةِ ثَوابُهُ ، يَا مَنْ فِى النَّارِ عِقابُهُ.

﴿۴۳﴾ يَا مَنْ إِلَيْهِ يَهْرَبُ الْخائِفُونَ ، يَا مَنْ إِلَيْهِ يَفْزَعُ الْمُذْنِبُونَ ، يَا مَنْ إِلَيْهِ يَقْصِدُ الْمُنِيبُونَ ، يَا مَنْ إِلَيْهِ يَرْغَبُ الزَّاهِدُونَ ، يَا مَنْ إِلَيْهِ يَلْجَأُ الْمُتَحَيِّرُونَ ، يَا مَنْ بِهِ يَسْتَأْنِسُ الْمُرِيدُونَ ، يَا مَنْ بِهِ يَفْتَخِرُ الْمُحِبُّونَ ، يَا مَنْ فِى عَفْوِهِ يَطْمَعُ الْخاطِئُونَ ، يَا مَنْ إِلَيْهِ يَسْكُنُ الْمُوقِنُونَ ، يَا مَنْ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ.

﴿۴۴﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا حَبِيبُ ، يَا طَبِيبُ ، يَا قَرِيبُ ، يَا رَقِيبُ ، يَا حَسِيبُ ، يَا مُهِيبُ ، يَا مُثِيبُ ، يَا مُجِيبُ ، يَا خَبِيرُ ، يَا بَصِيرُ.

﴿۴۵﴾ يَا أَقْرَبَ مِنْ كُلِّ قَرِيبٍ ، يَا أَحَبَّ مِنْ كُلِّ حَبِيبٍ ، يَا أَبْصَرَ مِنْ كُلِّ بَصِيرٍ ، يَا أَخْبَرَ مِنْ كُلِّ خَبِيرٍ ، يَا أَشْرَفَ مِنْ كُلِّ شَرِيفٍ، يَا أَرْفَعَ مِنْ كُلِّ رَفِيعٍ ، يَا أَقْوىٰ مِنْ كُلِّ قَوِيٍّ ، يَا أَغْنىٰ مِنْ كُلِّ غَنِيٍّ ، يَا أَجْوَدَ مِنْ كُلِّ جَوادٍ ، يَا أَرْأَفَ مِنْ كُلِّ رَؤُوفٍ.

﴿۴۶﴾ يَا غالِباً غَيْرَ مَغْلُوبٍ ، يَا صانِعاً غَيْرَ مَصْنُوعٍ ، يَا خالِقاً غَيْرَ مَخْلُوقٍ ، يَا مالِكاً غَيْرَ مَمْلُوكٍ ، يَا قاهِراً غَيْرَ مَقْهُورٍ ، يَا رافِعاً غَيْرَ مَرْفُوعٍ ، يَا حافِظاً غَيْرَ مَحْفُوظٍ ، يَا ناصِراً غَيْرَ مَنْصُورٍ ، يَا شاهِداً غَيْرَ غائِبٍ ، يَا قَرِيباً غَيْرَ بَعِيدٍ.

﴿۴۷﴾ يَا نُورَ النُّورِ ، يَا مُنَوِّرَ النُّورِ ، يَا خالِقَ النُّورِ ، يَا مُدَبِّرَ النُّورِ ، يَا مُقَدِّرَ النُّورِ ، يَا نُورَ كُلِّ نُورٍ ، يَا نُوراً قَبْلَ كُلِّ نُورٍ ، يَا نُوراً بَعْدَ كُلِّ نُورٍ ، يَا نُوراً فَوْقَ كُلِّ نُورٍ ، يَا نُوراً لَيْسَ كَمِثْلِهِ نُورٌ.

﴿۴۸﴾ يَا مَنْ عَطَاؤُهُ شَرِيفٌ ، يَا مَنْ فِعْلُهُ لَطِيفٌ ، يَا مَنْ لُطْفُهُ مُقِيمٌ ، يَا مَنْ إِحْسانُهُ قَدِيمٌ ، يَا مَنْ قَوْلُهُ حَقٌّ ، يَا مَنْ وَعْدُهُ صِدْقٌ ، يَا مَنْ عَفْوُهُ فَضْلٌ ، يَا مَنْ عَذابُهُ عَدْلٌ ، يَا مَنْ ذِكْرُهُ حُلْوٌ ،يَا مَنْ فَضْلُهُ عَمِيمٌ.

﴿۴۹﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا مُسَهِّلُ ، يَا مُفَصِّلُ ، يَا مُبَدِّلُ ، يَا مُذَلِّلُ ، يَا مُنَزِّلُ ، يَا مُنَوِّلُ ، يَا مُفْضِلُ ، يَا مُجْزِلُ ، يَا مُمْهِلُ ، يَا مُجْمِلُ.

﴿۵۰﴾ يَا مَنْ يَرىٰ وَلَا يُرىٰ ، يَا مَنْ يَخْلُقُ وَلَا يُخْلَقُ ، يَا مَنْ يَهْدِى وَلَا يُهْدىٰ ، يَا مَنْ يُحْيِى وَلَا يُحْيىٰ ، يَا مَنْ يَسْأَلُ وَلَا يُسْأَلُ، يَا مَنْ يُطْعِمُ وَلَا يُطْعَمُ ، يَا مَنْ يُجِيرُ وَلَا يُجارُ عَلَيْهِ ، يَا مَنْ يَقْضِى وَلَا يُقْضىٰ عَلَيْهِ ، يَا مَنْ يَحْكُمُ وَلَا يُحْكَمُ عَلَيْهِ ، يَا مَنْ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ.

﴿۵۱﴾ يَا نِعْمَ الْحَسِيبُ ، يَا نِعْمَ الطَّبِيبُ ، يَا نِعْمَ الرَّقِيبُ ، يَا نِعْمَ الْقَرِيبُ ، يَا نِعْمَ الْمُجِيبُ ، يَا نِعْمَ الْحَبِيبُ ، يَانِعْمَ الْكَفِيلُ ، يَانِعْمَ الْوَكِيلُ ، يَانِعْمَ الْمَوْلىٰ ، يَا نِعْمَ النَّصِيرُ.

﴿۵۲﴾ يَا سُرُورَ الْعارِفِينَ ، يَا مُنَى الْمُحِبِّينَ ، يَا أَنِيسَ الْمُرِيدِينَ ، يَا حَبِيبَ التَّوَّابِينَ، يَا رازِقَ الْمُقِلِّينَ ، يَا رَجاءَ الْمُذْنِبِينَ ، يَا قُرَّةَ عَيْنِ الْعابِدِينَ ، يَا مُنَفِّساً عَنِ الْمَكْرُوبِينَ ، يَا مُفَرِّجاً عَنِ الْمَغْمُومِينَ ، يَا إِلٰهَ الْأَوَّلِينَ وَالْآخِرِينَ.

﴿۵۳﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا رَبَّنا ، يَا إِلٰهَنا ، يَا سَيِّدَنا ، يَا مَوْلانا ، يَا ناصِرَنا ، يَا حافِظَنا ، يَا دَلِيلَنا ، يَا مُعِينَنا ، يَا حَبِيبَنا، يَا طَبِيبَنا.

﴿۵۴﴾ يَا رَبَّ النَّبِيِّينَ وَ الْأَبْرارِ ، يَا رَبَّ الصِّدِّيقِينَ وَالْأَخْيارِ ، يَا رَبَّ الْجَنَّةِ وَالنَّارِ، يَا رَبَّ الصِّغارِ وَالْكِبارِ ، يَا رَبَّ الْحُبُوبِ وَالثِّمارِ ، يَا رَبَّ الْأَ نْهارِ وَالْأَشْجارِ ، يَا رَبَّ الصَّحارِى وَالْقِفارِ ، يَا رَبَّ الْبَرارِى وَالْبِحارِ ، يَا رَبَّ اللَّيْلِ وَالنَّهارِ ، يَا رَبَّ الْأَعْلانِ وَالْأَسْرارِ.

﴿۵۵﴾ يَا مَنْ نَفَذَ فِى كُلِّ شَىْءٍ أَمْرُهُ ، يَا مَنْ لَحِقَ بِكُلِّ شَىْءٍ عِلْمُهُ ، يَا مَنْ بَلَغَتْ إِلىٰ كُلِّ شَىْءٍ قُدْرَتُهُ ، يَا مَنْ لَاتُحْصِى الْعِبادُ نِعَمَهُ ، يَا مَنْ لَا تَبْلُغُ الْخَلائِقُ شُكْرَهُ ، يَا مَنْ لَاتُدْرِكُ الْأَفْهامُ جَلالَهُ ، يَا مَنْ لَاتَنالُ الْأَوْهامُ كُنْهَهُ ، يَا مَنِ الْعَظَمَةُ وَالْكِبْرِيَاءُ رِداؤُهُ ، يَا مَنْ لَاتَرُدُّ الْعِبادُ قَضاءَهُ ، يَا مَنْ لَا مُلْكَ إِلّا مُلْكُهُ ، يَا مَنْ لَاعَطاءَ إِلّا عَطاؤُهُ.

﴿۵۶﴾ يَا مَنْ لَهُ الْمَثَلُ الْأَعْلىٰ ، يَا مَنْ لَهُ الصِّفاتُ الْعُلْيا ، يَا مَنْ لَهُ الْآخِرَةُ وَالْأُولىٰ ، يَا مَنْ لَهُ جَنَّةُ الْمَأْوىٰ ، يَا مَنْ لَهُ الْآياتُ الْكُبْرىٰ ، يَا مَنْ لَهُ الْأَسْماءُ الْحُسْنىٰ ، يَا مَنْ لَهُ الْحُكْمُ وَالْقَضاءُ ، يَا مَنْ لَهُ الْهَواءُ وَالْفَضاءُ ، يَا مَنْ لَهُ الْعَرْشُ وَالثَّرىٰ ، يَا مَنْ لَهُ السَّمَاوَاتُ الْعُلىٰ.

﴿۵۷﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا عَفُوُّ ، يَا غَفُورُ ، يَا صَبُورُ ، يَا شَكُورُ ، يَا رَؤُوفُ ، يَا عَطُوفُ ، يَا مَسْؤُولُ ، يَا وَدُودُ ، يَا سُبُّوحُ، يَا قُدُّوسُ.

﴿۵۸﴾ يَا مَنْ فِى السَّماءِ عَظَمَتُهُ ، يَا مَنْ فِى الْأَرْضِ آياتُهُ ، يَا مَنْ فِى كُلِّ شَىْءٍ دَلائِلُهُ ، يَا مَنْ فِى الْبِحارِ عَجائِبُهُ ، يَا مَنْ فِى الْجِبالِ خَزائِنُهُ ، يَا مَنْ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ ، يَا مَنْ إِلَيْهِ يَرْجِعُ الْأَمْرُ كُلُّهُ ، يَا مَنْ أَظْهَرَ فِى كُلِّ شَىْءٍ لُطْفَهُ ، يَا مَنْ أَحْسَنَ كُلَّ شَىْءٍ خَلْقَهُ ، يَا مَنْ تَصَرَّفَ فِى الْخَلائِقِ قُدْرَتُهُ.

﴿۵۹﴾ يَا حَبِيبَ مَنْ لَاحَبِيبَ لَهُ ، يَا طَبِيبَ مَنْ لَاطَبِيبَ لَهُ ، يَا مُجِيبَ مَنْ لَامُجِيبَ لَهُ ، يَا شَفِيقَ مَنْ لَاشَفِيقَ لَهُ ، يَا رَفِيقَ مَنْ لَارَفِيقَ لَهُ ، يَا مُغِيثَ مَنْ لَامُغِيثَ لَهُ ، يَا دَلِيلَ مَنْ لَادَلِيلَ لَهُ ، يَا أَنِيسَ مَنْ لَاأَنِيسَ لَهُ ، يَا راحِمَ مَنْ لَاراحِمَ لَهُ ، يَا صاحِبَ مَنْ لَاصاحِبَ لَهُ.

﴿۶۰﴾ يَا كافِىَ مَنِ اسْتَكْفاهُ ، يَا هادِىَ مَنِ اسْتَهْداهُ ، يَا كالِئَ مَنِ اسْتَكْلاهُ ، يَا راعِىَ مَنِ اسْتَرْعاهُ ، يَا شافِىَ مَنِ اسْتَشْفاهُ ، يَا قاضِىَ مَنِ اسْتَقْضاهُ ، يَا مُغْنِىَ مَنِ اسْتَغْناهُ ، يَامُوفِىَ مَنِ اسْتَوْفاهُ ، يَامُقَوِّىَ مَنِ اسْتَقْواهُ ، يَاوَلِىَّ مَنِ اسْتَوْلاهُ.

﴿۶۱﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا خالِقُ ، يَا رازِقُ ، يَا ناطِقُ ، يَاصادِقُ ، يَا فالِقُ ، يَا فارِقُ ، يَا فاتِقُ ، يَا راتِقُ ، يَا سابِقُ ، يَا سامِقُ.

﴿۶۲﴾ يَا مَنْ يُقَلِّبُ اللَّيْلَ وَالنَّهارَ ، يَا مَنْ جَعَلَ الظُّلُمَاتِ وَالْأَنْوارَ ، يَا مَنْ خَلَقَ الظِّلَّ وَالْحَرُورَ ، يَا مَنْ سَخَّرَ الشَّمْسَ وَالْقَمَرَ ، يَا مَنْ قَدَّرَ الْخَيْرَ وَالشَّرَّ ، يَا مَنْ خَلَقَ الْمَوْتَ وَالْحَياةَ ، يَا مَنْ لَهُ الْخَلْقُ وَالْأَمْرُ ، يَا مَنْ لَمْ يَتَّخِذْ صاحِبَةً وَلَا وَلَداً ، يَا مَنْ لَيْسَ لَهُ شَرِيكٌ فِى الْمُلْكِ ، يَا مَنْ لَمْ يَكُنْ لَهُ وَ لِيٌّ مِنَ الذُّلِّ.

﴿۶۳﴾ يَا مَنْ يَعْلَمُ مُرادَ الْمُرِيدِينَ ، يَا مَنْ يَعْلَمُ ضَمِيرَ الصَّامِتِينَ ، يَا مَنْ يَسْمَعُ أَنِينَ الْواهِنِينَ ، يَا مَنْ يَرىٰ بُكاءَ الْخائِفِينَ ، يَا مَنْ يَمْلِكُ حَوائِجَ السَّائِلِينَ ، يَا مَنْ يَقْبَلُ عُذْرَ التَّائِبِينَ ، يَا مَنْ لَايُصْلِحُ عَمَلَ الْمُفْسِدِينَ ، يَا مَنْ لَايُضِيعُ أَجْرَ الْمُحْسِنِينَ ، يَا مَنْ لَايَبْعُدُ عَنْ قُلُوبِ الْعارِفِينَ ، يَا أَجْوَدَ الْأَجْوَدِينَ.

﴿۶۴﴾ يَا دائِمَ الْبَقاءِ ، يَا سامِعَ الدُّعاءِ ، يَا واسِعَ الْعَطاءِ ، يَا غافِرَ الْخَطاءِ ، يَا بَدِيعَ السَّماءِ ، يَا حَسَنَ الْبَلاءِ ، يَا جَمِيلَ الثَّناءِ ، يَا قَدِيمَ السَّناءِ ، يَا كَثِيرَ الْوَفاءِ ، يَا شَرِيفَ الْجَزاءِ.

﴿۶۵﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا سَتَّارُ ، يَا غَفَّارُ ، يَا قَهَّارُ ، يَا جَبَّارُ ، يَا صَبَّارُ ، يَا بارُّ ، يَا مُخْتارُ ، يَا فَتَّاحُ ، يَا نَفَّاحُ ، يَا مُرْتاحُ.

﴿۶۶﴾ يَا مَنْ خَلَقَنِى وَسَوَّانِى ، يَا مَنْ رَزَقَنِى وَرَبَّانِى ، يَا مَنْ أَطْعَمَنِى وَسَقانِى ، يَا مَنْ قَرَّبَنِى وَأَدْنانِى ، يَا مَنْ عَصَمَنِى وَكَفانِى ، يَا مَنْ حَفِظَنِى وَكَلانِى ، يَا مَنْ أَعَزَّنِى وَأَغْنانِى ، يَا مَنْ وَفَّقَنِى وَهَدانِى ، يَا مَنْ آنَسَنِى وَآوانِى ، يَا مَنْ أَماتَنِى وَأَحْيانِى.

﴿۶۷﴾ يَا مَنْ يُحِقُّ الْحَقَّ بِكَلِماتِهِ ، يَا مَنْ يَقْبَلُ التَّوْبَةَ عَنْ عِبادِهِ ، يَا مَنْ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ ، يَا مَنْ لَاتَنْفَعُ الشَّفاعَةُ إِلّا بِإِذْنِهِ ، يَا مَنْ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ ، يَا مَنْ لَامُعَقِّبَ لِحُكْمِهِ ، يَا مَنْ لَارَادَّ لِقَضائِهِ ، يَا مَنِ انْقادَ كُلُّ شَىْءٍ لِأَمْرِهِ ، يَا مَنِ السَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ ، يَا مَنْ يُرْسِلُ الرِّياحَ بُشْراً بَيْنَ يَدَيْ رَحْمَتِهِ.

﴿۶۸﴾ يَا مَنْ جَعَلَ الْأَرْضَ مِهاداً ، يَا مَنْ جَعَلَ الْجِبالَ أَوْتاداً ، يَا مَنْ جَعَلَ الشَّمْسَ سِراجاً ، يَا مَنْ جَعَلَ الْقَمَرَ نُوراً ، يَا مَنْ جَعَلَ اللَّيْلَ لِباساً ، يَا مَنْ جَعَلَ النَّهارَ مَعَاشاً ، يَا مَنْ جَعَلَ النَّوْمَ سُباتاً ، يَا مَنْ جَعَلَ السَّمَاءَ بِناءً ، يَا مَنْ جَعَلَ الْأَشْياءَ أَزْواجاً، يَا مَنْ جَعَلَ النَّارَ مِرْصاداً.

﴿۶۹﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا سَمِيعُ ، يَا شَفِيعُ ، يَا رَفِيعُ ، يَا مَنِيعُ ، يَا سَرِيعُ ، يَا بَدِيعُ ، يَا كَبِيرُ ، يَا قَدِيرُ ، يَا خَبِيرُ ، يَا مُجِيرُ.

﴿۷۰﴾ يَا حَيّاً قَبْلَ كُلِّ حَيٍّ ، يَا حَيّاً بَعْدَ كُلِّ حَيٍّ ، يَا حَىُّ الَّذِي لَيْسَ كَمِثْلِهِ حَيٌّ ، يَا حَىُّ الَّذِي لَايُشارِكُهُ حَيٌّ ، يَا حَىُّ الَّذِى لَا يَحْتاجُ إِلىٰ حَيٍّ ، يَا حَىُّ الَّذِي يُمِيتُ كُلَّ حَيٍّ ، يَا حَىُّ الَّذِي يَرْزُقُ كُلَّ حَيٍّ ، يَا حَيّاً لَمْ يَرِثِ الْحَياةَ مِنْ حَيٍّ ، يَا حَىُّ الَّذِي يُحْيِي الْمَوْتىٰ ، يَا حَىُّ يَا قَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ.

﴿۷۱﴾ يَا مَنْ لَهُ ذِكْرٌ لَايُنْسىٰ ، يَا مَنْ لَهُ نُورٌ لَايُطْفىٰ ، يَا مَنْ لَهُ نِعَمٌ لَاتُعَدُّ ، يَا مَنْ لَهُ مُلْكٌ لَايَزُولُ ، يَا مَنْ لَهُ ثَنَاءٌ لَايُحْصىٰ ، يَا مَنْ لَهُ جَلالٌ لَايُكَيَّفُ ، يَا مَنْ لَهُ كَمالٌ لَايُدْرَكُ ، يَا مَنْ لَهُ قَضاءٌ لَايُرَدُّ ، يَا مَنْ لَهُ صِفاتٌ لَاتُبَدَّلُ ، يَا مَنْ لَهُ نُعُوتٌ لَاتُغَيَّرُ.

﴿۷۲﴾ يَا رَبَّ الْعالَمِينَ ، يَا مالِكَ يَوْمِ الدِّينِ ، يَا غايَةَ الطَّالِبِينَ ، يَا ظَهْرَ اللَّاجِينَ ، يَا مُدْرِكَ الْهارِبِينَ ، يَا مَنْ يُحِبُّ الصَّابِرِينَ ، يَا مَنْ يُحِبُّ التَّوَّابِينَ ، يَا مَنْ يُحِبُّ الْمُتَطَهِّرِينَ ، يَا مَنْ يُحِبُّ الْمُحْسِنِينَ ، يَا مَنْ هُوَ أَعْلَمُ بِالْمُهْتَدِينَ.

﴿۷۳﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا شَفِيقُ ، يَا رَفِيقُ ، يَا حَفِيظُ ، يَا مُحِيطُ ، يَا مُقِيتُ ، يَا مُغِيثُ ، يَا مُعِزُّ ، يَا مُذِلُّ ، يَا مُبْدِئُ، يَا مُعِيدُ.

﴿۷۴﴾ يَا مَنْ هُوَ أَحَدٌ بِلا ضِدٍّ ، يَا مَنْ هُوَ فَرْدٌ بِلا نِدٍّ ، يَا مَنْ هُوَ صَمَدٌ بِلا عَيْبٍ ، يَا مَنْ هُوَ وِتْرٌ بِلا كَيْفٍ ، يَا مَنْ هُوَ قاضٍ بِلا حَيْفٍ ، يَا مَنْ هُوَ رَبٌّ بِلا وَزِيرٍ ، يَا مَنْ هُوَ عَزِيزٌ بِلا ذُلٍّ ، يَا مَنْ هُوَ غَنِيٌّ بِلا فَقْرٍ ، يَا مَنْ هُوَ مَلِكٌ بِلا عَزْلٍ ، يَا مَنْ هُوَ مَوْصُوفٌ بِلا شَبِيهٍ.

﴿۷۵﴾ يَا مَنْ ذِكْرُهُ شَرَفٌ لِلذَّاكِرِينَ ، يَا مَنْ شُكْرُهُ فَوْزٌ لِلشَّاكِرِينَ ، يَا مَنْ حَمْدُهُ عِزٌّ لِلْحامِدِينَ ، يَا مَنْ طَاعَتُهُ نَجاةٌ لِلْمُطِيعِينَ، يَا مَنْ بابُهُ مَفْتُوحٌ لِلطَّالِبِينَ ، يَا مَنْ سَبِيلُهُ واضِحٌ لِلْمُنِيبِينَ ، يَا مَنْ آياتُهُ بُرْهانٌ لِلنَّاظِرِينَ ، يَا مَنْ كِتابُهُ تَذْكِرَةٌ لِلْمُتَّقِينَ ، يَا مَنْ رِزْقُهُ عُمُومٌ لِلطَّائِعِينَ وَالْعاصِينَ ، يَا مَنْ رَحْمَتُهُ قَرِيبٌ مِنَ الْمُحْسِنِينَ.

﴿۷۶﴾ يَا مَنْ تَبارَكَ اسْمُهُ ، يَا مَنْ تَعالىٰ جَدُّهُ ، يَا مَنْ لَاإِلٰهَ غَيْرُهُ ، يَا مَنْ جَلَّ ثَناؤُهُ ، يَا مَنْ تَقَدَّسَتْ أَسْماؤُهُ ، يَا مَنْ يَدُومُ بَقاؤُهُ ، يَا مَنِ الْعَظَمَةُ بَهاؤُهُ ، يَا مَنِ الْكِبْرِياءُ رِداؤُهُ ، يَا مَنْ لَاتُحْصىٰ آلاؤُهُ ، يَا مَنْ لَاتُعَدُّ نَعْماؤُهُ.

﴿۷۷﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا مُعِينُ ، يَا أَمِينُ ، يَا مُبِينُ ، يَا مَتِينُ ، يَا مَكِينُ ، يَا رَشِيدُ ، يَا حَمِيدُ ، يَا مَجِيدُ ، يَا شَدِيدُ ، يَا شَهِيدُ.

﴿۷۸﴾ يَا ذَا الْعَرْشِ الْمَجِيدِ ، يَا ذَا الْقَوْلِ السَّدِيدِ ، يَا ذَا الْفِعْلِ الرَّشِيدِ ، يَا ذَا الْبَطْشِ الشَّدِيدِ ، يَا ذَا الْوَعْدِ وَالْوَعِيدِ ، يَا مَنْ هُوَ الْوَلِىُّ الْحَمِيدُ ، يَا مَنْ هُوَ فَعَّالٌ لِما يُرِيدُ ، يَا مَنْ هُوَ قَرِيبٌ غَيْرُ بَعِيدٍ ، يَا مَنْ هُوَ عَلىٰ كُلِّ شَىْءٍ شَهِيدٌ ، يَا مَنْ هُوَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ.

﴿۷۹﴾ يَا مَنْ لَاشَرِيكَ لَهُ وَلَا وَزِيرَ ، يَا مَنْ لَاشَبِيهَ لَهُ وَلَا نَظِيرَ ، يَا خالِقَ الشَّمْسِ وَالْقَمَرِ الْمُنِيرِ ، يَا مُغْنِىَ الْبائِسِ الْفَقِيرِ ، يَا رازِقَ الطِّفْلِ الصَّغِيرِ ، يَا راحِمَ الشَّيْخِ الْكَبِيرِ ، يَا جابِرَ الْعَظْمِ الْكَسِيرِ ، يَا عِصْمَةَ الْخائِفِ الْمُسْتَجِيرِ ، يَا مَنْ هُوَ بِعِبادِهِ خَبِيرٌ بَصِيرٌ ، يَا مَنْ هُوَ عَلىٰ كُلِّ شَىْءٍ قَدِيرٌ.

﴿۸۰﴾ يَا ذَا الْجُودِ وَالنِّعَمِ ، يَا ذَا الْفَضْلِ وَالْكَرَمِ ، يَا خالِقَ اللَّوْحِ وَالْقَلَمِ ، يَا بارِئَ الذَّرِّ وَالنَّسَمِ ، يَا ذَا الْبَأْسِ وَالنِّقَمِ ، يَا مُلْهِمَ الْعَرَبِ وَالْعَجَمِ ، يَا كَاشِفَ الضُّرِّ وَالْأَلَمِ ، يَا عَالِمَ السِّرِّ وَالْهِمَمِ ، يَا رَبَّ الْبَيْتِ وَالْحَرَمِ ، يَا مَنْ خَلَقَ الْأَشْياءَ مِنَ الْعَدَمِ.

﴿۸۱﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا فاعِلُ ، يَاجاعِلُ ، يَا قابِلُ ، يَا كامِلُ ، يَا فاصِلُ ، يَا واصِلُ ، يَا عادِلُ ، يَا غالِبُ ، يَاطالِبُ ، يَا واهِبُ.

﴿۸۲﴾ يَا مَنْ أَنْعَمَ بِطَوْلِهِ ، يَا مَنْ أَكْرَمَ بِجُودِهِ ، يَا مَنْ جادَ بِلُطْفِهِ ، يَا مَنْ تَعَزَّزَ بِقُدْرَتِهِ، يَا مَنْ قَدَّرَ بِحِكْمَتِهِ ، يَا مَنْ حَكَمَ بِتَدْبِيرِهِ ، يَا مَنْ دَبَّرَ بِعِلْمِهِ ، يَا مَنْ تَجاوَزَ بِحِلْمِهِ ، يَا مَنْ دَنَا فِى عُلُّوِهِ ، يَا مَنْ عَلا فِى دُنُوِّهِ.

﴿۸۳﴾ يَا مَنْ يَخْلُقُ ما يَشَاءُ ، يَا مَنْ يَفْعَلُ ما يَشَاءُ ، يَا مَنْ يَهْدِى مَنْ يَشَاءُ ، يَا مَنْ يُضِلُّ مَنْ يَشَاءُ ، يَا مَنْ يُعَذِّبُ مَنْ يَشَاءُ ، يَا مَنْ يَغْفِرُ لِمَنْ يَشَاءُ ، يَا مَنْ يُعِزُّ مَنْ يَشَاءُ ، يَا مَنْ يُذِلُّ مَنْ يَشَاءُ ، يَا مَنْ يُصَوِّرُ فِى الْأَرْحامِ مَا يَشَاءُ ، يَا مَنْ يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ.

﴿۸۴﴾ يَا مَنْ لَمْ يَتَّخِذْ صاحِبَةً وَلَا وَلَداً ، يَا مَنْ جَعَلَ لِكُلِّ شَىْءٍ قَدْراً ، يَا مَنْ لَايُشْرِكُ فِى حُكْمِهِ أَحَداً ، يَا مَنْ جَعَلَ الْمَلائِكَةَ رُسُلاً ، يَا مَنْ جَعَلَ فِى السَّماءِ بُرُوجاً ، يَا مَنْ جَعَلَ الْأَرْضَ قَراراً ، يَا مَنْ خَلَقَ مِنَ الْمَاءِ بَشَراً ، يَا مَنْ جَعَلَ لِكُلِّ شَىْءٍ أَمَداً ، يَا مَنْ أَحاطَ بِكُلِّ شَىْءٍ عِلْماً ، يَا مَنْ أَحْصىٰ كُلَّ شَىْءٍ عَدَداً.

﴿۸۵﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا أَوَّلُ ، يَا آخِرُ ، يَاظاهِرُ ، يَا باطِنُ ، يَابَرُّ ، يَاحَقُّ ، يَافَرْدُ، يَاوِتْرُ ، يَاصَمَدُ ، يَاسَرْمَدُ.

﴿۸۶﴾ يَا خَيْرَ مَعْرُوفٍ عُرِفَ ، يَا أَفْضَلَ مَعْبُودٍ عُبِدَ ، يَا أَجَلَّ مَشْكُورٍ شُكِرَ ، يَا أَعَزَّ مَذْكُورٍ ذُكِرَ ، يَا أَعْلىٰ مَحْمُودٍ حُمِدَ ، يَا أَقْدَمَ مَوْجُودٍ طُلِبَ ، يَا أَرْفَعَ مَوْصُوفٍ وُصِفَ ، يَا أَكْبَرَ مَقْصُودٍ قُصِدَ ، يَا أَكْرَمَ مَسْؤُولٍ سُئِلَ ، يَا أَشْرَفَ مَحْبُوبٍ عُلِمَ.

﴿۸۷﴾ يَا حَبِيبَ الْباكِينَ ، يَا سَيِّدَ الْمُتَوَكِّلِينَ ، يَا هادِىَ الْمُضِلِّينَ ، يَا وَلِىَّ الْمُؤْمِنِينَ ، يَا أَنِيسَ الذَّاكِرِينَ ، يَا مَفْزَعَ الْمَلهُوفِينَ ، يَا مُنْجِىَ الصَّادِقِينَ ، يَا أَقْدَرَ الْقادِرِينَ ، يَا أَعْلَمَ الْعالِمِينَ ، يَا إِلٰهَ الْخَلْقِ أَجْمَعِينَ.

﴿۸۸﴾ يَا مَنْ عَلا فَقَهَرَ ، يَا مَنْ مَلَكَ فَقَدَرَ ، يَا مَنْ بَطَنَ فَخَبَرَ ، يَا مَنْ عُبِدَ فَشَكَرَ ، يَا مَنْ عُصِىَ فَغَفَرَ ، يَا مَنْ لَاتَحْوِيهِ الْفِكَرُ ، يَامَنْ لَايُدْرِكُهُ بَصَرٌ ، يَا مَنْ لَايَخْفىٰ عَلَيْهِ أَثَرٌ، يَا رازِقَ الْبَشَرِ ، يَا مُقَدِّرَ كُلِّ قَدَرٍ.

﴿۸۹﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا حافِظُ ، يَا بارِئُ ، يَا ذارِئُ يَا باذِخُ ، يَافارِجُ ، يَا فاتِحُ، يَا كاشِفُ ، يَا ضامِنُ ، يَا آمِرُ ، يَا ناهِى.

﴿۹۰﴾ يَامَنْ لَا يَعْلَمُ الْغَيْبَ إِلّا هُوَ ، يَا مَنْ لَايَصْرِفُ السُّوءَ إِلّا هُوَ ، يَا مَنْ لَايَخْلُقُ الْخَلْقَ إِلّا هُوَ ، يَا مَنْ لَايَغْفِرُ الذَّنْبَ إِلّا هُوَ ، يَا مَنْ لَايُتِمُّ النِّعْمَةَ إِلّا هُوَ ، يَا مَنْ لَايُقَلِّبُ الْقُلُوبَ إِلّا هُوَ ، يَا مَنْ لَايُدَبِّرُ الْأَمْرَ إِلّا هُوَ ، يَا مَنْ لَايُنَزِّلُ الْغَيْثَ إِلّا هُوَ ، يَا مَنْ لَا يَبْسُطُ الرِّزْقَ إِلّا هُوَ ، يَا مَنْ لَايُحْيِى الْمَوْتىٰ إِلّا هُوَ.

﴿۹۱﴾ يَا مُعِينَ الْضُعَفاءِ ، يَا صاحِبَ الْغُرَباءِ ، يَا ناصِرَ الْأَوْلِياءِ ، يَا قاهِرَ الْأَعْداءِ ، يَا رافِعَ السَّماءِ ، يَا أَنِيسَ الْأَصْفِياءِ ، يَا حَبِيبَ الْأَتْقِياءِ ، يَا كَنْزَ الْفُقَراءِ ، يَا إِلٰهَ الْأَغْنِياءِ ، يَا أَكْرَمَ الْكُرَماءِ.

﴿۹۲﴾ يَا كافِياً مِنْ كُلِّ شَىْءٍ ، يَا قائِماً عَلَىٰ كُلِّ شَىْءٍ ، يَا مَنْ لَا يُشْبِهُهُ شَىْءٌ ، يَا مَنْ لَايَزِيدُ فِى مُلْكِهِ شَىْءٌ ، يَا مَنْ لَايَخْفىٰ عَلَيْهِ شَىْءٌ ، يَا مَنْ لَا يَنْقُصُ مِنْ خَزائِنِهِ شَىْءٌ، يَا مَنْ لَيْسَ كَمِثْلِهِ شَىْءٌ ، يَا مَنْ لَايَعْزُبُ عَنْ عِلْمِهِ شَىْءٌ ، يَا مَنْ هُوَ خَبِيرٌ بِكُلِّ شَىْءٍ ، يَا مَنْ وَسِعَتْ رَحْمَتُهُ كُلَّ شَىْءٍ.

﴿۹۳﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا مُكْرِمُ ، يَا مُطْعِمُ ، يَا مُنْعِمُ ، يَا مُعْطِى ، يَا مُغْنِى ، يَا مُقْنِى ، يَا مُفْنِى ، يَا مُحْيِى ، يَا مُرْضِى ، يَا مُنْجِى.

﴿۹۴﴾ يَا أَوَّلَ كُلِّ شَىْءٍ وَآخِرَهُ ، يَا إِلٰهَ كُلِّ شَىْءٍ وَمَلِيكَهُ ، يَا رَبَّ كُلِّ شَىْءٍ وَصانِعَهُ ، يَا بارِئَ كُلِّ شَىْءٍ وَخالِقَهُ ، يَا قابِضَ كُلِّ شَىْءٍ وَباسِطَهُ ، يَا مُبْدِئَ كُلِّ شَىْءٍ وَمُعِيدَهُ ، يَا مُنْشِئَ كُلِّ شَىْءٍ وَمُقَدِّرَهُ ، يَا مُكَوِّنَ كُلِّ شَىْءٍ وَمُحَوِّلَهُ ، يَا مُحْيِىَ كُلِّ شَىْءٍ وَمُمِيتَهُ ، يَا خالِقَ كُلِّ شَىْءٍ وَوارِثَهُ.

﴿۹۵﴾ يَا خَيْرَ ذاكِرٍ وَمَذْكُورٍ ، يَا خَيْرَ شاكِرٍ وَمَشْكُورٍ ، يَا خَيْرَ حامِدٍ وَمَحْمُودٍ ، يَا خَيْرَ شاهِدٍ وَمَشْهُودٍ ، يَا خَيْرَ داعٍ وَمَدْعُوٍّ ، يَا خَيْرَ مُجِيبٍ وَمُجابٍ ، يَا خَيْرَ مُؤْنِسٍ وَأَنِيسٍ ، يَا خَيْرَ صاحِبٍ وَجَلِيسٍ ، يَا خَيْرَ مَقْصُودٍ وَمَطْلُوبٍ ، يَا خَيْرَ حَبِيبٍ وَمَحْبُوبٍ.

﴿۹۶﴾ يَا مَنْ هُوَ لِمَنْ دَعاهُ مُجِيبٌ ، يَا مَنْ هُوَ لِمَنْ أَطاعَهُ حَبِيبٌ ، يَا مَنْ هُوَ إِلَىٰ مَنْ أَحَبَّهُ قَرِيبٌ ، يَا مَنْ هُوَ بِمَنِ اسْتَحْفَظَهُ رَقِيبٌ ، يَا مَنْ هُوَ بِمَنْ رَجاهُ كَرِيمٌ ، يَا مَنْ هُوَ بِمَنْ عَصاهُ حَلِيمٌ ، يَا مَنْ هُوَ فِى عَظَمَتِهِ رَحِيمٌ ، يَا مَنْ هُوَ فِى حِكْمَتِهِ عَظِيمٌ ، يَا مَنْ هُوَ فِى إِحْسانِهِ قَدِيمٌ ، يَا مَنْ هُوَ بِمَنْ أَرادَهُ عَلِيمٌ.

﴿۹۷﴾ اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِاسْمِكَ يَا مُسَبِّبُ ، يَا مُرَغِّبُ ، يَا مُقَلِّبُ ، يَا مُعَقِّبُ ، يَا مُرَتِّبُ ، يَا مُخَوِّفُ ، يَا مُحَذِّرُ ، يَا مُذَكِّرُ ، يَا مُسَخِّرُ ، يَا مُغَيِّرُ.

﴿۹۸﴾ يَا مَنْ عِلْمُهُ سابِقٌ ، يَا مَنْ وَعْدُهُ صادِقٌ ، يَا مَنْ لُطْفُهُ ظاهِرٌ ، يَا مَنْ أَمْرُهُ غالِبٌ ، يَا مَنْ كِتابُهُ مُحْكَمٌ ، يَا مَنْ قَضاؤُهُ كائِنٌ ، يَا مَنْ قُرْآنُهُ مَجِيدٌ ، يَا مَنْ مُلْكُهُ قَدِيمٌ ، يَا مَنْ فَضْلُهُ عَمِيمٌ ، يَا مَنْ عَرْشُهُ عَظِيمٌ.

﴿۹۹﴾ يَا مَنْ لَايَشْغَلُهُ سَمْعٌ عَنْ سَمْعٍ ، يَا مَنْ لَايَمْنَعُهُ فِعْلٌ عَنْ فِعْلٍ ، يَا مَنْ لَايُلْهِيهِ قَوْلٌ عَنْ قَوْلٍ ، يَا مَنْ لَايُغَلِّطُهُ سُؤالٌ عَنْ سُؤالٍ ، يَا مَنْ لَايَحْجُبُهُ شَىْءٌ عَنْ شَىْءٍ ، يَا مَنْ لَايُبْرِمُهُ إِلْحاحُ الْمُلِحِّينَ ، يَا مَنْ هُوَ غايَةُ مُرادِ الْمُرِيدِينَ ، يَا مَنْ هُوَ مُنْتَهىٰ هِمَمِ الْعارِفِينَ ، يَا مَنْ هُوَ مُنْتَهىٰ طَلَبِ الطَّالِبِينَ ، يَا مَنْ لَايَخْفىٰ عَلَيْهِ ذَرَّةٌ فِى الْعالَمِينَ.

﴿۱۰۰﴾ يَا حَلِيماً لَايَعْجَلُ ، يَا جَوَاداً لَايَبْخَلُ ، يَا صادِقاً لَا يُخْلِفُ ، يَا وَهَّاباً لَايَمَلُّ ، يَا قاهِراً لَايُغْلَبُ ، يَا عَظِيماً لَايُوصَفُ ، يَا عَدْلاً لَا يَحِيفُ ، يَا غَنِيّاً لَايَفْتَقِرُ ، يَا كَبِيراً لَايَصْغُرُ ، يَا حافِظاً لَايَغْفُلُ ، سُبْحانَكَ يَا لَا إِلٰهَ إِلّا أَنْتَ ، الْغَوْثَ الْغَوْثَ خَلِّصْنا مِنَ النَّارِ يَا رَبِّ.''',
    benefits: "مروي عن السجاد عن أبيه عن جده النبي الأكرم (صلى الله عليه وآله) نزل به جبرئيل في بعض الغزوات، ويحتوي على مئة فصل يشتمل كل فصل منها على عشرة أسماء من أسماء الله تعالى.",
  ),
  Dua(
    title: "دعاء الجوشن الصغير",
    text: r'''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ إِلٰهِى كَمْ مِنْ عَدُوٍّ انْتَضىٰ عَلَىَّ سَيْفَ عَداوَتِهِ ، وَشَحَذَ لِى ظُبَةَ مِدْيَتِهِ ، وَأَرْهَفَ لِى شَبَا حَدِّهِ ، وَدافَ لِى قَواتِلَ سُمُومِهِ ، وَسَدَّدَ إِلىَّ صَوائِبَ سِهامِهِ ، وَلَمْ تَنَمْ عَنِّى عَيْنُ حِراسَتِهِ ، وَأَضْمَرَ أَنْ يَسُومَنِى الْمَكْرُوهَ ، وَيُجَرِّعَنِى ذُعافَ مَرارَتِهِ؛

فَنَظَرْتَ إِلىٰ ضَعْفِى عَنِ احْتِمالِ الْفَوادِحِ وَعَجْزِى عَنِ الانْتِصارِ مِمَّنْ قَصَدَنِى بِمُحارَبَتِهِ ، وَوَحْدَتِى فِى كَثِيرٍ مِمَّنْ ناوانِى وَأَرْصَدَ لِى فِيما لَمْ أُعْمِلْ فِكْرِى فِى الْإِرْصادِ لَهُمْ بِمِثْلِهِ ، فَأَيَّدْتَنِى بِقُوَّتِكَ ، وَشَدَدْتَ أَزْرِى بِنُصْرَتِكَ ، وَفَلَلْتَ لِى حَدَّهُ ، وَخَذَلْتَهُ بَعْدَ جَمْعِ عَدِيدِهِ وَحَشَْدِهِ ، وَأَعْلَيْتَ كَعْبِى عَلَيْهِ؛

وَوَجَّهْتَ ما سَدَّدَ إِلَىَّ مِنْ مَكائِدِهِ إِلَيْهِ ، وَرَدَدْتَهُ عَلَيْهِ ، وَلَمْ يَشْفِ غَلِيلَهُ ، وَلَمْ تَبْرُدْ حَزازاتُ غَيْظِهِ ، وَقَدْ عَضَّ عَلَىَّ أَنامِلَهُ ، وَأَدْبَرَ مُوَلِّياً قَدْ أَخْفَقَتْ سَراياهُ ، فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَكَمْ مِنْ باغٍ بَغانِى بِمَكائِدِهِ ، وَنَصَبَ لِى أَشْراكَ مَصائِدِهِ ، وَوَكَّلَ بِى تَفَقُّدَ رِعايَتِهِ ، وَأَضْبَأَ إِلَىَّ إِضْباءَ السَّبُعِ لِطَرِيدَتِهِ ، انْتِظاراً لِانْتِهازِ فُرْصَتِهِ ، وَهُوَ يُظْهِرُ بَشاشَةَ الْمَلَقِ ، وَيَبْسُطُ  وَجْهاً غَيْرَ طَلِقٍ ،

فَلَمّا رَأَيْتَ دَغَلَ سَرِيرَتِهِ ، وَقُبْحَ مَا انْطَوىٰ عَلَيْهِ لِشَرِيكِهِ فِى مِلَّتِهِ ، وَأَصْبَحَ مُجْلِباً لِى فِى بَغْيِهِ أَرْكَسْتَهُ لِأُمِّ رَأْسِهِ ، وَأَتَيْتَ بُنْيانَهُ مِنْ أَساسِهِ ، فَصَرَعْتَهُ فِى زُبْيَتِهِ ، وَرَدَّيْتَهُ فِى مَهْوىٰ حُفْرَتِهِ ، وَجَعَلْتَ خَدَّهُ طَبَقاً لِتُرابِ رِجْلِهِ؛ وَشَغَلْتَهُ فِى بَدَنِهِ وَرِزْقِهِ ، وَرَمَيْتَهُ بِحَجَرِهِ ، وَخَنَقْتَهُ بِوَتَرِهِ، وَذَكَّيْتَهُ بِمَشاقِصِهِ، وَكَبَبْتَهُ لِمَنْخِرِهِ ، وَرَدَدْتَ كَيْدَهُ فِى نَحْرِهِ ، وَرَبَقْتَهُ بِنَدامَتِهِ ، وَفَسَأْتَهُ  بِحَسْرَتِهِ،

فَاسْتَخْذَأَ  وتَضاءَلَ  بَعْدَ نَخْوَتِهِ ، وَانْقَمَعَ بَعْدَ اسْتِطالَتِهِ ذَلِيلاً مَأْسُوراً فِى رِبْقِ حِبالَتِهِ  الَّتِى كانَ يُؤَمِّلُ أَنْ يَرانِى فِيها يَوْمَ سَطْوَتِهِ ، وَقَدْ كِدْتُ يَا رَبِّ لَوْلا رَحْمَتُكَ أَنْ يَحُلَّ بِى ما حَلَّ بِساحَتِهِ ، فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَا يُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَكَمْ مِنْ حاسِدٍ شَرِقَ بِحَسْرَتِهِ  ، وَعَدُوٍّ شَجِىَ بِغَيْظِهِ ، وَسَلَقَنِى بِحَدِّ لِسانِهِ ، وَوَخَزَنِى بِمُوقِ عَيْنِهِ ، وَجَعَلَنِى غَرَضاً  لِمَرامِيهِ ، وَقَلَّدَنِى خِلالاً لَمْ تَزَلْ فِيهِ ؟

نادَيْتُكَ  يَا رَبِّ مُسْتَجِيراً بِكَ ، واثِقاً بِسُرْعَةِ إِجابَتِكَ ، مُتَوَكِّلاً عَلىٰ ما لَمْ أَزَلْ أَتَعَرَّفُهُ مِنْ حُسْنِ دِفاعِكَ ، عالِماً أَنَّهُ لَايُضْطَهَدُ مَنْ أَوىٰ إِلىٰ ظِلِّ كَنَفِكَ؛ وَلَنْ تَقْرَعَ الْحَوادِثُ  مَنْ لَجَأَ إِلىٰ مَعْقِلِ الانْتِصارِ بِكَ ، فَحَصَّنْتَنِى مِنْ بَأْسِهِ بِقُدْرَتِكَ ، فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَكَمْ مِنْ سَحائِبِ مَكْرُوهٍ جَلَّيْتَها ، وَسَماءِ نِعْمَةٍ مَطَرْتَها  ، وَجَداوِلِ كَرامَةٍ أَجْرَيْتَها ، وَأَعْيُنِ أَحْداثٍ طَمَسْتَها ، وَناشِئَةِ رَحْمَةٍ نَشَرْتَها ، وَجُنَّةِ عافِيَةٍ أَلْبَسْتَها ، وَغَوامِرِ كُرُباتٍ كَشَفْتَها ، وَأُمُورٍ جارِيَةٍ قَدَّرْتَها ، لَمْ تُعْجِزْكَ إِذْ طَلَبْتَها ، وَلَمْ تَمْتَنِعْ مِنْكَ إِذْ أَرَدْتَها ، فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَكَمْ مِنْ ظَنٍّ حَسَنٍ حَقَّقْتَ ، وَمِنْ كَسْرِ إِمْلاقٍ جَبَرْتَ ، وَمِنْ مَسْكَنَةٍ فادِحَةٍ حَوَّلْتَ ، وَمِنْ صَرْعَةٍ مُهْلِكَةٍ نَعَشْتَ ، وَمِنْ مَشَقَّةٍ أَرَحْتَ ، لَاتُسْأَلُ  عَمَّا تَفْعَلُ وَهُمْ يُسْأَلُونَ ، وَلَا يَنْقُصُكَ ما أَنْفَقْتَ ،

وَلَقَدْ سُئِلْتَ فَأَعْطَيْتَ ، وَلَمْ تُسْأَلْ فَابْتَدَأْتَ ، وَاسْتُمِيحَ بابُ فَضْلِكَ فَما أَكْدَيْتَ ، أَبَيْتَ إِلّا إِنْعاماً وَامْتِناناً ، وَ إِلّا تَطَوُّلاً يَا رَبِّ وَ إِحْساناً ، وَأَبَيْتُ  إِلّا انْتِهاكاً لِحُرُماتِكَ ، وَاجْتِراءً عَلىٰ مَعاصِيكَ؛ وَتَعَدِيّاً لِحُدُودِكَ ، وَغَفْلَةً عَنْ وَعِيدِكَ ، وَطاعَةً لِعَدُوِّى وَعَدُوِّكَ ، لَمْ يَمْنَعْكَ يَا إِلٰهِى وَناصِرِى إِخْلالِى بِالشُّكْرِ عَنْ إِتْمامِ إِحْسانِكَ، وَلَا حَجَزَنِى ذٰلِكَ عَنِ ارْتِكابِ مَساخِطِكَ؛

اللّٰهُمَّ وَهٰذا  مَقَامُ عَبْدٍ ذَلِيلٍ اعْتَرَفَ لَكَ بِالتَّوْحِيدِ ، وَأَقَرَّ عَلىٰ نَفْسِهِ بِالتَّقْصِيرِ فِى أَداءِ حَقِّكَ ، وَشَهِدَ لَكَ بِسُبُوغِ نِعْمَتِكَ عَلَيْهِ وَجَمِيلِ عادَتِكَ عِنْدَهُ وَ إِحْسانِكَ إِلَيْهِ ، فَهَبْ لِى يَا إِلٰهِى وَسَيِّدِى مِنْ فَضْلِكَ ما أُرِيدُهُ إِلىٰ رَحْمَتِكَ  ، وَأَتَّخِذُهُ سُلَّماً أَعْرُجُ فِيهِ إِلىٰ مَرْضاتِكَ ، وَ آمَنُ بِهِ مِنْ سَخَطِكَ ، بِعِزَّتِكَ وَطَوْلِكَ؛ وَبِحَقِّ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَآلِهِ ،

فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ فِى كَرْبِ الْمَوْتِ ، وَحَشْرَجَةِ الصَّدْرِ ، وَالنَّظَرِ إِلىٰ ما تَقْشَعِرُّ مِنْهُ الْجُلُودُ ، وَتَفْزَعُ لَهُ الْقُلُوبُ ، وَأَنَا فِى عافِيَةٍ مِنْ ذٰلِكَ كُلِّهِ ، فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

اِلهى وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ سَقِيماً مُوجِعاً  فِى أَنَّةٍ وَعَوِيلٍ يَتَقَلَّبُ فِى غَمِّهِ لَا يَجِدُ مَحِيصاً ، وَلَا يُسِيغُ طَعاماً وَلَا شَراباً  ، وَأَنَا فِى صِحَّةٍ مِنَ الْبَدَنِ ، وَسَلامَةٍ مِنَ الْعَيْشِ ، كُلُّ ذٰلِكَ مِنْكَ ، فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ خائِفاً مَرْعُوباً  مُشْفِقاً وَجِلاً هارِباً طَرِيداً مُنْجَحِراً فِى مَضِيقٍ وَمَخْبَأَةٍ مِنَ الْمَخابِىَ قَدْ ضاقَتْ عَلَيْهِ الْأَرْضُ بِرُحْبِها ، لَايَجِدُ حِيلَةً وَلَا مَنْجىٰ وَلَا مَأْوىٰ ، وَأَنَا فِى أَمْنٍ وَطُمَأْنِينَةٍ وَعافِيَةٍ مِنْ ذٰلِكَ كُلِّهِ ، فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَا يُغْلَبُ وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَسَيِّدِى وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ مَغْلُولاً مُكَبَّلاً فِى الْحَدِيدِ بِأَيْدِى الْعُداةِ لَايَرْحَمُونَهُ ، فَقِيداً مِنْ أَهْلِهِ وَوَلَدِهِ ، مُنْقَطِعاً عَنْ إِخْوانِهِ وَبَلَدِهِ ، يَتَوَقَّعُ كُلَّ ساعَةٍ بِأَيِّ قِتْلَةٍ يُقْتَلُ ، وَبِأَيِّ مُثْلَةٍ يُمَثَّلُ بِهِ ، وَأَنَا فِى عافِيَةٍ مِنْ ذٰلِكَ كُلِّهِ ، فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ يُقاسِى الْحَرْبَ وَمُباشَرَةَ الْقِتالِ بِنَفْسِهِ قَدْ غَشِيَتْهُ الْأَعْداءُ مِنْ كُلِّ جانِبٍ بِالسُّيُوفِ وَالرِّماحِ وَآلَةِ الْحَرْبِ ، يَتَقَعْقَعُ فِى الْحَدِيدِ قَدْ بَلَغَ مَجْهُودَهُ لَايَعْرِفُ حِيلَةً ، وَلَا يَجِدُ مَهْرَباً ، قَدْ أُدْنِفَ بِالْجِراحَاتِ ، أَوْ مُتَشَحِّطاً بِدَمِهِ تَحْتَ السَّنابِكِ وَالْأَرْجُلِ ،يَتَمَنَّىٰ شَرْبَةً مِنْ ماءٍ أَوْ نَظْرَةً إِلىٰ أَهْلِهِ وَوَلَدِهِ لَا يَقْدِرُ عَلَيْها ، وَأَنَا فِى عافِيَةٍ مِنْ ذٰلِكَ كُلِّهِ ، فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ فِى ظُلُماتِ الْبِحارِ وَعَواصِفِ الرِّياحِ وَالْأَهْوالِ وَالْأَمْواجِ ، يَتَوَقَّعُ الْغَرَقَ وَالْهَلاكَ ، لَايَقْدِرُ عَلىٰ حِيلَةٍ ، أَوْ مُبْتَلىً بِصاعِقَةٍ أَوْ هَدْمٍ أَوْ حَرْقٍ أَوْشَرْقٍ أَوْ خَسْفٍ أَوْ مَسْخٍ أَوْ قَذْفٍ ، وَأَنَا فِى عافِيَةٍ مِنْ ذٰلِكَ كُلِّهِ ، فَلَكَ الْحَمْدُ يَا رَبِّ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَا يَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ مُسافِراً شاخِصاً عَنْ أَهْلِهِ وَوَلَدِهِ ، مُتَحَيِّراً فِى الْمَفاوِزِ ، تائِهاً مَعَ الْوُحُوشِ وَالْبَهائِمِ وَالْهَوامِّ، وَحِيداً فَرِيداً لَايَعْرِفُ حِيلَةً وَلَا يَهْتَدِى سَبِيلاً ، أَوْ  مُتَأَذِّياً بِبَرْدٍ أَوْ حَرٍّ أَوْ جُوعٍ أَوْ عُرْيٍ أَوْ غَيْرِهِ مِنَ الشَّدائِدِ مِمَّا أَنَا مِنْهُ خِلْوٌ فِى عافِيَةٍ مِنْ ذٰلِكَ كُلِّهِ ، فَلَكَ الْحَمْدُ يا رَبِّ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَسَيِّدِى وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ فَقِيراً عائِلاً عارِياً مُمْلِقاً مُخْفِقاً مَهْجُوراً جائِعاً ظَمْآناً ، يَنْتَظِرُ مَنْ يَعُودُ عَلَيْهِ بِفَضْلٍ ، أَوْ عَبْدٍ وَجِيهٍ عِنْدَكَ هُوَ أَوْجَهُ مِنِّى عِنْدَكَ وَأَشَدُّ عِبادَةً لَكَ ، مَغْلُولاً مَقْهُوراً قَدْ حُمِّلَ ثِقْلاً مِنْ تَعَبِ الْعَناءِ ، وَشِدَّةِ الْعُبُودِيَّةِ ، وَكُلْفَةِ الرِّقِّ ، وَثِقْلِ الضَّرِيبَةِ ، أَوْ مُبْتَلىً بِبَلاءٍ شَدِيدٍ لَاقِبَلَ لَهُ  إِلّا بِمَنِّكَ عَلَيْهِ ، وَأَنَا الْمَخْدُومُ الْمُنَعَّمُ الْمُعافَى الْمُكَرَّمُ فِى عافِيَةٍ مِمَّا هُوَ فِيهِ ، فَلَكَ الْحَمْدُ عَلىٰ ذٰلِكَ كُلِّهِ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ؛

إِلٰهِى وَ سَيِّدِى وَكَمْ مِنْ عَبْدٍ أَمْسَىٰ وَأَصْبَحَ عَلِيلاً مَرِيضاً سَقِيماً مُدْنِفاً عَلىٰ فُرُشِ الْعِلَّةِ وَفِى لِباسِها يَتَقَلَّبُ يَمِيناً وَشِمالاً ، لَايَعْرِفُ شَيْئاً مِنْ لَذَّةِ الطَّعامِ وَلَا مِنْ لَذَّةِ الشَّرابِ ، يَنْظُرُ إِلىٰ نَفْسِهِ حَسْرَةً لَايَسْتَطِيعُ لَها ضَرّاً وَلَا نَفْعاً ، وَأَنَا خِلْوٌ مِنْ ذٰلِكَ كُلِّهِ بِجُودِكَ وَكَرَمِكَ ، فَلا إِلٰهَ إِلّا أَنْتَ سُبْحانَكَ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لَكَ مِنَ الْعابِدِينَ ، وَ لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ ، وَارْحَمْنِى بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ؛

مَوْلاىَ وَسَيِّدِى وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ وَقَدْ دَنا يَوْمُهُ مِنْ حَتْفِهِ ، وَأَحْدَقَ بِهِ مَلَكُ الْمَوْتِ فِى أَعْوانِهِ يُعالِجُ سَكَراتِ الْمَوْتِ وَحِياضَهُ ، تَدُورُ عَيْناهُ يَمِيناً وَشِمالاً يَنْظُرُ إِلىٰ أَحِبَّائِهِ وَأَوِدَّائِهِ وَأَخِلَّائِهِ ، قَدْ مُنِعَ مِنَ الْكَلامِ ، وَحُجِبَ عَنِ الْخِطابِ ، يَنْظُرُ إِلىٰ نَفْسِهِ حَسْرَةً لَايَسْتَطِيعُ لَها ضَرّاً وَلَا نَفْعاً ، وَأَنَا خِلْوٌ مِنْ ذٰلِكَ كُلِّهِ بِجُودِكَ وَكَرَمِكَ ، فَلَاٰ إِلٰهَ إِلّا أَنْتَ سُبْحانَكَ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ ، وَارْحَمْنِى بِرَحْمَتِكَ يَا أَرْحَمَ الرّاحِمينَ؛

مَوْلاىَ وَسَيِّدِى وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ فِى مَضائِقِ الْحُبُوسِ وَالسُّجُونِ وَكُرَبِها وَذُلِّها وَحَدِيدِها تَتَداوَلُهُ أَعْوانُها وَزَبانِيَتُها فَلا يَدْرِى أَىُّ حالٍ يُفْعَلُ بِهِ ، وَأَىُّ مُثْلَةٍ يُمَثَّلُ بِهِ ، فَهُوَ فِى ضُرٍّ مِنَ الْعَيْشِ وَضَنْكٍ مِنَ الْحَياةِ يَنْظُرُ إِلىٰ نَفْسِهِ حَسْرَةً لَايَسْتَطِيعُ لَها ضَرّاً وَلَا نَفْعاً ، وَأَنَا خِلْوٌ مِنْ ذٰلِكَ كُلِّهِ بِجُودِكَ وَكَرمِكَ ، فَلَا إِلٰهَ إِلّا أَنْتَ سُبْحانَكَ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَا يَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لَكَ مِنَ الْعابِدِينَ ، وَ لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ ، وَارْحَمْنِى بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ؛

سَيِّدِى وَمَوْلاىَ وَكَمْ مِنْ عَبْدٍ أَمْسىٰ وَأَصْبَحَ قَدِ اسْتَمَرَّ عَلَيْهِ الْقَضاءُ ، وَأَحْدَقَ بِهِ الْبَلاءُ ، وَفارَقَ أَوِدَّاءَهُ وَأَحِبَّاءَهُ وَأَخِلَّاءَهُ ، وَأَمْسىٰ أَسِيراً حَقِيراً ذَلِيلاً فِى أَيْدِى الْكُفَّارِ وَالْأَعْداءِ يَتَداوَلُونَهُ يَمِيناً وَشِمالاً قَدْ حُصِرَ فِى الْمَطامِيرِ ، وَثُقِّلَ بِالْحَدِيدِ ، لَايَرىٰ شَيْئاً مِنْ ضِياءِ الدُّنْيا وَلَا مِنْ رَوْحِها ، يَنْظُرُ إِلىٰ نَفْسِهِ حَسْرَةً لَا يَسْتَطِيعُ لَها ضَرّاً وَلَا نَفْعاً ، وَأَنَا خِلْوٌ مِنْ ذٰلِكَ كُلِّهِ بِجُودِكَ وَكَرمِكَ ، فَلَا إِلٰهَ إِلّا أَنْتَ ، سُبْحانَكَ مِنْ مُقْتَدِرٍ لَايُغْلَبُ ، وَذِى أَناةٍ لَايَعْجَلُ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لَكَ مِنَ الْعابِدِينَ ، وَ لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ ، وَارْحَمْنِى بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ؛

وَعِزَّتِكَ يَا كَرِيمُ لَأَطْلُبَنَّ مِمَّا لَدَيْكَ ، وَلَأُلِحَّنَّ عَلَيْكَ ، وَلَأَمُدَّنَّ يَدِى نَحْوَكَ مَعَ جُرْمِها إِلَيْكَ يَا رَبِّ فَبِمَنْ أَعُوذُ ؟ وَبِمَنْ أَلُوذُ ؟ لَاأَحَدَ لِى إِلّا أَنْتَ ، أَفَتَرُدَّنِى وَأَنْتَ مُعَوَّلِى وَعَلَيْكَ مُتَّكَلِى ،

أَسْأَلُكَ بِاسْمِكَ الَّذى وَضَعْتَهُ عَلَى السَّماءِ فَاسْتَقَلَّتْ ، وَعَلَى الْأَرْضِ فَاسْتَقَرَّتْ ، وَعَلَى الْجِبالِ فَرَسَتْ ، وَعَلَى اللَّيْلِ فَأَظْلَمَ ، وَعَلَى النَّهارِ فَاسْتَنارَ ، أَنْ تُصَلِّىَ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَنْ تَقْضِىَ لِى حَوائِجِى كُلَّها ، وَتَغْفِرَ لِى ذُنُوبِى كُلَّها صَغِيرَها وَكَبِيرَها ، وَتُوَسِّعَ عَلَىَّ مِنَ الرِّزْقِ ما تُبَلِّغُنِى بِهِ شَرَفَ الدُّنْيا وَالْآخِرَةِ يَا أَرْحَمَ الرَّاحِمِينَ؛

مَوْلاىَ بِكَ اسْتَعَنْتُ فَصَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَعِنِّى ، وَبِكَ اسْتَجَرْتُ فَأَجِرْنِى ، وَأَغْنِنِى بِطاعَتِكَ عَنْ طاعَةِ عِبادِكَ ، وَبِمَسْأَلَتِكَ عَنْ مَسْأَلَةِ خَلْقِكَ ، وَانْقُلْنِى مِنْ ذُلِّ الْفَقْرِ إِلىٰ عِزِّ الْغِنىٰ ، وَمِنْ ذُلِّ الْمَعاصِى إِلىٰ عِزِّ الطَّاعَةِ ، فَقَدْ فَضَّلْتَنِى عَلىٰ كَثِيرٍ مِنْ خَلْقِكَ جُوداً مِنْكَ وَكَرَماً ، لَا بِاسْتِحْقاقٍ مِنِّى .

إِلٰهِى فَلَكَ الْحَمْدُ عَلىٰ ذٰلِكَ كُلِّهِ ، صَلِّ عَلىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِى لِنَعْمائِكَ مِنَ الشَّاكِرِينَ ، وَلِآلائِكَ مِنَ الذَّاكِرِينَ.

سَجَدَ وَجْهِىَ الذَّلِيلُ لِوَجْهِكَ الْعَزِيزِ الْجَلِيلِ ، سَجَدَ وَجْهِىَ الْبالِى الْفانِى لِوَجْهِكَ الدَّائِمِ الْباقِى ، سَجَدَ وَجْهِىَ الْفَقِيرُ لِوَجْهِكَ الْغَنِيِّ الْكَبِيرِ ، سَجَدَ وَجْهِى وَسَمْعِى وَبَصَرِى وَلَحْمِى وَدَمِى وَجِلْدِى وَعَظْمِى وَما أَقَلَّتِ الْأَرْضُ مِنِّى لِلّٰهِ رَبِّ الْعالَمِينَ .

اللّٰهُمَّ عُدْ عَلىٰ جَهْلِى بِحِلْمِكَ ، وَعَلىٰ فَقْرِى بِغِناكَ ، وَعَلىٰ ذُلِّى بِعِزِّكَ وَسُلْطانِكَ ، وَعَلىٰ ضَعْفِى بِقُوَّتِكَ ، وَعَلىٰ خَوْفِى بِأَمْنِكَ ، وَعَلىٰ ذُنُوبِى وَخَطاياىَ بِعَفْوِكَ وَرَحْمَتِكَ يَا رَحْمٰنُ يَا رَحِيمُ؛

اللّٰهُمَّ إِنِّى أَدْرَأُ بِكَ فِى نَحْرِ فُلانِ بْنِ فُلان ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ فَاكْفِنِيهِ بِما كَفَيْتَ بِهِ أَنْبِياءَكَ وَأَوْلِياءَكَ مِنْ خَلْقِكَ وَصالِحِى عِبادِكَ مِنْ فَراعِنَةِ خَلْقِكَ ، وَطُغاةِ عُداتِكَ ، وَشَرِّ جَمِيعِ خَلْقِكَ ، بِرَحْمَتِكَ يَا أَرْحَمَ الرّاحِمِينَ ، إِنَّكَ عَلىٰ كُلِّ شَىْءٍ قَدِيرٌ ، وَحَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيلُ.''',
    benefits: "دعاء عظيم جليل القدر ذكره الكفعمي في (البلد الأمين)، حث على قراءته الإمام الكاظم (عليه السلام) للنجاة من كيد الأعداء ودفع شرهم وبأسهم.",
  ),
  Dua(
    title: "دعاء مكارم الأخلاق",
    text: r'''﴿1﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ بَلِّغْ بِإِيمَانِي أَكْمَلَ الْإِيمَانِ ، وَ اجْعَلْ يَقِينِي أَفْضَلَ الْيَقِينِ ، وَ انْتَهِ بِنِيَّتِي إِلَى أَحْسَنِ النِّيَّاتِ ، وَ بِعَمَلِي إِلَى أَحْسَنِ الْاَعْمَالِ .

﴿2﴾ اللَّهُمَّ وَفِّرْ بِلُطْفِكَ نِيَّتِي ، وَ صَحِّحْ بِمَا عِنْدَكَ يَقِينِي ، وَ اسْتَصْلِحْ بِقُدْرَتِكَ مَا فَسَدَ مِنِّي.

﴿3﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ اكْفِنِي مَا يَشْغَلُنِي الاِهْتَِمامُ بِهِ ، وَ اسْتَعْمِلْنِي بِمَا تَسْأَلُنِي غَداً عَنْهُ ، وَ اسْتَفْرِغْ أَيَّامِي فِيما خَلَقْتَنِي لَهُ ، وَ أَغْنِنِي وَ أَوْسِعْ عَلَيَّ فِي رِزْقِكَ ، وَ لَا تَفْتِنِّي بِالنَّظَرِ ، وَ أَعِزَّنِي وَ لَا تَبْتَلِيَنِّي بِالْكِبْرِ ، وَ عَبِّدْنِي لَكَ وَ لَا تُفْسِدْ عِبَادَتِي بِالْعُجْبِ ، وَ أَجْرِ لِلنَّاسِ عَلَى يَدِيَ الْخَيْرَ وَ لَا تَمْحَقْهُ بِالْمَنِّ ، وَ هَبْ لِي مَعَالِيَ الْأَخْلَاقِ ، وَ اعْصِمْنِي مِنَ الْفَخْرِ .

﴿4﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ لَا تَرْفَعْنِي فِي النَّاسِ دَرَجَةً إِلَّا حَطَطْتَنِي عِنْدَ نَفْسِي مِثْلَهَا ، وَ لَا تُحْدِثْ لِي عِزّاً ظَاهِراً إِلَّا أَحْدَثْتَ لِي ذِلَّةً بَاطِنَةً عِنْدَ نَفْسِي بِقَدَرِهَا .

﴿5﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ ، وَ مَتِّعْنِي بِهُدًى صَالِحٍ لَا أَسْتَبْدِلُ بِهِ ، وَ طَرِيقَةِ حَقٍّ لَا أَزِيغُ عَنْهَا ، وَ نِيَّةِ رُشْدٍ لَا أَشُكُّ فِيهَا ، وَ عَمِّرْنِي مَا كَانَ عُمْرِي بِذْلَةً فِي طَاعَتِكَ ، فَإِذَا كَانَ عُمْرِي مَرْتَعاً لِلشَّيْطَانِ فَاقْبِضْنِي إِلَيْكَ قَبْلَ أَنْ يَسْبِقَ مَقْتُكَ إِلَيَّ ، أَوْ يَسْتَحْكِمَ غَضَبُكَ عَلَيَّ .

﴿6﴾ اللَّهُمَّ لَا تَدَعْ خَصْلَةً تُعَابُ مِنِّي إِلَّا أَصْلَحْتَهَا ، وَ لَا عَائِبَةً أُوَنَّبُ بِهَا إِلَّا حَسَّنْتَهَا ، وَ لَا أُكْرُومَةً فِيَّ نَاقِصَةً إِلَّا أَتْمَمْتَهَا .

﴿7﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ ، وَ أَبْدِلْنِي مِنْ بِغْضَةِ أَهْلِ الشَّنَآنِ الْمحَبَّةَ ، وَ مِنْ حَسَدِ أَهْلِ الْبَغْيِ الْمَوَدَّةَ ، وَ مِنْ ظِنَّةِ أَهْلِ الصَّلَاحِ الثِّقَةَ ، وَ مِنْ عَدَاوَةِ الْأَدْنَيْنَ الْوَلَايَةَ ، وَ مِنْ عُقُوقِ ذَوِي الْأَرْحَامِ الْمَبَرَّةَ ، وَ مِنْ خِذْلَانِ الْأَقْرَبِينَ النُّصْرَةَ، ، وَ مِنْ حُبِّ الْمُدَارِينَ تَصْحِيحَ الْمِقَةِ ، وَ مِنْ رَدِّ الْمُلَابِسِينَ كَرَمَ الْعِشْرَةِ ، وَ مِنْ مَرَارَةِ خَوْفِ الظَّالِمِينَ حَلَاوَةَ الْاَمَنَةِ الْاَمَنَةِ

﴿8﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ اجْعَلْ لِي يَداً عَلَى مَنْ ظَلَمَنِي ، وَ لِسَاناً عَلَى مَنْ خَاصَمَنِي ، وَ ظَفَراً بِمَنْ عَانَدَنِي ، وَ هَبْ لِي مَكْراً عَلَى مَنْ كَايَدَنِي ، وَ قُدْرَةً عَلَى مَنِ اضْطَهَدَنِي ، وَ تَكْذِيباً لِمَنْ قَصَبَنِي ، وَ سَلَامَةً مِمَّنْ تَوَعَّدَنِي ، وَ وَفِّقْنِي لِطَاعَةِ مَنْ سَدَّدَنِي ، وَ مُتَابَعَةِ مَنْ أَرْشَدَنِي .

﴿9﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ سَدِّدْنِي لِأَنْ أُعَارِضَ مَنْ غَشَّنِي بِالنُّصْحِ ، وَ أَجْزِيَ مَنْ هَجَرَنِي بِالْبِرِّ ، وَ أُثِيبَ مَنْ حَرَمَنِي بِالْبَذْلِ ، وَ أُكَافِيَ مَنْ قَطَعَنِي بِالصِّلَةِ ، وَ أُخَالِفَ مَنِ اغْتَابَنِي إِلَى حُسْنِ الذِّكْرِ ، وَ أَنْ أَشْكُرَ الْحَسَنَةَ ، وَ أُغْضِيَ عَنِ السَّيِّئَةِ .

﴿10﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ حَلِّنِي، بِحِلْيَةِ الصَّالِحِينَ ، وَ أَلْبِسْنِي زِينَةَ الْمُتَّقِينَ ، فِي بَسْطِ الْعَدْلِ ، وَ كَظْمِ الغَيْظِ ، وَ إِطْفَاءِ النَّائِرَةِ ، وَ ضَمِّ أَهْلِ الْفُرْقَةِ ، و إِصْلَاحِ ذَاتِ الْبَيْنِ ، وَ إِفْشَاءِ الْعَارِفَةِ ، وَ سَتْرِ الْعَائِبَةِ ، وَ لِينِ الْعَرِيكَةِ ، وَ خَفْضِ الْجَنَاحِ ، وَ حُسْنِ السِّيرَةِ ، وَ سُكُونِ الرِّيحِ ، وَ طِيبِ الْمخَالَقَةِ ، وَ السَّبْقِ إِلَى الْفَضِيلَةِ ، وَ إِيثَارِ التَّفَضُّلِ ، وَ تَرْكِ التَّعْيِيرِ ، وَ الْإِفْضَالِ عَلَى غَيْرِ الْمُسْتَحِقِّ ، وَ الْقَوْلِ بِالْحَقِّ وَ إِنْ عَزَّ ، وَ اسْتِقْلَالِ الْخَيْرِ وَ إِنْ كَثُرَ مِنْ قَوْلِي وَ فِعْلِي ، وَ اسْتِكْثَارِ الشَّرِّ وَ إِنْ قَلَّ مِنْ قَوْلِي وَ فِعْلِي ، وَ أَكْمِلْ ذلك لِي بِدَوَامِ الطَّاعَةِ ، وَ لُزُومِ الْجَمَاعَةِ ، وَ رَفْضِ أَهْلِ الْبِدَعِ ، وَ مُسْتَعْمِلِ الرَّاْيِ الْمُخْتَرَعِ .

﴿11﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ اجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ إِذَا كَبِرْتُ ، وَ أَقْوَى قُوَّتِكَ فِيَّ إِذَا نَصِبْتُ ، وَ لَا تَبْتَلِيَنِّي بِالْكَسَلِ عَنْ عِبَادَتِكَ ، وَ لَا الْعَمَى عَنْ سَبِيلِكَ ، وَ لَا بِالتَّعَرُّضِ لِخِلَافِ مَحَبَّتِكَ ، وَ لَا مُجَامَعَةِ مَنْ تَفَرَّقَ عَنْكَ ، وَ لَا مُفَارَقَةِ مَنِ اجْتَمَعَ إِلَيْكَ .

﴿12﴾ اللَّهُمَّ اجْعَلْنِي أَصُولُ بِكَ عِنْدَ الضَّرُورَةِ ، وَ أَسْأَلُكَ عِنْدَ الْحَاجَةِ ، وَ أَتَضَرَّعُ إِلَيْكَ عِنْدَ الْمَسْكَنَةِ ، وَ لَا تَفْتِنِّي بِالِاسْتِعَانَةِ بِغَيْرِكَ إِذَا اضْطُرِرْتُ ، وَ لَا بِالْخُضُوعِ لِسُؤَالِ غَيْرِكَ إِذَا افْتَقَرْتُ ، وَ لَا بِالتَّضَرُّعِ إِلَى مَنْ دُونَكَ إِذَا رَهِبْتُ ، فَأَسْتَحِقَّ بِذَلِكَ خِذْلَانَكَ وَ مَنْعَكَ وَ إِعْرَاضَكَ ، يَا أَرْحَمَ الرَّاحِمِينَ .

﴿13﴾ اللَّهُمَّ اجْعَلْ مَا يُلْقِي الشَّيْطَانُ فِي رُوعِي مِنَ الَّتمَنِّي وَ التَّظَنِّي وَ الْحَسَدِ ذِكْراً لِعَظَمَتِكَ ، وَ تَفَكُّراً فِي قُدْرَتِكَ ، وَ تَدْبِيراً عَلَى عَدُوِّكَ ، وَ مَا أَجْرَى عَلَى لِسَانِي مِنْ لَفْظَةِ فُحْشٍ أَوْ هُجْرٍ أَوْ شَتْمِ عِرْضٍ أَوْ شَهَادَةِ بَاطِلٍ أَوِ اغْتِيَابِ مُؤْمِنٍ غَائِبٍ أَوْ سَبِّ حَاضِرٍ وَ مَا أَشْبَهَ ذَلِكَ نُطْقاً بِالْحَمْدِ لَكَ ، وَ إِغْرَاقاً فِي الثَّنَاءِ عَلَيْكَ ، وَ ذَهَاباً فِي تَمْجِيدِكَ ، وَ شُكْراً لِنِعْمَتِكَ ، وَ اعْتِرَافاً بِاِحْسَانِكَ ، و اِحْصَاءً لِمِنَنِكَ .

﴿14﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ لَا أُظْلَمَنَّ وَ أَنْتَ مُطِيقٌ لِلدَّفْعِ عَنِّي ، وَ لَا أَظْلِمَنَّ وَ أَنْتَ الْقَادِرُ عَلَى الْقَبْضِ مِنِّي ، وَ لَا أَضِلَّنَّ وَ قَدْ أَمْكَنَتْكَ هِدَايَتِي ، وَ لَا أَفْتَقِرَنَّ وَ مِنْ عِنْدِكَ وُسْعِي ، وَ لَا أَطْغَيَنَّ وَ مِنْ عِنْدِكَ وُجْدِي .

﴿15﴾ اللَّهُمَّ إِلَى مَغْفِرَتِكَ وَفَدْتُ ، وَ إِلَى عَفْوِكَ قَصَدْتُ ، وَ إِلَى تَجَاوُزِكَ اشْتَقْتُ ، وَ بِفَضْلِكَ وَثِقْتُ ، وَ لَيْسَ عِنْدِي مَا يُوجِبُ لِي مَغْفِرَتَكَ ، وَ لَا فِي عَمَلِي مَا أَسْتَحِقُّ بِهِ عَفْوَكَ ، وَ مَا لِي بَعْدَ أَنْ حَكَمْتُ عَلَى نَفْسِي إِلَّا فَضْلُكَ ، فَصَلِّ عَلَي مُحَمَّدٍ وَ آلِهِ ، وَ تَفَضَّلْ عَلَيَّ .

﴿16﴾ اللَّهُمَّ وَ أَنْطِقْنِي بِالْهُدَى ، وَ أَلْهِمْنِي التَّقْوَى ، وَ وَفِّقْنِي لِلَّتِي هِيَ أَزْكَى ، وَ اسْتَعْمِلْنِي بِمَا هُوَ أَرْضَى .

﴿17﴾ اللَّهُمَّ اسْلُكْ بِيَ الطَّرِيقَةَ الْمُثْلَى ، وَ اجْعَلْنِي عَلَى مِلَّتِكَ أَمُوتُ وَ أَحْيَا .

﴿18﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ مَتِّعْنِي بِالِاقْتِصَادِ ، وَ اجْعَلْنِي مِنْ أَهْلِ السَّدَادِ ، وَ مِنْ أَدِلَّةِ الرَّشَادِ ، وَ مِنْ صَالِحِ الْعِبَادِ ، وَ ارْزُقْنِي فَوْزَ الْمَعَادِ ، وَ سلَامَةَ الْمِرْصَادِ .

﴿19﴾ اللَّهُمَّ خُذْ لِنَفْسِكَ مِنْ نَفْسِي مَا يُخَلِّصُهَا ، وَ أَبْقِ لِنَفْسِي مِنْ نَفْسِي مَا يُصْلِحُهَا ، فَإِنَّ نَفْسِي هَالِكَةٌ أَوْ تَعْصِمَهَا .

﴿20﴾ اللَّهُمَّ أَنْتَ عُدَّتِي إِنْ حَزِنْتُ ، وَ أَنْتَ مُنْتَجَعِي إِنْ حُرِمْتُ ، وَ بِكَ اسْتِغَاثَتِي إِنْ كَرِثْتُ ، وَ عِنْدَكَ مِمَّا فَاتَ خَلَفٌ ، وَ لِمَا فَسَدَ صَلَاحٌ ، وَ فِيما أَنْكَرْتَ تَغْيِيرٌ ، فَامْنُنْ عَلَيَّ قَبْلَ الْبَلَاءِ بِالْعَافِيَةِ ، وَ قَبْلَ الطَّلَبِ بِالْجِدَةِ ، وَ قَبْلَ الضَّلَالِ بِالرَّشَادِ ، وَ اكْفِنِي مَؤُونَةَ مَعَرَّةِ الْعِبَادِ ، وَ هَبْ لِي أَمْنَ يَوْمِ الْمَعَادِ ، وَ امْنِحْنِي حُسْنَ الْاِرْشَادِ .

﴿21﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ ادْرَأْ عَنِّي بِلُطْفِكَ ، وَ اغْذُنِي بِنِعْمَتِكَ ، وَ أَصْلِحْنِي بِكَرَمِكَ ، وَ دَاوِنِي بِصُنْعِكَ ، وَ أَظِلَّنِي فِي ذَرَاكَ ، وَ جَلِّلْنِي رِضَاكَ ، وَ وَفِّقْنِي إِذَا اشْتَكَلَتْ عَلَيَّ الْأُمُورُ لِأَهْدَاهَا ، وَ إِذَا تَشَابَهَتِ الْأَعْمَالُ لِأَزْكَاهَا ، وَ إِذَا تَنَاقَضَتِ الْمِلَلُ لِأَرْضَاهَا .

﴿22﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ تَوِّجْنِي بِالْكِفَايَةِ ، وَ سُمْنِي حُسْنَ الْوِلَايَةِ ، وَ هَبْ لِي صِدْقَ الْهِدَايَةِ ، وَ لَا تَفْتِنِّي بِالسَّعَةِ ، وَ امْنِحْنِي حُسْنَ الدَّعَةِ ، وَ لَا تَجْعَلْ عَيْشِي كَدّاً كَدّاً ، وَ لَا تَرُدَّ دُعَائِي عَلَيَّ رَدّاً ، فَإِنِّي لَا أَجْعَلُ لَكَ ضِدّاً ، وَ لَا أَدْعُو مَعَكَ نِدّاً .

﴿23﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ امْنَعْنِي مِنَ السَّرَفِ ، وَ حَصِّنْ رِزْقِي مِنَ التَّلَفِ ، وَ وَفِّرْ مَلَكَتِي بِالْبَرَكَةِ فِيهِ ، وَ أَصِبْ بِي سَبِيلَ الْهِدَايَةِ لِلْبِرِّ فِيما أُنْفِقُ مِنْهُ.

﴿24﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ اكْفِنِي مَؤُونَةَ الِاكْتِسَابِ ، وَ ارْزُقْنِي مِنْ غَيْرِ احْتِسَابٍ ، فَلَا أَشْتَغِلَ عَنْ عِبَادَتِكَ بِالطَّلَبِ ، وَ لَا أَحْتَمِلَ إِصْرَ تَبِعَاتِ الْمَكْسَبِ.

﴿25﴾ اللَّهُمَّ فَأَطْلِبْنِي بِقُدْرَتِكَ مَا أَطْلُبُ ، وَ أَجِرْنِي بِعِزَّتِكَ مِمَّا أَرْهَبُ .

﴿26﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ صُنْ وَجْهِي بِالْيَسَارِ ، وَ لَا تَبْتَذِلْ جَاهِي بِالْإِقْتَارِ فَأَسْتَرْزِقَ أَهْلَ رِزْقِكَ ، وَ أَسْتَعْطِيَ شِرَارَ خَلْقِكَ ، فَأَفْتَتِنَ بِحَمْدِ مَنْ أَعْطَانِي ، وَ اُبْتَلَي بِذَمِّ مَنْ مَنَعَنِي ، وَ أَنْتَ مِنْ دُونِهِمْ وَلِيُّ الْاَعْطَاءِ وَ الْمَنْعِ .

﴿27﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ ارْزُقْنِي صِحَّةً فِي عِبَادَةٍ ، وَ فَرَاغاً فِي زَهَادَةٍ ، وَ عِلْماً فِي اسْتِعْمَالٍ ، وَ وَرَعاً فِي اِجْمَالٍ .

﴿28﴾ اللَّهُمَّ اخْتِمْ بِعَفْوِكَ أَجَلِي ، وَ حَقِّقْ فِي رَجَاءِ رَحْمَتِكَ أَمَلِي ، وَ سَهِّلْ إِلَى بُلُوغِ رِضَاكَ سُبُلِي ، وَ حَسِّنْ فِي جَمِيعِ أَحْوَالِي عَمَلِي .

﴿29﴾ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، وَ نَبِّهْنِي لِذِكْرِكَ فِي أَوْقَاتِ الْغَفْلَةِ ، وَ اسْتَعْمِلْنِي بِطَاعَتِكَ فِي أَيَّامِ الْمُهْلَةِ ، وَ انْهَجْ لِي إِلَى مَحَبَّتِكَ سَبِيلًا سَهْلَةً ، أَكْمِلْ لِي بِهَا خَيْرَ الدُّنْيَا وَ الآْخِرَةِ .

﴿30﴾ اللَّهُمَّ وَ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ ، كَأَفْضَلِ مَا صَلَّيْتَ عَلَى أَحَدٍ مِنْ خَلْقِكَ قَبْلَهُ ، وَ أَنْتَ مُصَلٍّ عَلَى أَحَدٍ بَعْدَهُ ، وَ آتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الآْخِرَةِ حَسَنَةً ، وَ قِنِي بِرَحْمَتِكَ عَذَابَ النَّارِ .''',
    benefits: "من الأدعية الجليلة المروية عن الإمام زين العابدين (عليه السلام) في الصحيفة السجادية لطلب معالي الأخلاق ومكارمها.",
  ),
  Dua(
    title: "دعاء أبي حمزة الثمالي",
    text: r'''إِلٰهِى لَاتُؤَدِّبْنِى بِعُقُوبَتِكَ، وَلَا تَمْكُرْ بِى فِى حِيلَتِكَ، مِنْ أَيْنَ لِىَ الْخَيْرُ يَا رَبِّ وَلَا يُوجَدُ إِلّا مِنْ عِنْدِكَ ؟ وَمِنْ أَيْنَ لِىَ النَّجاةُ وَلا تُسْتَطاعُ إِلّا بِكَ ؟ لَا الَّذِى أَحْسَنَ اسْتَغْنىٰ عَنْ عَوْنِكَ وَرَحْمَتِكَ، وَلَا الَّذِى أَساءَ وَاجْتَرَأَ عَلَيْكَ وَلَمْ يُرْضِكَ خَرَجَ عَنْ قُدْرَتِكَ، يَا رَبِّ يَا رَبِّ يَا رَبِّ [يكررها حتى ينقطع النَّفَس]

بِكَ عَرَفْتُكَ وَأَنْتَ دَلَلْتَنِى عَلَيْكَ وَدَعَوْتَنِى إِلَيْكَ ، وَلَوْلا أَنْتَ لَمْ أَدْرِ مَا أَنْتَ . الْحَمْدُ لِلّٰهِ الَّذِى أَدْعُوهُ فَيُجِيبُنِى وَ إِنْ كُنْتُ بَطِيئاً حِينَ يَدْعُونِى ، وَالْحَمْدُ لِلّٰهِ الَّذِى أَسْأَلُهُ فَيُعْطِينِى وَ إِنْ كُنْتُ بَخِيلاً حِينَ يَسْتَقْرِضُنِى ، وَالْحَمْدُ لِلّٰهِ الَّذِى أُنادِيهِ كُلَّما شِئْتُ لِحاجَتِى وَأَخْلُو بِهِ حَيْثُ شِئْتُ لِسِرِّى بِغَيْرِ شَفِيعٍ فَيَقْضِى لِى حاجَتِى؛

الْحَمْدُ لِلّٰهِ الَّذِى لَاأَدْعُو غَيْرَهُ وَلَوْ دَعَوْتُ غَيْرَهُ لَمْ يَسْتَجِبْ لِى دُعائِى ، وَالْحَمْدُ لِلّٰهِ الَّذِى لَاأَرْجُو غَيْرَهُ وَلَوْ رَجَوْتُ غَيْرَهُ لَأَخْلَفَ رَجائِى ، وَالْحَمْدُ لِلّٰهِ الَّذِى وَكَلَنِى إِلَيْهِ فَأَكْرَمَنِى وَلَمْ يَكِلْنِى إِلَى النَّاسِ فَيُهِينُونِى ، وَالْحَمْدُ لِلّٰهِ الَّذِى تَحَبَّبَ إِلَىَّ وَهُوَ غَنِيٌّ عَنِّي ، وَالْحَمْدُ لِلّٰهِ الَّذِى يَحْلُمُ عَنِّى حَتَّىٰ كَأَ نِّى لَاذَنْبَ لِى ، فَرَبِّى أَحْمَدُ شَىْءٍ عِنْدِى وَأَحَقُّ بِحَمْدِى؛

اللّٰهُمَّ إِنِّى أَجِدُ سُبُلَ الْمَطالِبِ إِلَيْكَ مُشْرَعَةً ، وَمَناهِلَ الرَّجاءِ إِلَيْكَ  مُتْرَعَةً ، وَالاسْتِعانَةَ بِفَضْلِكَ لِمَنْ أَمَّلَكَ مُباحَةً ، وَأَبْوابَ الدُّعاءِ إِلَيْكَ لِلصَّارِخِينَ مَفْتُوحَةً، وَأَعْلَمُ أَنَّكَ لِلرَّاجِى بِمَوْضِعِ إِجابَةٍ ، وَ لِلْمَلْهُوفِينَ  بِمَرْصَدِ إِغاثَةٍ ، وَأَنَّ فِى اللَّهْفِ إِلىٰ جُودِكَ وَالرِّضا بِقَضائِكَ عِوَضاً مِنْ مَنْعِ الْباخِلِينَ ، وَمَنْدُوحَةً عَمَّا فِى أَيْدِى الْمُسْتَأْثِرِينَ ، وَأَنَّ الرَّاحِلَ إِلَيْكَ قَرِيبُ الْمَسافَةِ ، وَأَنَّكَ لَاتَحْتَجِبُ عَنْ خَلْقِكَ إِلّا أَنْ تَحْجُبَهُمُ الْأَعْمالُ  دُونَكَ؛

وَقَدْ قَصَدْتُ إِلَيْكَ بِطَلِبَتِى ، وَتَوَجَّهْتُ إِلَيْكَ بِحاجَتِى ، وَجَعَلْتُ بِكَ اسْتِغاثَتِى ، وَبِدُعائِكَ تَوَسُّلِى مِنْ غَيْرِ اسْتِحْقاقٍ لِاسْتِماعِكَ مِنِّى ، وَلَا اسْتِيجابٍ لِعَفْوِكَ عَنِّى ، بَلْ لِثِقَتِى بِكَرَمِكَ ، وَسُكُونِى إِلىٰ صِدْقِ وَعْدِكَ ، وَلَجَإِى إِلَى الْإِيمانِ بِتَوْحِيدِكَ وَيَقِينِى بِمَعْرِفَتِكَ مِنِّى أَنْ لا رَبَّ لِى غَيْرُكَ ، وَلَا إِلٰهَ  إِلّا أَنْتَ وَحْدَكَ لَاشَرِيكَ لَكَ؛

اللّٰهُمَّ أَنْتَ الْقائِلُ وَقَوْلُكَ حَقٌّ وَوَعْدُكَ صِدْقٌ: ﴿وَ سْئَلُوا اللّٰهَ مِنْ فَضْلِهِ إِنَّ اللّٰهَ كٰانَ بِكُمْ﴾ رَحِيماً وَلَيْسَ مِنْ صِفاتِكَ يَا سَيِّدِى أَنْ تَأْمُرَ بِالسُّؤالِ وَتَمْنَعَ الْعَطِيَّةَ وَأَنْتَ الْمَنَّانُ بِالْعَطِيَّاتِ عَلَىٰ أَهْلِ مَمْلَكَتِكَ، وَالْعائِدُ عَلَيْهِمْ بِتَحَنُّنِ رَأْفَتِكَ؛

إِلٰهِى رَبَّيْتَنِى فِى نِعَمِكَ وَ إِحْسانِكَ صَغِيراً ، وَنَوَّهْتَ بِاسْمِى كَبِيراً ، فَيا مَنْ رَبَّانِى فِى الدُّنْيا بِإِحْسانِهِ وَتَفَضُّلِهِ  وَنِعَمِهِ ، وَأَشارَ لِى فِى الْآخِرَةِ إِلىٰ عَفْوِهِ وَكَرَمِهِ ، مَعْرِفَتِى يَا مَوْلاىَ دَلِيلِى  عَلَيْكَ ، وَحُبِّى لَكَ شَفِيعِى إِلَيْكَ ، وَأَنَا واثِقٌ مِنْ دَلِيلِى بِدَلالَتِكَ ، وَساكِنٌ مِنْ شَفِيعِى إِلىٰ شَفاعَتِكَ؛

أَدْعُوكَ يَا سَيِّدِى بِلِسانٍ قَدْ أَخْرَسَهُ ذَنْبُهُ ، رَبِّ أُناجِيكَ بِقَلْبٍ قَدْ أَوْبَقَهُ جُرْمُهُ ، أَدْعُوكَ يَا رَبِّ راهِباً راغِباً راجِياً خائِفاً ، إِذا رَأَيْتُ مَوْلاىَ ذُنُوبِى فَزِعْتُ ، وَ إِذا رَأَيْتُ كَرَمَكَ طَمِعْتُ فَإِنْ عَفَوْتَ  فَخَيْرُ راحِمٍ ، وَ إِنْ عَذَّبْتَ فَغَيْرُ ظالِمٍ ، حُجَّتِى يَا اللّٰهُ فِى جُرْأَتِى عَلَىٰ مَسْأَلَتِكَ مَعَ إِتْيانِى مَا تَكْرَهُ جُودُكَ وَكَرَمُكَ ، وَعُدَّتِى فِى شِدَّتِى مَعَ قِلَّةِ حَيائِى رَأْفَتُكَ وَرَحْمَتُكَ ، وَقَدْ رَجَوْتُ أَنْ لَاتَخِيبَ بَيْنَ ذَيْنِ وَذَيْنِ مُنْيَتِى فَحَقِّقْ رَجائِى ، وَاسْمَعْ دُعائِى ، يَا خَيْرَ مَنْ دَعاهُ داعٍ ، وَأَفْضَلَ مَنْ رَجاهُ راجٍ ، عَظُمَ يَا سَيِّدِى أَمَلِى وَساءَ عَمَلِى فَأَعْطِنِى مِنْ عَفْوِكَ بِمِقْدارِ أَمَلِى ، وَلَا تُؤاخِذْنِى بِأَسْوَءِ عَمَلِى فَإِنَّ كَرَمَكَ يَجِلُّ عَنْ مُجازاةِ الْمُذْنِبِينَ ، وَحِلْمَكَ يَكْبُرُ عَنْ مُكافٰاةِ الْمُقَصِّرِينَ؛

وَأَنَا يَا سَيِّدِى عائِذٌ بِفَضْلِكَ ، هارِبٌ مِنْكَ إِلَيْكَ ، مُتَنَجِّزٌ مَا وَعَدْتَ مِنَ الصَّفْحِ عَمَّنْ أَحْسَنَ بِكَ ظَنّاً ، وَمَا أَنَا يَا رَبِّ  وَمَا خَطَرِى ؟ هَبْنِى بِفَضْلِكَ ، وَتَصَدَّقْ عَلَىَّ بِعَفْوِكَ ، أَيْ رَبِّ جَلِّلْنِي بِسِتْرِكَ ، وَاعْفُ عَنْ تَوْبِيخِى بِكَرَمِ وَجْهِكَ ، فَلَوِ اطَّلَعَ الْيَوْمَ عَلَىٰ ذَنْبِى غَيْرُكَ مَا فَعَلْتُهُ ، وَلَوْ خِفْتُ تَعْجِيلَ الْعُقُوبَةِ لَاجْتَنَبْتُهُ ، لَالِأَ نَّكَ أَهْوَنُ النَّاظِرِينَ إِلَىَّ وَأَخَفُّ الْمُطَّلِعِينَ عَلَىَّ ، بَلْ  لِأَنَّكَ يَا رَبِّ خَيْرُ السَّاتِرِينَ ، وَأَحْكَمُ الْحاكِمِينَ  ، وَأَكْرَمُ الْأَكْرَمِينَ؛

سَتَّارُ الْعُيُوبِ ، غَفَّارُ الذُّنُوبِ ، عَلَّامُ الْغُيُوبِ ، تَسْتُرُ الذَّنْبَ بِكَرَمِكَ ، وَتُؤَخِّرُ الْعُقُوبَةَ بِحِلْمِكَ ، فَلَكَ الْحَمْدُ عَلَىٰ حِلْمِكَ بَعْدَ عِلْمِكَ ، وَعَلَىٰ عَفْوِكَ بَعْدَ قُدْرَتِكَ ، وَيَحْمِلُنِى وَيُجَرِّئُنِى عَلَىٰ مَعْصِيَتِكَ حِلْمُكَ عَنِّى ، وَيَدْعُونِى إِلىٰ قِلَّةِ الْحَياءِ سَِتْرُكَ عَلَىَّ ، وَيُسْرِعُنِى إِلَى التَّوَثُّبِ  عَلَىٰ مَحارِمِكَ مَعْرِفَتِى بِسَعَةِ رَحْمَتِكَ وَعَظِيمِ عَفْوِكَ ، يَا حَلِيمُ يَا كَرِيمُ ، يَا حَىُّ يَا قَيُّومُ ، يَا غافِرَ الذَّنْبِ ، يَا قابِلَ التَّوْبِ؛

يَا عَظِيمَ الْمَنِّ ، يَا قَدِيمَ الْإِحْسانِ ، أَيْنَ سَِتْرُكَ الْجَمِيلُ ؟ أَيْنَ عَفْوُكَ الْجَلِيلُ ؟ أَيْنَ فَرَجُكَ الْقَرِيبُ ؟ أَيْنَ غِياثُكَ السَّرِيعُ ؟ أَيْنَ رَحْمَتُكَ الْواسِعَةُ ؟ أَيْنَ عَطاياكَ الْفاضِلَةُ؟ أَيْنَ مَواهِبُكَ الْهَنِيئَةُ ؟ أَيْنَ صَنائِعُكَ السَّنِيَّةُ ؟ أَيْنَ فَضْلُكَ الْعَظِيمُ ؟ أَيْنَ مَنُّكَ الْجَسِيمُ؟ أَيْنَ إِحْسانُكَ الْقَدِيمُ ؟ أَيْنَ كَرَمُكَ يَا كَرِيمُ ؟ بِهِ وَبِمُحَمَّدٍ وَآلِ مُحَمَّدٍ فَاسْتَنْقِذْنِى ، وَبِرَحْمَتِكَ فَخَلِّصْنِى؛

يَا مُحْسِنُ يَا مُجْمِلُ يَا مُنْعِمُ يَا مُفْضِلُ ، لَسْتُ أَتَّكِلُ فِى النَّجاةِ مِنْ عِقابِكَ عَلَىٰ أَعْمالِنا بَلْ بِفَضْلِكَ عَلَيْنا لِأَ نَّكَ أَهْلُ التَّقْوىٰ وَأَهْلُ الْمَغْفِرَةِ ، تُبْدِئُ بِالْإِحْسانِ نِعَماً ، وَتَعْفُو عَنِ الذَّنْبِ كَرَماً ، فَما نَدْرِى مَا نَشْكُرُ أَجَمِيلَ مَا تَنْشُرُ أَمْ قَبِيحَ مَا تَسْتُرُ؟ أَمْ عَظِيمَ مَا أَبْلَيْتَ وَأَوْلَيْتَ أَمْ كَثِيرَ مَا مِنْهُ نَجَّيْتَ وَعافَيْتَ ؟ يَا حَبِيبَ مَنْ تَحَبَّبَ إِلَيْكَ ، وَيَا قُرَّةَ عَيْنِ مَنْ لاذَبِكَ وَانْقَطَعَ إِلَيْكَ؛

أَنْتَ الْمُحْسِنُ وَنَحْنُ الْمُسِيئُونَ فَتَجاوَزْ يَا رَبِّ عَنْ قَبِيحِ مَا عِنْدَنا بِجَمِيلِ مَا عِنْدَكَ ، وَأَىُّ جَهْلٍ يَا رَبِّ لَايَسَعُهُ جُودُكَ ؟ أَوْ أَىُّ زَمانٍ أَطْوَلُ مِنْ أَناتِكَ ؟ وَمَا قَدْرُ أَعْمالِنا فِى جَنْبِ نِعَمِكَ ؟ وَكَيْفَ نَسْتَكْثِرُ أَعْمالاً نُقابِلُ بِها كَرَمَكَ  ؟ بَلْ كَيْفَ يَضِيقُ عَلَى الْمُذْنِبِينَ مَا وَسِعَهُمْ مِنْ رَحْمَتِكَ ؟ يَا واسِعَ الْمَغْفِرَةِ ، يَا باسِطَ الْيَدَيْنِ بِالرَّحْمَةِ ، فَوَعِزَّتِكَ يَا سَيِّدِى لَوْ نَهَرْتَنِى مَا بَرِحْتُ مِنْ بابِكَ وَلَا كَفَفْتُ عَنْ تَمَلُّقِكَ لِما انْتَهىٰ إِلَىَّ مِنَ الْمَعْرِفَةِ بِجُودِكَ وَكَرَمِكَ؛

وَ أَنْتَ الْفاعِلُ لِما تَشاءُ تُعَذِّبُ مَنْ تَشاءُ بِما تَشاءُ كَيْفَ تَشاءُ ، وَتَرْحَمُ مَنْ تَشاءُ بِما تشاءُ كَيْفَ تَشاءُ ، لَاتُسْأَلُ عَنْ فِعْلِكَ ، وَلَا تُنازَعُ فِى مُلْكِكَ ، وَلَا تُشارَكُ فِى أَمْرِكَ وَلَا تُضادُّ فِى حُكْمِكَ ، وَلَا يَعْتَرِضُ عَلَيْكَ أَحَدٌ فِى تَدْبِيرِكَ ، لَكَ الْخَلْقُ وَالْأَمْرُ تَبارَكَ اللّٰهُ رَبُّ الْعالَمِينَ .

يَا رَبِّ هٰذَا مَقامُ مَنْ لاذَبِكَ وَاسْتَجارَ بِكَرَمِكَ وَأَلِفَ إِحْسانَكَ وَ نِعَمَكَ ، وَأَنْتَ الْجَوادُ الَّذِى لَايَضِيقُ عَفْوُكَ ، وَلَا يَنْقُصُ فَضْلُكَ ، وَلَا تَقِلُّ رَحْمَتُكَ ، وَقَدْ تَوَثَّقْنا مِنْكَ بِالصَّفْحِ الْقَدِيمِ ، وَالْفَضْلِ الْعَظِيمِ ، وَالرَّحْمَةِ الْواسِعَةِ؛

أَفَتُراكَ يَا رَبِّ تُخْلِفُ ظُنُونَنا أَوْ تُخَيِّبُ آمالَنا ؟ كَلَّا يَا كَرِيمُ ظَنُّنا بِكَ وَلَا هٰذَا فِيكَ طَمَعُنَا ، يَا رَبِّ إِنَّ لَنا فِيكَ أَمَلاً طَوِيلاً كَثِيراً ، إِنَّ لَنا فِيكَ رَجاءً عَظِيماً ، عَصَيْناكَ وَنَحْنُ نَرْجُو أَنْ تَسْتُرَ عَلَيْنا ، وَدَعَوْناكَ وَنَحْنُ نَرْجُو أَنْ تَسْتَجِيبَ لَنا ، فَحَقِّقْ رَجاءَنا مَوْلانا فَقَدْ عَلِمْنا مَا نَسْتَوْجِبُ بِأَعْمالِنا وَلٰكِنْ عِلْمُكَ فِينا وَعِلْمُنا بِأَ نَّكَ لَاتَصْرِفُنا عَنْكَ حَثَّنا عَلَى الرَّغْبَةِ إِلَيْكَ  ، وَ إِنْ كُنَّا غَيْرَ مُسْتَوْجِبِينَ لِرَحْمَتِكَ فَأَنْتَ أَهْلٌ أَنْ تَجُودَ عَلَيْنا وَعَلَى الْمُذْنِبِينَ بِفَضْلِ سَعَتِكَ؛

فَامْنُنْ عَلَيْنا بِما أَنْتَ أَهْلُهُ وَجُدْ عَلَيْنا فَإِنَّا مُحْتاجُونَ إِلىٰ نَيْلِكَ ، يَا غَفَّارُ بِنُورِكَ اهْتَدَيْنا ، وَبِفَضْلِكَ اسْتَغْنَيْنا ، وَبِنِعْمَتِكَ  أَصْبَحْنا وَأَمْسَيْنا ، ذُنُوبُنا بَيْنَ يَدَيْكَ نَسْتَغْفِرُكَ اللّٰهُمَّ مِنْها وَنَتُوبُ إِلَيْكَ ، تَتَحَبَّبُ إِلَيْنا بِالنِّعَمِ وَنُعارِضُكَ بِالذُّنُوبِ ، خَيْرُكَ إِلَيْنا نازِلٌ ، وَشَرُّنا إِلَيْكَ صاعِدٌ ، وَلَمْ يَزَلْ وَلَا يَزالُ مَلَكٌ كَرِيمٌ يَأْتِيكَ عَنَّا بِعَمَلٍ قَبِيحٍ فَلا يَمْنَعُكَ ذٰلِكَ مِنْ أَنْ تَحُوطَنا بِنِعَمِكَ ، وتَتَفَضَّلَ عَلَيْنا بِآلائِكَ ، فَسُبْحانَكَ مَا أَحْلَمَكَ وَأَعْظَمَكَ وَأَكْرَمَكَ مُبْدِئاً وَمُعِيداً؛

تَقَدَّسَتْ أَسْماؤُكَ ، وَجَلَّ ثَناؤُكَ ، وَكَرُمَ صَنائِعُكَ وَفِعالُكَ ، أَنْتَ إِلٰهِى أَوْسَعُ فَضْلاً ، وَأَعْظَمُ حِلْماً مِنْ أَنْ تُقايِسَنِى بِفِعْلِى وَخَطِيئَتِى ، فَالْعَفْوَ الْعَفْوَ الْعَفْوَ ، سَيِّدِى سَيِّدِى سَيِّدِى؛

اللّٰهُمَّ اشْغَلْنا بِذِكْرِكَ ، وَأَعِذْنا مِنْ سَخَطِكَ ، وَأَجِرْنا مِنْ عَذابِكَ ، وَارْزُقْنا مِنْ مَواهِبِكَ ، وَأَنْعِمْ عَلَيْنا مِنْ فَضْلِكَ ، وَارْزُقْنا حَجَّ بَيْتِكَ وَزِيارَةَ قَبْرِ نَبِيِّكَ صَلَواتُكَ وَرَحْمَتُكَ وَمَغْفِرَتُكَ وَرِضْوانُكَ عَلَيْهِ وَعَلَىٰ أَهْلِ بَيْتِهِ إِنَّكَ قَرِيبٌ مُجِيبٌ ، وَ ارْزُقْنا عَمَلاً بِطاعَتِكَ ، وَتَوَفَّنا عَلَىٰ مِلَّتِكَ وَسُنَّةِ نَبِيِّكَ صَلَّى اللّٰهُ عَلَيْهِ وَآلِهِ . اللّٰهُمَّ اغْفِرْ لِى وَ لِوالِدَىَّ وَارْحَمْهُما كَما رَبَّيانِى صَغِيراً ، اجْزِهِما بِالْإِحْسانِ إِحْساناً وَبِالسَّيِّئاتِ غُفْراناً؛

اللّٰهُمَّ اغْفِرْ لِلْمُؤْمِنِينَ وَالْمُؤْمِناتِ الْأَحْياءِ مِنْهُمْ وَالْأَمْواتِ وَتابِعْ بَيْنَنا وَبَيْنَهُمْ بِالْخَيْراتِ . اللّٰهُمَّ اغْفِرْ لِحَيِّنا وَمَيِّتِنا ، وَشاهِدِنا وَغائِبِنا ، ذَكَرِنا وَأُنْثانا  ، صَغِيرِنا وَكَبِيرِنا ، حُرِّنا وَمَمْلُوكِنا ، كَذَبَ الْعادِلُونَ بِاللّٰهِ وَضَلُّوا ضَلالاً بَعِيداً وَخَسِرُوا خُسْراناً مُبِيناً .

اللّٰهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاخْتِمْ لِى بِخَيْرٍ ، وَاكْفِنِى مَا أَهَمَّنِى مِنْ أَمْرِ دُنْياىَ وَآخِرَتِى ، وَلَا تُسَلِّطْ عَلَىَّ مَنْ لَايَرْحَمُنِى ، وَاجْعَلْ عَلَىَّ مِنْكَ واقِيَةً باقِيَةً ، وَلَا تَسْلُبْنِى صالِحَ مَا أَنْعَمْتَ بِهِ عَلَىَّ ، وَارْزُقْنِى مِنْ فَضْلِكَ رِزْقاً واسِعاً حَلالاً طَيِّباً؛

اللّٰهُمَّ احْرُسْنِى بِحَراسَتِكَ ، وَاحْفَظْنِى بِحِفْظِكَ ، وَاكْلَأْنِى بِكَلاءَتِكَ ، وَارْزُقْنِى حَجَّ بَيْتِكَ الْحَرامِ  فِى عامِنا هٰذَا وَفِى كُلِّ عامٍ وَزِيارَةَ قَبْرِ نَبِيِّكَ وَالْأَئِمَّةِ عَلَيْهِمُ السَّلامُ ، وَلا تُخْلِنِى يَا رَبِّ مِنْ تِلْكَ الْمَشاهِدِ الشَّرِيفَةِ وَالْمَواقِفِ الْكَرِيمَةِ؛

اللّٰهُمَّ تُبْ عَلَىَّ حَتَّىٰ لَاأَعْصِيَكَ ، وَأَلْهِمْنِى الْخَيْرَ وَالْعَمَلَ بِهِ وَخَشْيَتَكَ بِاللَّيْلِ وَالنَّهارِ مَا أَبْقَيْتَنِى يَا رَبَّ الْعالَمِينَ . اللّٰهُمَّ إِنِّى كُلَّما قُلْتُ قَدْ تَهَيَّأْتُ وَتَعَبَّأْتُ  وَقُمْتُ لِلصَّلاةِ بَيْنَ يَدَيْكَ وَناجَيْتُكَ أَلْقَيْتَ عَلَىَّ نُعاساً إِذا أَنَا صَلَّيْتُ ، وَسَلَبْتَنِى مُناجاتَكَ إِذا أَنَا ناجَيْتُ ، مالِى كُلَّما قُلْتُ قَدْ صَلُحَتْ سَرِيرَتِى ، وَقَرُبَ مِنْ مَجالِسِ التَّوَّابِينَ مَجْلِسِى عَرَضَتْ لِى بَلِيَّةٌ أَزالَتْ قَدَمِى وَحالَتْ بَيْنِى وَبَيْنَ خِدْمَتِكَ؛

سَيِّدِى لَعَلَّكَ عَنْ بابِكَ طَرَدْتَنِى ، وَعَنْ خِدْمَتِكَ نَحَّيْتَنِى ، أَوْ لَعَلَّكَ رَأَيْتَنِى مُسْتَخِفّاً بِحَقِّكَ فَأَقْصَيْتَنِى ، أَوْ لَعَلَّكَ رَأَيْتَنِى مُعْرِضاً عَنْكَ فَقَلَيْتَنِى ، أَوْ لَعَلَّكَ وَجَدْتَنِى فِى مَقامِ الْكاذِبِينَ  فَرَفَضْتَنِى ، أَوْ لَعَلَّكَ رَأَيْتَنِى غَيْرَ شاكِرٍ لِنَعْمائِكَ فَحَرَمْتَنِى ، أَوْ لَعَلَّكَ فَقَدْتَنِى مِنْ مَجالِسِ الْعُلَماءِ فَخَذَلْتَنِى ، أَوْ لَعَلَّكَ رَأَيْتَنِى فِى الْغافِلِينَ فَمِنْ رَحْمَتِكَ آيَسْتَنِى ، أَوْ لَعَلَّكَ رَأَيْتَنِى آلِفَ مَجالِسِ الْبَطَّالِينَ فَبَيْنِى وَبَيْنَهُمْ خَلَّيْتَنِى ، أَوْ لَعَلَّكَ لَمْ تُحِبَّ أَنْ تَسْمَعَ دُعائِى فَباعَدْتَنِى ، أَوْ لَعَلَّكَ بِجُرْمِى وَجَرِيرَتِى كافَيْتَنِى أَوْ لَعَلَّكَ بِقِلَّةِ حَيائِى مِنْكَ جازَيْتَنِى؛

فَإِنْ عَفَوْتَ يَا رَبِّ فَطالَمَا عَفَوْتَ عَنِ الْمُذْنِبِينَ قَبْلِى لِأَنَّ كَرَمَكَ أَيْ رَبِّ يَجِلُّ عَنْ مُكافاةِ الْمُقَصِّرِينَ ، وَأَنَا عائِذٌ بِفَضْلِكَ ، هارِبٌ مِنْكَ إِلَيْكَ ، مُتَنَجِّزٌ  مَا وَعَدْتَ مِنَ الصَّفْحِ عَمَّنْ أَحْسَنَ بِكَ ظَنّاً . إِلٰهِى أَنْتَ أَوْسَعُ فَضْلاً ، وَأَعْظَمُ حِلْماً مِنْ أَنْ تُقايِسَنِى بِعَمَلِى ، أَوْ أَنْ تَسْتَزِلَّنِى بِخَطِيئَتِى ، وَمَا أَنَا يَا سَيِّدِى وَمَا خَطَرِى؛

هَبْنِى بِفَضْلِكَ سَيِّدِى وَتَصَدَّقْ عَلَىَّ بِعَفْوِكَ ، وَجَلِّلْنِى بِسَِتْرِكَ ، وَاعْفُ عَنْ تَوْبِيخِى بِكَرَمِ وَجْهِكَ ، سَيِّدِى أَنَا الصَّغِيرُ الَّذِى رَبَّيْتَهُ ، وَأَنَا الْجاهِلُ الَّذِى عَلَّمْتَهُ ، وَأَنَا الضَّالُّ الَّذِى هَدَيْتَهُ ، وَأَنَا الْوَضِيعُ الَّذِى رَفَعْتَهُ ، وَأَنَا الْخائِفُ الَّذِى آمَنْتَهُ ، وَالْجائِعُ الَّذِى أَشْبَعْتَهُ ، وَالْعَطْشانُ الَّذِى أَرْوَيْتَهُ ، وَالْعارِى الَّذِى كَسَوْتَهُ ، وَالْفَقِيرُ الَّذِى أَغْنَيْتَهُ ، وَالضَّعِيفُ الَّذِى قَوَّيْتَهُ ، وَالذَّلِيلُ الَّذِى أَعْزَزْتَهُ ، وَالسَّقِيمُ الَّذِى شَفَيْتَهُ ، وَالسَّائِلُ الَّذِى أَعْطَيْتَهُ ، وَالْمُذْنِبُ الَّذِى سَتَرْتَهُ ، وَالْخاطِئُ الَّذِى أَقَلْتَهُ؛

وَأَنَا الْقَلِيلُ الَّذِى كَثَّرْتَهُ ، وَالْمُسْتَضْعَفُ الَّذِى نَصَرْتَهُ ، وَأَنَا الطَّرِيدُ الَّذِى آوَيْتَهُ ، أَنَا يَا رَبِّ الَّذِى لَمْ أَسْتَحْيِكَ فِى الْخَلاءِ ، وَلَمْ أُراقِبْكَ فِى الْمَلاءِ ، أَنَا صاحِبُ الدَّواهِى الْعُظْمىٰ ،أَنَا الَّذِى عَلَىٰ سَيِّدِهِ اجْتَرَى ، أَنَا الَّذِى عَصَيْتُ جَبَّارَ السَّماءِ ، أَنَا الَّذِى أَعْطَيْتُ عَلَىٰ مَعاصِى الْجَلِيلِ  الرُّشى ، أَنَا الَّذِى حِينَ بُشِّرْتُ بِها خَرَجْتُ إِلَيْها أَسْعىٰ ، أَنَا الَّذِى أَمْهَلْتَنِى فَمَا ارْعَوَيْتُ  ، وَسَتَرْتَ عَلَىَّ فَمَا اسْتَحْيَيْتُ ، وَعَمِلْتُ بِالْمَعاصِى فَتَعَدَّيْتُ؛

وَأَسْقَطْتَنِى مِنْ عَيْنِكَ  فَما بالَيْتُ ، فَبِحِلْمِكَ أَمْهَلْتَنِى ، وَبِسِتْرِكَ سَتَرْتَنِى حَتَّىٰ كَأَنَّكَ أَغْفَلْتَنِى ، وَمِنْ عُقُوباتِ الْمَعاصِى جَنَّبْتَنِى حَتَّىٰ كَأَنَّكَ اسْتَحْيَيْتَنِى . إِلٰهِى لَمْ أَعْصِكَ حِينَ عَصَيْتُكَ وَأَنَا بِرُبُوبِيَّتِكَ جاحِدٌ ، وَلَا بِأَمْرِكَ مُسْتَخِفٌّ ، وَلَا لِعُقُوبَتِكَ مُتَعَرِّضٌ ، وَلَا لِوَعِيدِكَ مُتَهاوِنٌ ، لَكِنْ خَطِيئَةٌ عَرَضَتْ وَسَوَّلَتْ لِى نَفْسِى ، وَغَلَبَنِى هَواىَ ، وَأَعانَنِى عَلَيْها شِقْوَتِى ، وَغَرَّنِى سِتْرُكَ الْمُرْخىٰ عَلَىَّ ، فَقَدْ عَصَيْتُكَ وَخالَفْتُكَ بِجَُهْدِى ، فَالْآنَ مِنْ عَذابِكَ مَنْ يَسْتَنْقِذُنِى  وَمِنْ أَيْدِى الْخُصَماءِ غَداً مَنْ يُخَلِّصُنِى وَبِحَبْلِ مَنْ أَتَّصِلُ إِنْ أَنْتَ قَطَعْتَ حَبْلَكَ عَنِّى؛

فَوا سَوْأَتا  عَلَىٰ مَا أَحْصىٰ كِتابُكَ مِنْ عَمَلِى الَّذِى لَوْلا مَا أَرْجُو مِنْ كَرَمِكَ وَسَعَةِ رَحْمَتِكَ وَنَهْيِكَ إِيَّاىَ عَنِ الْقُنُوطِ لَقَنَطْتُ عِنْدَما أَتَذَكَّرُها ، يَا خَيْرَ مَنْ دَعاهُ داعٍ ، وَأَفْضَلَ مَنْ رَجاهُ راجٍ . اللّٰهُمَّ بِذِمَّةِ الْإِسْلامِ أَتَوَسَّلُ إِلَيْكَ ، وَبِحُرْمَةِ الْقُرْآنِ أَعْتَمِدُ عَلَيْكَ ، وَبِحُبِّى النَّبِىَّ الْأُمِّىَّ الْقُرَشِىَّ الْهاشِمِىَّ الْعَرَبِىَّ التِّهامِىَّ الْمَكِّىَّ الْمَدَنِىَّ أَرْجُو الزُّلْفَةَ لَدَيْكَ ، فَلا تُوحِشِ اسْتِيناسَ إِيمانِى وَلَا تَجْعَلْ ثَوابِى ثَوابَ مَنْ عَبَدَ سِواكَ؛

فَإِنَّ قَوْماً آمَنُوا بِأَلْسِنَتِهِمْ لِيَحْقِنُوا بِهِ دِماءَهُمْ فَأَدْرَكُوا مَا أَمَّلُوا ، وَ إِنَّا آمَنَّا بِكَ بِأَلْسِنَتِنا وَقُلُوبِنا لِتَعْفُوَ عَنَّا فَأَدْرِكْنا  مَا أَمَّلْنا ، وَثَبِّتْ رَجاءَكَ فِى صُدُورِنا ، وَلَا تُزِغْ قُلُوبَنا بَعْدَ إِذْ هَدَيْتَنا ، وَهَبْ لَنا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ ، فَوَعِزَّتِكَ لَوِ انْتَهَرْتَنِى مَا بَرِحْتُ مِنْ بابِكَ ، وَلَا كَفَفْتُ عَنْ تَمَلُّقِكَ لِما أُلْهِمَ قَلْبِى  مِنَ الْمَعْرِفَةِ بِكَرَمِكَ وَسَعَةِ رَحْمَتِكَ ، إِلىٰ مَنْ يَذْهَبُ الْعَبْدُ إِلّا إِلىٰ مَوْلاهُ ، وَ إِلىٰ مَنْ يَلْتَجِئُ الْمَخْلُوقُ إِلّا إِلىٰ خالِقِهِ؛

إِلٰهِى لَوْ قَرَنْتَنِى بِالْأَصْفادِ  ، وَمَنَعْتَنِى سَيْبَكَ مِنْ بَيْنِ الْأَشْهادِ ، وَدَلَلْتَ عَلَىٰ فَضائِحِى عُيُونَ الْعِبادِ ، وَأَمَرْتَ بِى إِلَى النَّارِ ، وَحُلْتَ بَيْنِى وَبَيْنَ الْأَ بْرارِ مَا قَطَعْتُ رَجائِى مِنْكَ ، وَمَا صَرَفْتُ تَأْمِيلِى لِلْعَفْوِ عَنْكَ ، وَلَا خَرَجَ حُبُّكَ مِنْ قَلْبِى ، أَنَا لَا أَنْسىٰ أَيادِيَكَ عِنْدِى ، وَسَِتْرَكَ عَلَىَّ فِى دارِ الدُّنْيا ، سَيِّدِى أَخْرِجْ حُبَّ الدُّنْيا مِنْ قَلْبِى ، وَاجْمَعْ بَيْنِى وَبَيْنَ الْمُصْطَفىٰ وَآلِهِ خِيَرَتِكَ مِنْ خَلْقِكَ وَ خاتَمِ النَّبِيِّينَ مُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَآلِهِ؛

وَانْقُلْنِى إِلىٰ دَرَجَةِ التَّوْبَةِ إِلَيْكَ ، وَأَعِنِّى بِالْبُكاءِ عَلَىٰ نَفْسِى فَقَدْ أَفْنَيْتُ بِالتَّسْوِيفِ وَالْآمالِ عُمْرِى ، وَقَدْ نَزَلْتُ مَنْزِلَةَ الْآيِسِينَ مِنْ خَيْرِى  ، فَمَنْ يَكُونُ أَسْوَأَ حالاً مِنِّى إِنْ أَنَا نُقِلْتُ عَلَىٰ مِثْلِ حالِى إِلىٰ قَبْرِى  لَمْ أُمَهِّدْهُ لِرَقْدَتِى ، وَلَمْ أَفْرُشْهُ بِالْعَمَلِ الصَّالِحِ لِضَجْعَتِى ؟ وَمَا لِى لَاأَبْكِى وَلَا أَدْرِى إِلىٰ مَا يَكُونُ مَصِيرِى ، وَأَرىٰ نَفْسِى تُخادِعُنِى ، وَأَيَّامِى تُخاتِلُنِى  وَقَدْ خَفَقَتْ عِنْدَ رَأْسِى  أَجْنِحَةُ الْمَوْتِ ؟ فَما لِى لَاأَبْكِى ؟ أَبْكِى لِخُرُوجِ نَفْسِى ، أَبْكِى لِظُلْمَةِ قَبْرِى ، أَبْكِى لِضِيقِ لَحْدِى ، أَبْكِى لِسُؤالِ مُنْكَرٍ وَنَكِيرٍ إِيَّاىَ؛

أَبْكِى لِخُرُوجِى مِنْ قَبْرِى عُرْياناً ذَلِيلاً حامِلاً ثِقْلِى عَلَىٰ ظَهْرِى أَنْظُرُ مَرَّةً عَنْ يَمِينِى وَأُخْرىٰ عَنْ شِمالِى إِذِ الْخَلائِقُ فِى شَأْنٍ غَيْرِ شَأْنِى، ﴿لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ، وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ ضاحِكَةٌ مُسْتَبْشِرَةٌ، وَوُجُوهٌ يَوْمَئِذٍ عَلَيْها غَبَرَةٌ تَرْهَقُها قَتَرَةٌ﴾ وَ ذِلَّةٌ، سَيِّدِى عَلَيْكَ مُعَوَّلِى وَمُعْتَمَدِى وَرَجائِى وَتَوَكُّلِى، وَبِرَحْمَتِكَ تَعَلُّقِى، تُصِيبُ بِرَحْمَتِكَ مَنْ تَشاءُ وَتَهْدِى بِكَرامَتِكَ مَنْ تُحِبُّ، فَلَكَ الْحَمْدُ عَلَىٰ مَا نَقَّيْتَ مِنَ الشِّرْكِ قَلْبِى، وَلَكَ الْحَمْدُ عَلَىٰ بَسْطِ لِسانِى، أَفَبِلِسانِى هٰذَا الْكالِّ أَشْكُرُكَ ؟ أَمْ بِغايَةِ جَُهْدِى فِى عَمَلِى أُرْضِيكَ؛

وَمَا قَدْرُ لِسانِى يَا رَبِّ فِى جَنْبِ شُكْرِكَ ؟ وَمَا قَدْرُ عَمَلِى فِى جَنْبِ نِعَمِكَ وَ إِحْسانِكَ؟ إِلٰهِى إِنَّ جُودَكَ بَسَطَ أَمَلِى ، وَشُكْرَكَ قَبِلَ عَمَلِى ، سَيِّدِى إِلَيْكَ رَغْبَتِى ، وَ إِلَيْكَ  رَهْبَتِى ، وَ إِلَيْكَ تَأْمِيلِى ، وَقَدْ ساقَنِى إِلَيْكَ أَمَلِى ، وَعَلَيْكَ يَا واحِدِى عَكَفَتْ  هِمَّتِى ، وَفِيما عِنْدَكَ انْبَسَطَتْ رَغْبَتِى ، وَلَكَ خالِصُ رَجائِى وَخَوْفِى ، وَبِكَ أَنَِسَتْ مَحَبَّتِى، وَ إِلَيْكَ أَلْقَيْتُ بِيَدِى ، وَبِحَبْلِ طاعَتِكَ مَدَدْتُ رَهْبَتِى ، يَا  مَوْلاىَ بِذِكْرِكَ عاشَ قَلْبِى ، وَبِمُناجاتِكَ بَرَّدْتُ أَلَمَ الْخَوْفِ عَنِّى ، فَيا مَوْلاىَ وَيَا مُؤَمَّلِى وَيَا مُنْتَهىٰ سُؤْلِى فَرِّقْ بَيْنِى وَبَيْنَ ذَنْبِىَ الْمانِعِ لِى مِنْ لُزُومِ طاعَتِكَ ، فَإِنَّما أَسْأَلُكَ لِقَدِيمِ الرَّجاءِ فِيكَ ، وَعَظِيمِ الطَّمَعِ مِنْكَ الَّذِى أَوْجَبْتَهُ عَلَىٰ نَفْسِكَ مِنَ الرَّأْفَةِ وَالرَّحْمَةِ ، فَالْأَمْرُ لَكَ وَحْدَكَ لا شَرِيكَ لَكَ وَالْخَلْقُ كُلُّهُمْ عِيالُكَ وَفِى قَبْضَتِكَ ، وَكُلُّ شَىْءٍ خاضِعٌ لَكَ ، تَبارَكْتَ يَا رَبَّ الْعالَمِينَ؛

إِلٰهِى ارْحَمْنِى إِذَا انْقَطَعَتْ حُجَّتِى ، وَكَلَّ عَنْ جَوابِكَ لِسانِى ، وَطاشَ عِنْدَ سُؤالِكَ إِيَّاىَ لُبِّى ، فَيا عَظِيمَ رَجائِى لَاتُخَيِّبْنِى إِذَا اشْتَدَّتْ فاقَتِى ، وَلَا تَرُدَّنِى لِجَهْلِى ، وَلَا تَمْنَعْنِى لِقِلَّةِ صَبْرِى ، أَعْطِنِى لِفَقْرِى ، وَارْحَمْنِى لِضَعْفِى ، سَيِّدِى عَلَيْكَ مُعْتَمَدِى وَمُعَوَّلِى وَرَجائِى وَتَوَكُّلِى ، وَبِرَحْمَتِكَ تَعَلُّقِى ، وَبِفِنائِكَ أَحُطُّ رَحْلِى ، وَبِجُودِكَ أَقْصِدُ  طَلِبَتِى ، وَبِكَرَمِكَ أَيْ رَبِّ أَسْتَفْتِحُ دُعائِى ، وَلَدَيْكَ أَرْجُو فاقَتِى  ، وَبِغِناكَ أَجْبُرُ عَيْلَتِى ، وَتَحْتَ ظِلِّ عَفْوِكَ قِيامِى ، وَ إِلىٰ جُودِكَ وَكَرَمِكَ أَرْفَعُ بَصَرِى ، وَ إِلىٰ مَعْرُوفِكَ أُدِيمُ نَظَرِى؛

فَلا تُحْرِقْنِى بِالنَّارِ وَأَنْتَ مَوْضِعُ أَمَلِى ، وَلَا تُسْكِنِّى الْهاوِيَةَ فَإِنَّكَ قُرَّةُ عَيْنِى ، يَا سَيِّدِى لَاتُكَذِّبْ ظَنِّى بِإِحْسانِكَ وَمَعْرُوفِكَ فَإِنَّكَ ثِقَتِى ، وَلَا تَحْرِمْنِى ثَوابَكَ فَإِنَّكَ الْعارِفُ بِفَقْرِى . إِلٰهِى إِنْ كانَ قَدْ دَنا أَجَلِى وَلَمْ يُقَرِّبْنِى مِنْكَ عَمَلِى فَقَدْ جَعَلْتُ الاعْتِرافَ إِلَيْكَ بِذَنْبِى وَسائِلَ عِلَلِى .

إِلٰهِى إِنْ عَفَوْتَ فَمَنْ أَوْلىٰ مِنْكَ بِالْعَفْوِ ؟ وَ إِنْ عَذَّبْتَ فَمَنْ أَعْدَلُ مِنْكَ فِى الْحُكْمِ ؟ ارْحَمْ فِى هٰذِهِ الدُّنْيا غُرْبَتِى ، وَعِنْدَ الْمَوْتِ كُرْبَتِى ، وَفِى الْقَبْرِ وَحْدَتِى ، وَفِى اللَّحْدِ وَحْشَتِى ، وَ إِذا نُشِرْتُ لِلْحِسابِ بَيْنَ يَدَيْكَ ذُلَّ مَوْقِفِى ، وَاغْفِرْ لِى مَا خَفِىَ عَلَى الْآدَمِيِّينَ مِنْ عَمَلِى؛

وَأَدِمْ لِى مَا بِهِ سَتَرْتَنِى ، وَارْحَمْنِى صَرِيعاً عَلَى الْفِراشِ تُقَلِّبُنِى أَيْدِى أَحِبَّتِى ، وَتَفَضَّلْ عَلَىَّ مَمْدُوداً عَلَى الْمُغْتَسَلِ يُقَلِّبُنِى  صالِحُ جِيرَتِى ، وَتَحَنَّنْ عَلَىَّ مَحْمُولاً قَدْ تَناوَلَ الْأَقْرِباءُ أَطْرافَ جِنازَتِى ، وَجُدْ عَلَىَّ مَنْقُولاً قَدْ نَزَلْتُ بِكَ وَحِيداً فِى حُفْرَتِى ، وَارْحَمْ فِى ذَلِكَ الْبَيْتِ الْجَدِيدِ غُرْبَتِى حَتَّىٰ لَاأَسْتَأْنِسَ بِغَيْرِكَ ، يَا سَيِّدِى إِنْ وَكَلْتَنِى إِلىٰ نَفْسِى هَلَكْتُ؛

سَيِّدِى فَبِمَنْ أَسْتَغِيثُ إِنْ لَمْ تُقِلْنِى عَثْرَتِى ؟ فَإِلىٰ مَنْ أَفْزَعُ إِنْ فَقَدْتُ عِنايَتَكَ فِى ضَجْعَتِى ؟ وَ إِلىٰ مَنْ أَلْتَجِئُ إِنْ لَمْ تُنَفِّسْ كُرْبَتِى ؟ سَيِّدِى مَنْ لِى ؟ وَمَنْ يَرْحَمُنِى إِنْ لَمْ تَرْحَمْنِى ؟ وَفَضْلَ مَنْ أُؤَمِّلُ إِنْ عَدِمْتُ فَضْلَكَ يَوْمَ فاقَتِى ؟ وَ إِلىٰ مَنِ الْفِرارُ مِنَ الذُّنُوبِ إِذَا انْقَضىٰ أَجَلِى ؟ سَيِّدِى لَاتُعَذِّبْنِى وَأَنَا أَرْجُوكَ .

إِلٰهِى  حَقِّقْ رَجائِى ، وَآمِنْ خَوْفِى ، فَإِنَّ كَثْرَةَ ذُنُوبِى لَاأَرْجُو فِيها  إِلّا عَفْوَكَ ، سَيِّدِى أَنَا أَسْأَلُكَ مَا لَاأَسْتَحِقُّ ، وَأَنْتَ أَهْلُ التَّقْوىٰ وَأَهْلُ الْمَغْفِرَةِ فَاغْفِرْ لِى وَأَلْبِسْنِى مِنْ نَظَرِكَ ثَوْباً يُغَطِّى عَلَىَّ التَّبِعاتِ وَتَغْفِرُها لِى وَلَا أُطالَبُ بِها ، إِنَّكَ ذُو مَنٍّ قَدِيمٍ ، وَصَفْحٍ عَظِيمٍ ، وَتَجاوُزٍ كَرِيمٍ؛

إِلٰهِى أَنْتَ الَّذِى تُفِيضُ سَيْبَكَ عَلَىٰ مَنْ لَا يَسْأَلُكَ وَعَلَى الْجاحِدِينَ بِرُبُوْبِيَّتِكَ ، فَكَيْفَ سَيِّدِى بِمَنْ سَأَلَكَ وَأَيْقَنَ أَنَّ الْخَلْقَ لَكَ ، وَالْأَمْرَ إِلَيْكَ ؟ تَبارَكْتَ وَتَعالَيْتَ يَا رَبَّ الْعالَمِينَ ، سَيِّدِى عَبْدُكَ بِبابِكَ أَقامَتْهُ الْخَصاصَةُ  بَيْنَ يَدَيْكَ يَقْرَعُ بابَ إِحْسانِكَ بِدُعائِهِ  فَلا تُعْرِضْ بِوَجْهِكَ الْكَرِيمِ عَنِّى ، وَاقْبَلْ مِنِّى مَا أَقُولُ ، فَقَدْ دَعَوْتُ  بِهٰذَا الدُّعاءِ وَأَنَا أَرْجُو أَنْ لَاتَرُدَّنِى مَعْرِفَةً مِنِّى بِرَأْفَتِكَ وَرَحْمَتِكَ . إِلٰهِى أَنْتَ الَّذِى لَا يُحْفِيكَ سائِلٌ ، وَلَا يَنْقُصُكَ نائِلٌ  ، أَنْتَ كَما تَقُولُ وَفَوْقَ مَا نَقُولُ؛

اللّٰهُمَّ إِنِّى أَسْأَلُكَ صَبْراً جَمِيلاً ، وَفَرَجاً قَرِيباً ، وَقَوْلاً صادِقاً ، وَأَجْراً عَظِيماً ، أَسْأَلُكَ يَا رَبِّ مِنَ الْخَيْرِ كُلِّهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ ، أَسْأَلُكَ اللّٰهُمَّ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ عِبادُكَ الصَّالِحُونَ ، يَا خَيْرَ مَنْ سُئِلَ ، وَأَجْوَدَ مَنْ أَعْطىٰ ، أَعْطِنِى سُؤْلِى فِى نَفْسِى وَأَهْلِى وَوالِدَىَّ وَوَُلْدِى وَأَهْلِ حُزانَتِى وَإِخْوانِى فِيكَ ، وَ أَرْغِدْ عَيْشِى ، وَأَظْهِرْ مُرُوَّتِى ، وَأَصْلِحْ جَمِيعَ أَحْوالِى ، وَاجْعَلْنِى مِمَّنْ أَطَلْتَ عُمْرَهُ ،وَحَسَّنْتَ عَمَلَهُ ، وَأَتْمَمْتَ عَلَيْهِ نِعْمَتَكَ ، وَرَضِيتَ عَنْهُ ، وَأَحْيَيْتَهُ حَياةً طَيِّبَةً فِى أَدْوَمِ السُّرُورِ ، وَأَسْبَغِ الْكَرامَةِ ، وَأَتَمِّ الْعَيْشِ إِنَّكَ تَفْعَلُ مَا تَشاءُ وَلَا يَفْعَلُ مَا يَشاءُ غَيْرُكَ؛

اللّٰهُمَّ خُصَّنِى مِنْكَ بِخاصَّةِ ذِكْرِكَ ، وَلَا تَجْعَلْ شَيْئاً مِمَّا أَتَقَرَّبُ بِهِ فِى آناءِ اللَّيْلِ وَأَطْرافِ النَّهارِ رِياءً وَلَا سُمْعَةً وَلَا أَشَراً وَلَا بَطَراً  ، وَاجْعَلْنِى لَكَ مِنَ الْخاشِعِينَ .

اللّٰهُمَّ أَعْطِنِى السَّعَةَ فِى الرِّزْقِ ، وَالْأَمْنَ فِى الْوَطَنِ ، وَقُرَّةَ الْعَيْنِ فِى الْأَهْلِ وَالْمالِ وَالْوَلَدِ ، وَالْمَُقامَ فِى نِعَمِكَ عِنْدِى ، وَالصِّحَّةَ فِى الْجِسْمِ ، وَالْقُوَّةَ فِى الْبَدَنِ ، وَالسَّلامَةَ فِى الدِّينِ ، وَاسْتَعْمِلْنِى بِطاعَتِكَ وَطاعَةِ رَسُولِكَ مُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَآلِهِ أَبَداً مَا اسْتَعْمَرْتَنِى ، وَاجْعَلْنِى مِنْ أَوْفَرِ عِبادِكَ عِنْدَكَ نَصِيباً فِى كُلِّ خَيْرٍ أَنْزَلْتَهُ وَتُنْزِلُهُ فِى شَهْرِ رَمَضانَ فِى لَيْلَةِ الْقَدْرِ وَمَا أَنْتَ مُنْزِلُهُ فِى كُلِّ سَنَةٍ مِنْ رَحْمَةٍ تَنْشُرُها ، وَعافِيَةٍ تُلْبِسُها ، وَبَلِيَّةٍ تَدْفَعُها ، وَحَسَناتٍ تَتَقَبَّلُها ، وَسَيِّئاتٍ تَتَجاوَزُ عَنْها؛

وَارْزُقْنِى حَجَّ بَيْتِكَ الْحَرامِ فِى عامِنا  هٰذَا وَفِى كُلِّ عامٍ ، وَارْزُقْنِى رِزْقاً واسِعاً مِنْ فَضْلِكَ الْواسِعِ ، وَاصْرِفْ عَنِّى يَا سَيِّدِى الْأَسْواءَ وَاقْضِ عَنِّى الدَّيْنَ وَالظُّلاماتِ حَتَّىٰ لا أَتَأَذَّىٰ بِشَىْءٍ مِنْهُ ، وَخُذْ عَنِّى بِأَسْماعِ وَأَبْصارِ أَعْدائِى وَحُسَّادِى وَالْباغِينَ عَلَىَّ ، وَانْصُرْنِى عَلَيْهِمْ ، وَأَقِرَّ عَيْنِى وَحَقِّقْ ظَنِّى  وَفَرِّحْ قَلْبِى؛

وَاجْعَلْ لِى مِنْ هَمِّى وَكَرْبِى فَرَجاً وَمَخْرَجاً ، وَاجْعَلْ مَنْ أَرادَنِى بِسُوءٍ مِنْ جَمِيعِ خَلْقِكَ تَحْتَ قَدَمَىَّ ، وَاكْفِنِى شَرَّ الشَّيْطانِ ، وَشَرَّ السُّلْطانِ ، وَسَيِّئاتِ عَمَلِى ، وَطَهِّرْنِى مِنَ الذُّنُوبِ كُلِّها ، وَأَجِرْنِى مِنَ النَّارِ بِعَفْوِكَ ، وَأَدْخِلْنِى الْجَنَّةَ بِرَحْمَتِكَ، وَ زَوِّجْنِى مِنَ الْحُورِ الْعِينِ بِفَضْلِكَ ، وَأَلْحِقْنِى بِأَوْلِيائِكَ الصَّالِحِينَ مُحَمَّدٍ وَآلِهِ الْأَبْرارِ الطَّيِّبِينَ الطَّاهِرِينَ الْأَخْيارِ ، صَلَواتُكَ عَلَيْهِمْ وَعَلَىٰ أَجْسادِهِمْ وَأَرْواحِهِمْ وَرَحْمَةُ اللّٰهِ وَبَرَكاتُهُ؛

إِلٰهِى وَسَيِّدِى وَعِزَّتِكَ وَجَلالِكَ لَئِنْ طالَبْتَنِى بِذُنُوبِى لَأُطالِبَنَّكَ بِعَفْوِكَ ، وَلَئِنْ طالَبْتَنِى بِلُؤْمِى لَأُطالِبَنَّكَ بِكَرَمِكَ ، وَلَئِنْ أَدْخَلْتَنِى النَّارَ لَأُخْبِرَنَّ أَهْلَ النَّارِ بِحُبِّى لَكَ .

إِلٰهِى وَسَيِّدِى إِنْ كُنْتَ لَاتَغْفِرُ إِلّا لِأَوْلِيائِكَ وَأَهْلِ طاعَتِكَ فَإِلىٰ مَنْ يَفْزَعُ الْمُذْنِبُونَ ؟ وَإِنْ كُنْتَ لَاتُكْرِمُ إِلّا أَهْلَ الْوَفاءِ بِكَ فَبِمَنْ يَسْتَغِيثُ الْمُسِيئُونَ؟ إِلٰهِى إِنْ أَدْخَلْتَنِى النَّارَ فَفِى ذٰلِكَ سُرُورُ عَدُوِّكَ ، وَ إِنْ أَدْخَلْتَنِى الْجَنَّةَ فَفِى ذٰلِكَ سُرُورُ نَبِيِّكَ ، وَأَنَا وَاللّٰهِ أَعْلَمُ أَنَّ سُرُورَ نَبِيِّكَ أَحَبُّ إِلَيْكَ مِنْ سُرُورِ عَدُوِّكَ؛

اللّٰهُمَّ إِنِّى أَسْأَلُكَ أَنْ تَمْلَأَ قَلْبِى حُبّاً لَكَ ، وَخَشْيَةً مِنْكَ ، وَتَصْدِيقاً بِكِتابِكَ ، وَإِيماناً بِكَ ، وَفَرَقاً مِنْكَ ، وَشَوْقاً إِلَيْكَ ، يَا ذَا الْجَلالِ وَالْإِكْرامِ حَبِّبْ إِلَىَّ لِقاءَكَ ، وَأَحْبِبْ لِقائِى ، وَاجْعَلْ لِى فِى لِقائِكَ الرَّاحَةَ وَالْفَرَجَ وَالْكَرامَةَ .

اللّٰهُمَّ أَلْحِقْنِى بِصالِحِ مَنْ مَضىٰ ، وَاجْعَلْنِى مِنْ صالِحِ مَنْ بَقِىَ وَخُذْ بِى سَبِيلَ الصَّالِحِينَ ، وَأَعِنِّى عَلَىٰ نَفْسِى بِما تُعِينُ بِهِ الصَّالِحِينَ عَلَىٰ أَنْفُسِهِمْ ، وَاخْتِمْ عَمَلِى بِأَحْسَنِهِ ، وَاجْعَلْ ثَوابِى مِنْهُ الْجَنَّةَ بِرَحْمَتِكَ ، وَأَعِنِّى عَلَىٰ صالِحِ مَا أَعْطَيْتَنِى ، وَثَبِّتْنِى يَا رَبِّ وَلَا تَرُدَّنِى فِى سُوءٍ اسْتَنْقَذْتَنِى مِنْهُ يَا رَبَّ الْعالَمِينَ؛

اللّٰهُمَّ إِنِّى أَسْأَلُكَ إِيماناً لَاأَجَلَ لَهُ دُونَ لِقائِكَ ، أَحْيِنِى مَا أَحْيَيْتَنِى عَلَيْهِ ، وَتَوَفَّنِى إِذا تَوَفَّيْتَنِى عَلَيْهِ ، وَابْعَثْنِى إِذا بَعَثْتَنِى عَلَيْهِ ، وَأَبْرِئْ قَلْبِى مِنَ الرِّياءِ وَالشَّكِّ وَالسُّمْعَةِ فِى دِينِكَ حَتَّىٰ يَكُونَ عَمَلِى خالِصاً لَكَ .

اللّٰهُمَّ أَعْطِنِى بَصِيرَةً فِى دِينِكَ ، وَفَهْماً فِى حُكْمِكَ ، وَفِقْهاً فِى عِلْمِكَ ، وَكِفْلَيْنِ مِنْ رَحْمَتِكَ ، وَوَرَعاً يَحْجُزُنِى عَنْ مَعاصِيكَ ، وَبَيِّضْ وَجْهِى بِنُورِكَ ، وَاجْعَلْ رَغْبَتِى فِيما عِنْدَكَ ، وَتَوَفَّنِى فِى سَبِيلِكَ وَعَلَىٰ مِلَّةِ رَسُو لِكَ صَلَّى اللّٰهُ عَلَيْهِ وَآلِهِ؛

اللّٰهُمَّ إِنِّى أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْفَشَلِ وَالْهَمِّ وَالْجُبْنِ وَالْبُخْلِ وَالْغَفْلَةِ وَالْقَسْوَةِ وَالْمَسْكَنَةِ وَالْفَقْرِ وَالْفاقَةِ وَكُلِّ بَلِيَّةٍ وَالْفَواحِشِ مَا ظَهَرَ مِنْها وَمَا بَطَنَ ، وَأَعُوذُ بِكَ مِنْ نَفْسٍ لَاتَقْنَعُ ، وَ بَطْنٍ لَايَشْبَعُ ، وَقَلْبٍ لَايَخْشَعُ ، وَدُعاءٍ لَايُسْمَعُ ، وَعَمَلٍ لَايَنْفَعُ ، وَأَعُوذُ بِكَ يَا رَبِّ عَلَىٰ نَفْسِى وَدِينِى وَمالِى وَعَلَىٰ جَمِيعِ مَا رَزَقْتَنِى مِنَ الشَّيْطانِ الرَّجِيمِ ، إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ؛

اللّٰهُمَّ إِنَّهُ لَايُجِيرُنِى مِنْكَ أَحَدٌ ، وَلَا أَجِدُ مِنْ دُونِكَ مُلْتَحَداً ، فَلا تَجْعَلْ نَفْسِى فِى شَىْءٍ مِنْ عَذابِكَ ، وَلَا تَرُدَّنِى بِهَلَكَةٍ ، وَلَا تَرُدَّنِى بِعَذابٍ أَلِيمٍ . اللّٰهُمَّ تَقَبَّلْ مِنِّى ، وَأَعْلِ ذِكْرِى ، وَارْفَعْ دَرَجَتِى ، وَحُطَّ وِزْرِى ، وَلَا تَذْكُرْنِى بِخَطِيئَتِى ، وَاجْعَلْ ثَوابَ مَجْلِسِى ، وَثَوابَ مَنْطِقِى ، وَثَوابَ دُعائِى رِضاكَ وَالْجَنَّةَ ، وَ أَعْطِنِى يَا رَبِّ جَمِيعَ مَا سَأَلْتُكَ وَ زِدْنِى مِنْ فَضْلِكَ إِنِّى إِلَيْكَ راغِبٌ يَا رَبَّ الْعالَمِينَ؛

اللّٰهُمَّ إِنَّكَ أَنْزَلْتَ فِى كِتابِكَ  أَنْ نَعْفُوَ عَمَّنْ ظَلَمَنا وَقَدْ ظَلَمْنا أَنْفُسَنا فَاعْفُ عَنَّا فَإِنَّكَ أَوْلىٰ بِذٰلِكَ مِنَّا ، وَأَمَرْتَنا أَنْ لَانَرُدَّ سائِلاً عَنْ أَبْوابِنا وَقَدْ جِئْتُكَ سائِلاً فَلَاٰ تَرُدَّنِى إِلّا بِقَضاءِ حاجَتِى ، وَأَمَرْتَنا بِالْإِحْسانِ إِلىٰ مَا مَلَكَتْ أَيْمانُنا وَنَحْنُ أَرِقَّاؤُكَ فَأَعْتِقْ رِقابَنا مِنَ النَّارِ ، يَا مَفْزَعِى عِنْدَ كُرْبَتِى ، وَيَا غَوْثِى عِنْدَ شِدَّتِى ، إِلَيْكَ فَزِعْتُ ، وَبِكَ اسْتَغَثْتُ وَلُذْتُ ، لَاأَلُوذُ بِسِواكَ ، وَلَا أَطْلُبُ الْفَرَجَ إِلّا مِنْكَ ، فَأَغِثْنِى وَفَرِّجْ عَنِّى يَا مَنْ يَفُكُّ الْأَسِيرَ  وَيَعْفُو عَنِ الْكَثِيرِ ، اقْبَلْ مِنِّى الْيَسِيرَ وَاعْفُ عَنِّى الْكَثِيرَ ، إِنَّكَ أَنْتَ الرَّحِيمُ الْغَفُورُ .

اللّٰهُمَّ إِنِّى أَسْأَلُكَ إِيماناً تُباشِرُ بِهِ قَلْبِى ، وَيَقِيناً صادِقاً  حَتَّىٰ أَعْلَمَ أَنَّهُ لَنْ يُصِيبَنِى إِلّا مَا كَتَبْتَ لِى ، وَرَضِّنِى مِنَ الْعَيْشِ بِمَا قَسَمْتَ لِى ، يَا أَرْحَمَ الرَّاحِمِينَ.''',
    benefits: "مروي في كتاب (مصباح المتهجد) للشيخ الطوسي عن أبي حمزة الثمالي، كان يقرأه الإمام زين العابدين (عليه السلام) في سحر كل ليلة من ليالي شهر رمضان المبارك.",
  ),
  Dua(
    title: "دعاء الافتتاح",
    text: r'''اللّٰهُمَّ إِنِّى أَفْتَتِحُ الثَّناءَ بِحَمْدِكَ وَأَنْتَ مُسَدِّدٌ لِلصَّوابِ بِمَنِّكَ ، وَأَيْقَنْتُ أَنَّكَ أَنْتَ أَرْحَمُ الرَّاحِمِينَ فِى مَوْضِعِ الْعَفْوِ وَالرَّحْمَةِ ، وَأَشَدُّ الْمُعاقِبِينَ فِى مَوْضِعِ النَّكالِ وَالنَّقِمَةِ ، وَأَعْظَمُ الْمُتَجَبِّرِينَ فِى مَوْضِعِ الْكِبْرِياءِ وَالْعَظَمَةِ .

اللّٰهُمَّ أَذِنْتَ لِى فِى دُعائِكَ وَمَسْأَلَتِكَ ، فَاسْمَعْ يَا سَمِيعُ مِدْحَتِى ، وَأَجِبْ يَا رَحِيمُ دَعْوَتِى ، وَأَقِلْ يَا غَفُورُ عَثْرَتِى ، فَكَمْ يَا إِلٰهِى مِنْ كُرْبَةٍ قَدْ فَرَّجْتَها ، وَهُمُومٍ  قَدْ كَشَفْتَها ، وَعَثْرَةٍ قَدْ أَقَلْتَها، وَرَحْمَةٍ قَدْ نَشَرْتَها ، وَحَلْقَةِ بَلاءٍ قَدْ فَكَكْتَها ،

الْحَمْدُ لِلّٰهِ الَّذِى لَمْ يَتَّخِذْ صاحِبَةً وَلَا وَلَداً وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِى الْمُلْكِ وَلَمْ يَكُنْ لَهُ وَ لِيٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبِيراً؛ الْحَمْدُ لِلّٰهِ بِجَمِيعِ مَحامِدِهِ كُلِّها ، عَلَىٰ جَمِيعِ نِعَمِهِ كُلِّها . الْحَمْدُ لِلّٰهِ الَّذِى لَامُضادَّ لَهُ فِى مُلْكِهِ ، وَلَا مُنازِعَ لَهُ فِى أَمْرِهِ . الْحَمْدُ لِلّٰهِ الَّذِى لَاشَرِيكَ لَهُ فِى خَلْقِهِ ، وَلَا شَبِيهَ  لَهُ فِى عَظَمَتِهِ .

الْحَمْدُ لِلّٰهِ الْفاشِى فِى الْخَلْقِ أَمْرُهُ وَحَمْدُهُ ، الظَّاهِرِ بِالْكَرَمِ مَجْدُهُ ، الْباسِطِ بِالْجُودِ يَدَهُ ، الَّذِى لَاتَنْقُصُ خَزائِنُهُ ، وَلَا تَزِيدُهُ كَثْرَةُ الْعَطاءِ إِلّا جُوداً وَكَرَماً إِنَّهُ هُوَ الْعَزِيزُ الْوَهَّابُ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ قَلِيلاً مِنْ كَثِيرٍ ، مَعَ حاجَةٍ بِى إِلَيْهِ عَظِيمَةٍ وَغِناكَ عَنْهُ قَدِيمٌ وَهُوَ عِنْدِى كَثِيرٌ ، وَهُوَ عَلَيْكَ سَهْلٌ يَسِيرٌ؛

اللّٰهُمَّ إِنَّ عَفْوَكَ عَنْ ذَنْبِى ، وَتَجاوُزَكَ عَنْ خَطِيئَتِى ، وَصَفْحَكَ عَنْ ظُلْمِى ، وَسَِتْرَكَ عَلَىٰ قَبِيحِ عَمَلِى ، وَحِلْمَكَ عَنْ كَثِيرِ  جُرْمِى عِنْدَ مَا كانَ مِنْ خَطَإى وَعَمْدِى أَطْمَعَنِى فِى أَنْ أَسْأَلَكَ مَا لَاأَسْتَوْجِبُهُ مِنْكَ الَّذِى رَزَقْتَنِى مِنْ رَحْمَتِكَ ، وَأَرَيْتَنِى مِنْ قُدْرَتِكَ ، وَعَرَّفْتَنِى مِنْ إِجابَتِكَ ، فَصِرْتُ أَدْعُوكَ آمِناً ، وَأَسْأَلُكَ مُسْتَأْنِساً لَاخائِفاً وَلَا وَجِلاً ، مُدِلّاً عَلَيْكَ فِيما قَصَدْتُ فِيهِ  إِلَيْكَ ، فَإِنْ أَبْطَأَ عَنِّى  عَتَبْتُ بِجَهْلِى عَلَيْكَ ، وَلَعَلَّ الَّذِى أَبْطَأَ عَنِّى هُوَ خَيْرٌ لِى لِعِلْمِكَ بِعاقِبَةِ الْأُمُورِ ، فَلَمْ أَرَ مَوْلىً كَرِيماً أَصْبَرَ عَلَى عَبْدٍ لَئِيمٍ مِنْكَ عَلَىَّ ، يَا رَبِّ ، إِنَّكَ تَدْعُونِى فَأُوَلِّى عَنْكَ ، وَتَتَحَبَّبُ إِلَىَّ فأَتَبَغَّضُ إِلَيْكَ ، وَتَتَوَدَّدُ إِلَىَّ فَلَا أَقْبَلُ مِنْكَ كَأَنَّ لِىَ التَّطَوُّلَ عَلَيْكَ؛  فَلَمْ يَمْنَعْكَ  ذٰلِكَ مِنَ الرَّحْمَةِ لِى وَالْإِحْسانِ إِلَىَّ ، وَالتَّفَضُّلِ عَلَىَّ بِجُودِكَ وَكَرَمِكَ ، فَارْحَمْ عَبْدَكَ الْجاهِلَ وَجُدْ عَلَيْهِ بِفَضْلِ إِحْسانِكَ إِنَّكَ جَوادٌ كَرِيمٌ .

الْحَمْدُ لِلّٰهِ مالِكِ الْمُلْكِ ، مُجْرِى الْفُلْكِ ، مُسَخِّرِ الرِّياحِ ، فالِقِ الْإِصْباحِ ، دَيَّانِ الدِّينِ ، رَبِّ الْعالَمِينَ . الْحَمْدُ لِلّٰهِ عَلىٰ حِلْمِهِ بَعْدَ عِلْمِهِ ، وَالْحَمْدُ لِلّٰهِ عَلَىٰ عَفْوِهِ بَعْدَ قُدْرَتِهِ ، وَالْحَمْدُ لِلّٰهِ عَلَىٰ طُولِ أَناتِهِ فِى غَضَبِهِ وَهُوَ قادِرٌ  عَلَىٰ مَا يُرِيدُ .

الْحَمْدُ لِلّٰهِ خالِقِ الْخَلْقِ ، باسِطِ الرِّزْقِ ، فالِقِ الْإِصْباحِ ، ذِى الْجَلالِ وَالْإِكْرامِ وَالْفَضْلِ وَالْإِنْعامِ  ، الَّذِى بَعُدَ فَلا يُرىٰ ، وَقَرُبَ فَشَهِدَ النَّجْوىٰ ، تَبارَكَ وَتَعالىٰ . الْحَمْدُ لِلّٰهِ الَّذِى لَيْسَ لَهُ مُنازِعٌ يُعادِلُهُ ، وَلَا شَبِيهٌ يُشاكِلُهُ ، وَلَا ظَهِيرٌ يُعاضِدُهُ ، قَهَرَ بِعِزَّتِهِ الْأَعِزَّاءَ ، وَتَواضَعَ لِعَظَمَتِهِ الْعُظَماءُ ، فَبَلَغَ بِقُدْرَتِهِ مَا يَشاءُ؛

الْحَمْدُ لِلّٰهِ الَّذِى يُجِيبُنِى حِينَ أُنادِيهِ ، وَيَسْتُرُ عَلَىَّ كُلَّ عَوْرَةٍ وَأَنَا أَعْصِيهِ ، وَيُعَظِّمُ النِّعْمَةَ عَلَىَّ فَلَا أُجازِيهِ ، فَكَمْ مِنْ مَوْهِبَةٍ هَنِيئَةٍ قَدْ أَعْطانِى ، وَعَظِيمَةٍ مَخُوفَةٍ قَدْ كَفانِى ، وَبَهْجَةٍ مُونِقَةٍ قَدْ أَرانِى ، فَأُثْنِى عَلَيْهِ حامِداً ، وَأَذْكُرُهُ مُسَبِّحاً . الْحَمْدُ لِلّٰهِ الَّذِى لَايُهْتَكُ حِجابُهُ ، وَلَا يُغْلَقُ بابُهُ ، وَلَا يُرَدُّ سائِلُهُ ، وَلَا يُخَيَّبُ  آمِلُهُ .

الْحَمْدُ لِلّٰهِ الَّذِى يُؤْمِنُ الْخائِفِينَ ، وَيُنَجِّى الصَّالِحِينَ  ، وَيَرْفَعُ الْمُسْتَضْعَفِينَ ، وَيَضَعُ الْمُسْتَكْبِرِينَ ، وَيُهْلِكُ مُلُوكاً وَيَسْتَخْلِفُ آخَرِينَ ، وَالْحَمْدُ لِلّٰهِ قاصِمِ الْجَبَّارِينَ ، مُبِيرِ الظَّالِمِينَ ، مُدْرِكِ الْهارِبِينَ ، نَكالِ الظَّالِمِينَ ، صَرِيخِ الْمُسْتَصْرِخِينَ ، مَوْضِعِ حاجاتِ الطَّالِبِينَ، مُعْتَمَدِ الْمُؤْمِنِينَ . الْحَمْدُ لِلّٰهِ الَّذِى مِنْ خَشْيَتِهِ تَرْعَدُ السَّماءُ وَسُكَّانُها ، وَتَرْجُفُ الْأَرْضُ وَعُمَّارُها ، وَتَمُوجُ الْبِحارُ وَمَنْ يَسْبَحُ  فِى غَمَراتِها؛

الْحَمْدُ لِلّٰهِ الَّذِى هَدانا لِهٰذا وَمَا كُنَّا لِنَهْتَدِىَ لَوْلَا أَنْ هَدَانا اللّٰهُ . الْحَمْدُ لِلّٰهِ الَّذِى يَخْلُقُ وَلَمْ يُخْلَقْ ، وَيَرْزُقُ وَلَا يُرْزَقُ ، وَيُطْعِمُ وَلَا يُطْعَمُ ، وَيُمِيتُ الْأَحْياءَ ، وَيُحْيِى الْمَوْتىٰ ، وَهُوَ حَيٌّ لَايَمُوتُ ، بِيَدِهِ الْخَيْرُ ، وَهُوَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ .

اللّٰهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ وَأَمِينِكَ وَصَفِيِّكَ وَحَبِيبِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ ، وَحافِظِ سِرِّكَ ، وَمُبَلِّغِ رِسالاتِكَ أَفْضَلَ وَأَحْسَنَ وَأَجْمَلَ وَأَكْمَلَ وَأَزْكىٰ وَأَنْمىٰ وَأَطْيَبَ وَأَطْهَرَ وَأَسْنىٰ وَأَكْثَرَ  مَا صَلَّيْتَ وَبارَكْتَ وَتَرَحَّمْتَ وَتَحَنَّنْتَ وَسَلَّمْتَ عَلَىٰ أَحَدٍ مِنْ عِبادِكَ  وَأَ نْبِيائِكَ وَرُسُلِكَ وَصِفْوَتِكَ وَأَهْلِ الْكَرامَةِ عَلَيْكَ مِنْ خَلْقِكَ؛

اللّٰهُمَّ  وَصَلِّ عَلَىٰ عَلِيٍّ أَمِيرِ الْمُؤْمِنِينَ ، وَوَصِيِّ رَسُولِ رَبِّ الْعالَمِينَ ، عَبْدِكَ وَوَ لِيِّكَ وَأَخِي رَسُولِكَ وَحُجَّتِكَ عَلَىٰ خَلْقِكَ ، وَآيَتِكَ الْكُبْرىٰ ، وَالنَّبَاَ الْعَظِيمِ ، وَصَلِّ عَلَى الصِّدِّيقَةِ الطَّاهِرَةِ فاطِمَةَ  سَيِّدَةِ نِساءِ الْعالَمِينَ ، وَصَلِّ عَلَىٰ سِبْطَىِ الرَّحْمَةِ ، وَ إِمامَىِ الْهُدىٰ الْحَسَنِ وَالْحُسَيْنِ سَيِّدَيْ شَبابِ أَهْلِ الْجَنَّةِ ، وَصَلِّ عَلَىٰ أَئِمَّةِ الْمُسْلِمِينَ ؛ عَلِيِّ بْنِ الْحُسَيْنِ ، وَمُحَمَّدِ بْنِ عَلِيٍّ ، وَجَعْفَرِ بْنِ مُحَمَّدٍ ، وَمُوسَى بْنِ جَعْفَرٍ ، وَعَلِيِّ بْنِ مُوسىٰ ، وَمُحَمَّدِ بْنِ عَلِيٍّ ، وَعَلِيِّ بْنِ مُحَمَّدٍ ، وَالْحَسَنِ بْنِ عَلِيٍّ ، وَالْخَلَفِ الْهادِي الْمَهْدِيِّ ، حُجَجِكَ عَلَىٰ عِبادِكَ ، وَأُمَنائِكَ فِى بِلادِكَ صَلاةً كَثِيرَةً دائِمَةً؛

اللّٰهُمَّ وَصَلِّ عَلَىٰ وَليِّ أَمْرِكَ الْقائِمِ الْمُؤَمَّلِ ، وَالْعَدْلِ الْمُنْتَظَرِ ، وَحُفَّهُ  بِمَلائِكَتِكَ الْمُقَرَّبِينَ ، وَأَيِّدْهُ بِرُوحِ الْقُدُسِ يَا رَبَّ الْعالَمِينَ . اللّٰهُمَّ اجْعَلْهُ الدَّاعِىَ إِلىٰ كِتابِكَ ، وَالْقائِمَ بِدِينِكَ ، اسْتَخْلِفْهُ فِى الْأَرْضِ كَمَا اسْتَخْلَفْتَ الَّذِينَ مِنْ قَبْلِهِ ، مَكِّنْ لَهُ دِينَهُ الَّذِى ارْتَضَيْتَهُ لَهُ ، أَبْدِلْهُ مِنْ بَعْدِ خَوْفِهِ أَمْناً ، يَعْبُدُكَ لَايُشْرِكُ بِكَ شَيْئاً .

اللّٰهُمَّ أَعِزَّهُ وَأَعْزِزْ بِهِ ، وَانْصُرْهُ وَانْتَصِرْ بِهِ ، وَانْصُرْهُ نَصْراً عَزِيزاً ، وَافْتَحْ لَهُ فَتْحاً يَسِيراً ، وَاجْعَلْ لَهُ مِنْ لَدُنْكَ سُلْطاناً نَصِيراً . اللّٰهُمَّ أَظْهِرْ بِهِ دِينَكَ وَسُنَّةَ نَبِيِّكَ حَتَّىٰ لَايَسْتَخْفِىَ بِشَىْءٍ مِنَ الْحَقِّ مَخافَةَ أَحَدٍ مِنَ الْخَلْقِ . اللّٰهُمَّ إِنَّا نَرْغَبُ إِلَيْكَ فِى دَوْلَةٍ كَرِيمَةٍ تُعِزُّ بِهَا الْإِسْلامَ وَأَهْلَهُ ، وَتُذِلُّ بِهَا النِّفاقَ وَأَهْلَهُ ، وَتَجْعَلُنا فِيها مِنَ الدُّعاةِ إِلَىٰ طاعَتِكَ ، وَالْقادَةِ إِلىٰ سَبِيلِكَ ، وَتَرْزُقُنا بِها كَرامَةَ الدُّنْيا وَالْآخِرَةِ؛ اللّٰهُمَّ مَا عَرَّفْتَنا مِنَ الْحَقِّ فَحَمِّلْناهُ ، وَمَا قَصُرْنا عَنْهُ فَبَلِّغْناهُ .

اللّٰهُمَّ الْمُمْ بِه شَعَثَنا  ، وَاشْعَبْ بِهِ صَدْعَنا  ، وَارْتُقْ بِهِ فَتْقَنا ، وَكَثِّرْ بِهِ قِلَّتَنا ، وَأَعْزِزْ  بِهِ ذِلَّتَنا ، وَأَغْنِ بِهِ عائِلَنا ، وَاقْضِ بِهِ عَنْ مَُغْرَمِنا ، وَاجْبُرْ بِهِ فَقْرَنا ، وَسُدَّ بِهِ خَلَّتَنا ، وَيَسِّرْ بِهِ عُسْرَنا ، وَبَيِّضْ بِهِ وُجُوهَنا ، وَفُكَّ بِهِ أَسْرَنا ، وَأَنْجِحْ بِهِ طَلِبَتَنا ، وَأَنْجِزْ بِهِ مَواعِيدَنا ، وَاسْتَجِبْ بِهِ دَعْوَتَنا ، وَأَعْطِنا بِهِ سُؤْلَنا ، وَبَلِّغْنا بِهِ مِنَ الدُّنْيا وَالْآخِرَةِ آمالَنا ، وَأَعْطِنا بِهِ فَوْقَ رَغْبَتِنا ، يَا خَيْرَ الْمَسْؤُولِينَ ، وَأَوْسَعَ الْمُعْطِينَ ، اشْفِ بِهِ صُدُورَنا ، وَأَذْهِبْ بِهِ غَيْظَ قُلُوبِنا ، وَاهْدِنا بِهِ لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ ، إِنَّكَ تَهْدِى مَنْ تَشاءُ إِلىٰ صِراطٍ مُسْتَقِيمٍ ، وَانْصُرْنا بِهِ عَلَىٰ عَدُوِّكَ وَعَدُوِّنا إِلٰهَ الْحَقِّ  آمِينَ؛

اللّٰهُمَّ إِنَّا نَشْكُو إِلَيْكَ فَقْدَ نَبِيِّنا صَلَواتُكَ عَلَيْهِ وَآلِهِ ، وَغَيْبَةَ وَ لِيِّنا  ، وَكَثْرَةَ عَدُوِّنا ، وَقِلَّةَ عَدَدِنا ، وَشِدَّةَ الْفِتَنِ بِنا ، وَتَظاهُرَ الزَّمانِ عَلَيْنا ، فَصَلِّ عَلَىٰ مُحَمَّدٍ وَآلِهِ  ، وَأَعِنَّا عَلىٰ ذٰلِكَ بِفَتْحٍ مِنْكَ  تُعَجِّلُهُ ، وَبِضُرٍّ تَكْشِفُهُ ، وَنَصْرٍ تُعِزُّهُ ، وَسُلْطانِ حَقٍّ تُظْهِرُهُ ، وَرَحْمَةٍ مِنْكَ تُجَلِّلُناها ، وَعافِيَةٍ مِنْكَ تُلْبِسُناها ، بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ.''',
    benefits: "يُستحبّ قراءته في كلّ ليلة من ليالي شهر رمضان المبارك، ويشتمل على مضامين عقائدية وأخلاقية وأدعية لصاحب الأمر (عج).",
  ),
  Dua(
    title: "دعاء المجير",
    text: r'''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ سُبْحانَكَ يَا اللّٰهُ ، تَعالَيْتَ يَا رَحْمٰنُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَارَحِيمُ ، تَعالَيْتَ يَا كَرِيمُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِير . سُبْحانَكَ يَا مَلِكُ ، تَعالَيْتَ يَامالِكُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا قُدُّوسُ ، تَعالَيْتَ يَا سَلامُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَامُؤْمِنُ ، تَعالَيْتَ يَامُهَيْمِنُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاعَزِيزُ ، تَعالَيْتَ يَاجَبَّارُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَامُتَكَبِّرُ ، تَعالَيْتَ يَامُتَجَبِّرُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ؛

سُبْحانَكَ يَاخالِقُ ، تَعالَيْتَ يَابارِئُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَامُصَوِّرُ ، تَعالَيْتَ يَامُقَدِّرُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاهادِى ، تَعالَيْتَ يَاباقِى ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاوَهَّابُ ، تَعالَيْتَ يَاتَوَّابُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ .سُبْحانَكَ يَافَتَّاحُ ، تَعالَيْتَ يَامُرْتاحُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاسَيِّدِى ، تَعالَيْتَ يَامَوْلاىَ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاقَرِيبُ ، تَعالَيْتَ يَارَقِيبُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَامُبْدِئُ ، تَعالَيْتَ يَامُعِيدُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا حَمِيدُ ، تَعالَيْتَ يَامَجِيدُ ، أَجِرْنا مِنَ النّارِ يَامُجِيرُ؛

سُبْحانَكَ يَا قَدِيمُ ، تَعالَيْتَ يَا عَظِيمُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَا غَفُورُ ، تَعالَيْتَ يَا شَكُورُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَاشَاهِدُ ، تَعالَيْتَ يَا شَهِيدُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَاحَنَّانُ ، تَعالَيْتَ يَا مَنَّانُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا بَاعِثُ ، تَعالَيْتَ يَا وَارِثُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا مُحْيِى ، تَعالَيْتَ يَا مُمِيتُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا شَفِيقُ ، تَعالَيْتَ يَا رَفِيقُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا أَنِيسُ ، تَعالَيْتَ يَا مُؤْنِسُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا جَلِيلُ ، تَعالَيْتَ يَا جَمِيلُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ؛

سُبْحانَكَ يَاخَبِيرُ ، تَعالَيْتَ يَا بَصِيرُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا حَفِىُّ ، تَعالَيْتَ يَا مَلِىُّ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَامَعْبُودُ ، تَعالَيْتَ يَامَوْجُودُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاغَفَّارُ ، تَعَالَيْتَ يَاقَهَّارُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ ، سُبْحانَكَ يَامَذْكُورُ ، تَعالَيْتَ يَامَشْكُورُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاجَوادُ ، تَعالَيْتَ يَامَعاذُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاجَمالُ ، تَعالَيْتَ يَاجَلالُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاسَابِقُ ، تَعالَيْتَ يَارَازِقُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاصَادِقُ ، تَعالَيْتَ يَافَالِقُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ؛

سُبْحانَكَ يَاسَمِيعُ ، تَعالَيْتَ يَاسَرِيعُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَارَفِيعُ ، تَعالَيْتَ يَابَدِيعُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَافَعَّالُ ، تَعالَيْتَ يَامُتَعالٍ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاقَاضِى ، تَعالَيْتَ يَارَاضِى ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاقَاهِرُ ، تَعالَيْتَ يَا طَاهِرُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَا عَالِمُ ، تَعالَيْتَ يَا حَاكِمُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ؛

سُبْحانَكَ يَا دائِمُ ، تَعالَيْتَ يَاقائِمُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاعَاصِمُ ، تَعالَيْتَ يَاقاسِمُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ ، سُبْحانَكَ يَاغَنِىُّ ، تَعالَيْتَ يَامُغْنِى ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاوَفِىُّ ، تَعالَيْتَ يَاقَوِىُّ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَاكَافِى ، تَعالَيْتَ يَا شَافِى ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَامُقَدِّمُ ، تَعالَيْتَ يَا مُؤَخِّرُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا أَوَّلُ ، تَعالَيْتَ يَا آخِرُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ؛

سُبْحانَكَ يَا ظَاهِرُ ، تَعالَيْتَ يَا بَاطِنُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَا رَجَاءُ ، تَعالَيْتَ يَا مُرْتَجىٰ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَاذَا الْمَنِّ ، تَعالَيْتَ يَا ذَا الطَّوْلِ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَاحَىُّ ،تَعالَيْتَ يَا قَيُّومُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا واحِدُ ، تَعالَيْتَ يَا أَحَدُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ ، سُبْحانَكَ يَا سَيِّدُ ، تَعالَيْتَ يَا صَمَدُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَا قَدِيرُ ، تَعالَيْتَ يَا كَبِيرُ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا وَالِى ، تَعالَيْتَ يا مُتَعَالِى ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ؛

سُبْحانَكَ يَا عَلِىُّ ، تَعالَيْتَ يَا أَعْلىٰ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا وَلِىُّ ، تَعالَيْتَ يَا مَوْلىٰ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا ذارِئُ ، تَعالَيْتَ يَا بَارِئُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَا خَافِضُ ، تَعالَيْتَ يَا رَافِعُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ .سُبْحانَكَ يَا مُقْسِطُ ، تَعالَيْتَ يَا جَامِعُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ ، سُبْحانَكَ يَامُعِزُّ ، تَعالَيْتَ يَا مُذِلُّ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا حَافِظُ ، تَعالَيْتَ يَا حَفِيظُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا قادِرُ ، تَعالَيْتَ يَا مُقْتَدِرُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا عَلِيمُ ، تَعالَيْتَ يَا حَلِيمُ ، أَجِرْنا مِنَ النَّارِ يا مُجِيرُ؛

سُبْحانَكَ يَا حَكَمُ ، تَعالَيْتَ يَا حَكِيمُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَامُعْطِى ، تَعالَيْتَ يَا مانِعُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا ضَارُّ ، تَعالَيْتَ يَا نَافِعُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا مُجِيبُ ، تَعالَيْتَ يَا حَسِيبُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا عادِلُ ، تَعالَيْتَ يَا فاصِلُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحانَكَ يَا لَطِيفُ ، تَعالَيْتَ يَا شَرِيفُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ .سُبْحانَكَ يَا رَبُّ ، تَعالَيْتَ يَا حَقُّ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ ، سُبْحانَكَ يَا مَاجِدُ ، تَعالَيْتَ يَا وَاحِدُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا عَفُوُّ ، تَعالَيْتَ يَا مُنْتَقِمُ ،أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ؛

سُبْحانَكَ يَا واسِعُ ، تَعالَيْتَ يَا مُوَسِّعُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ ، سُبْحانَكَ يَا رَؤُوفُ ، تَعالَيْتَ يَا عَطُوفُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ .سُبْحانَكَ يَا فَرْدُ ، تَعالَيْتَ يَا وِتْرُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا مُقِيتُ ، تَعالَيْتَ يَا مُحِيطُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا وَكِيلُ ، تَعالَيْتَ يَاعَدْلُ ، أَجِرْنا مِنَ النّارِ يَا مُجِيرُ . سُبْحانَكَ يَا مُبِينُ ، تَعالَيْتَ يَا مَتِينُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا بَرُّ ، تَعالَيْتَ يَا وَدُودُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ ، سُبْحانَكَ يَا رَشِيدُ ، تَعالَيْتَ يَا مُرْشِدُ ، أَجِرْنا مِنَ النَّارِ يا مُجِيرُ ، سُبْحانَكَ يَانُورُ ، تَعالَيْتَ يَا مُنَوِّرُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ؛

سُبْحانَكَ يَا نَصِيرُ ، تَعالَيْتَ يَا نَاصِرُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا صَبُورُ ، تَعالَيْتَ يَا صَابِرُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا مُحْصِى ، تَعالَيْتَ يَا مُنْشِئُ ، أَجِرْنا مِنَ النَّارِ يَامُجِيرُ . سُبْحَانَكَ يَا سُبْحَانُ ، تَعالَيْتَ يَا دَيَّانُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ سُبْحانَكَ يَا مُغِيثُ ، تَعالَيْتَ يَا غِياثُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَافَاطِرُ ، تَعالَيْتَ يَا حَاضِرُ ، أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ . سُبْحانَكَ يَا ذَا الْعِزِّ وَالْجَمَالِ ، تَبارَكْتَ يَا ذَا الْجَبَرُوتِ وَالْجَلَالِ ، سُبْحانَكَ لَاإِلٰهَ إِلّا أَنْتَ ، سُبْحانَكَ إِنِّى كُنْتُ مِنَ الظَّالِمِينَ فَاسْتَجَبْنا لَهُ وَنَجَّيْناهُ مِنَ الْغَمِّ وَكَذٰلِكَ نُنْجِى الْمُؤْمِنِينَ ، وَصَلَّى اللّٰهُ عَلىٰ سَيِّدِنا  مُحَمَّدٍ وَآلِهِ أَجْمَعِينَ ، وَالْحَمْدُ لِلّٰهِ رَبِّ الْعالَمِينَ ، وَحَسْبُنا اللّٰهُ وَنِعْمَ الْوَكِيلُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلّا بِاللّٰهِ الْعَلِيِّ الْعَظِيمِ.''',
    benefits: "دعاء رفيع الشأن مروي عن النبي الأكرم (صلى الله عليه وآله وسلم) نزل به جبرئيل والرسول يصلّي في مقام إبراهيم (عليه السلام)، ومن قاله في الأيام البيض من شهر رمضان غُفرت له ذنوبه.",
  ),
  Dua(
    title: "دعاء العديلة",
    text: r'''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ شَهِدَ اللّٰهُ أَنَّهُ لَاإِلٰهَ إِلّا هُوَ وَالْمَلائِكَةُ وَأُولُوا الْعِلْمِ قَائِماً بِالْقِسْطِ لَاإِلٰهَ إِلّا هُوَ الْعَزِيزُ الْحَكِيمُ ، إِنَّ الدِّينَ عِنْدَ اللّٰهِ الْإِسْلامُ ، وَأَنَا الْعَبْدُ الضَّعِيفُ الْمُذْنِبُ الْعاصِى الْمُحْتاجُ الْحَقِيرُ ، أَشْهَدُ لِمُنْعِمِى وَخالِقِى وَرازِقِى وَمُكْرِمِى كَما شَهِدَ لِذاتِهِ ، وَشَهِدَتْ لَهُ الْمَلائِكَةُ وَأُولُوا الْعِلْمِ مِنْ عِبادِهِ ، بِأَنَّهُ لَاإِلٰهَ إِلّا هُوَ ذُو النِّعَمِ وَالْإِحْسانِ ، وَالْكَرَمِ وَالْامْتِنانِ ،

قادِرٌ أَزَلِيٌّ ، عالِمٌ أَبَدِيٌّ ، حَيٌّ أَحَدِيٌّ ، مَوْجُودٌ سَرْمَدِيٌّ ، سَمِيعٌ بَصِيرٌ؛ مُرِيدٌ كارِهٌ ، مُدْرِكٌ صَمَدِيٌّ ، يَسْتَحِقُّ هَذِهِ الصِّفاتِ وَهُوَ عَلَىٰ ما هُوَ عَلَيْهِ فِي عِزِّ صِفاتِهِ ، كَانَ قَوِيّاً قَبْلَ وُجُودِ الْقُدْرَةِ وَالْقُوَّةِ ، وَكانَ عَلِيماً قَبْلَ إِيجادِ الْعِلْمِ وَالْعِلَّةِ ، لَمْ يَزَلْ سُلْطاناً إِذْ لَامَمْلَكَةَ وَلَا مالَ ، وَلَمْ يَزَلْ سُبْحَاناً عَلىٰ جَمِيعِ الْأَحْوالِ ،

وُجُودُهُ قَبْلَ الْقَبْلِ فِى أَزَلِ الْآزالِ ، وَبَقاؤُهُ بَعْدَ الْبَعْدِ مِنْ غَيْرِ انْتِقالٍ وَلَا زَوالٍ ، غَنِيٌّ فِى الْأَوَّلِ وَالْآخِرِ ، مُسْتَغْنٍ فِى الْباطِنِ وَالظَّاهِرِ ، لَاجَوْرَ فِى قَضِيَّتِهِ ، ولَا مَيْلَ فِى مَشِيئَتِهِ ، وَلَا ظُلْمَ فِى تَقْدِيرِهِ ، وَلَا مَهْرَبَ مِنْ حُكُومَتِهِ ، وَلَا مَلْجَأَ مِنْ سَطَواتِهِ ، وَلَا مَنْجٰا مِنْ نَقِماتِهِ؛

سَبَقَتْ رَحْمَتُهُ غَضَبَهُ ، وَلَا يَفُوتُهُ أَحَدٌ إِذا طَلَبَهُ ، أَزاحَ الْعِلَلَ فِى التَّكْلِيفِ ، وَسَوَّى التَّوْفِيقَ بَيْنَ الضَّعِيفِ وَالشَّرِيفِ ، مَكَّنَ أَداءَ الْمَأْمُورِ ، وَسَهَّلَ سَبِيلَ اجْتِنابِ الْمَحْظُورِ ، لَمْ يُكَلِّفِ الطَّاعَةَ إِلّا دُونَ الْوُسْعِ وَالطَّاقَةِ ، سُبْحانَهُ مَا أَبْيَنَ كَرَمَهُ ، وَأَعْلَىٰ شَأْنَهُ ! سُبْحانَهُ مَا أَجَلَّ نَيْلَهُ ، وَأَعْظَمَ إِحْسانَهُ ! بَعَثَ الْأَنْبِياءَ لِيُبَيِّنَ عَدْلَهُ ، وَنَصَبَ الْأَوْصِياءَ لِيُظْهِرَ طَوْلَهُ وَفَضْلَهُ ، وَجَعَلَنا مِنْ أُمَّةِ سَيِّدِ الْأَنْبِياءِ ،وَخَيْرِ الْأَوْلِياءِ ، وَأَفْضَلِ الْأَصْفِياءِ ، وَأَعْلَى الْأَزْكِياءِ ، مُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَ آلِهِ وَسَلَّمَ؛

آمَنَّا بِهِ وَبِما دَعانا إِلَيْهِ ، وَبِالْقُرْآنِ الَّذِى أَنْزَلَهُ عَلَيْهِ ، وَبِوَصِيِّهِ الَّذِى نَصَبَهُ يَوْمَ الْغَدِيرِ وَأَشارَ بِقَوْلِهِ : هٰذا عَلِيٌّ إِلَيْهِ ، وَأَشْهَدُ أَنَّ الْأَئِمَّةَ الْأَبْرارَ وَالْخُلَفاءَ الْأَخْيارَ بَعْدَ الرَّسُولِ الْمُخْتارِ : عَلِيٌّ قامِعُ الْكُفّارِ ، وَمِنْ بَعْدِهِ سَيِّدُ أَوْلادِهِ الْحَسَنُ بْنُ عَلِيٍّ ، ثُمَّ أَخُوهُ السِّبْطُ التَّابِعُ لِمَرْضاةِ اللّٰهِ الْحُسَيْنُ ، ثُمَّ الْعابِدُ عَلِيٌّ ، ثُمَّ الْباقِرُ مُحَمَّدٌ ، ثُمَّ الصّادِقُ جَعْفَرٌ؛ ثُمَّ الْكَاظِمُ مُوسىٰ ، ثُمَّ الرِّضا عَلِيٌّ ، ثُمَّ التَّقِىُّ مُحَمَّدٌ ، ثُمَّ النَّقِىُّ عَلِيٌّ ، ثُمَّ الزَّكِىُّ الْعَسْكَرِىُّ الْحَسَنُ ، ثُمَّ الْحُجَّةُ الْخَلَفُ الْقائِمُ الْمُنْتَظَرُ الْمَهْدِىُّ الْمُرْجَى الَّذِى بِبَقائِهِ بَقِيَتِ الدُّنْيا ، وَبِيُمْنِهِ رُزِقَ الْوَرىٰ ، وَبِوُجُودِهِ ثَبَتَتِ الْأَرْضُ وَالسَّماءُ ، وَبِهِ يَمْلَأُ اللّٰهُ الْأَرْضَ قِسْطاً وَعَدْلاً بَعْدَما مُلِئَتْ ظُلْماً وَجَوْراً؛

وَأَشْهَدُ أَنَّ أَقْوالَهُمْ حُجَّةٌ ، وَامْتِثالَهُمْ فَرِيضَةٌ ، وَطاعَتَهُمْ مَفْرُوضَةٌ ، وَمَوَدَّتَهُمْ لازِمَةٌ مَقْضِيَّةٌ ، وَالْاقْتِداءَ بِهِمْ مُنْجِيَةٌ ، وَمُخالَفَتَهُمْ مُرْدِيَةٌ ، وَهُمْ سَاداتُ أَهْلِ الْجَنَّةِ أَجْمَعِينَ ، وَشُفَعاءُ يَوْمِ الدِّينِ ، وَأَئِمَّةُ أَهْلِ الْأَرْضِ عَلَى الْيَقِينِ ، وَأَفْضَلُ الْأَوْصِياءِ الْمَرْضِيِّينَ ،

وَأَشْهَدُ أَنَّ الْمَوْتَ حَقٌّ ، وَمُساءَلَةَ الْقَبْرِ حَقٌّ ، وَالْبَعْثَ حَقٌّ ، وَالنُّشُورَ حَقٌّ ، وَالصِّراطَ حَقٌّ ، وَالْمِيزانَ حَقٌّ ، وَالْحِسابَ حَقٌّ ، وَالْكِتابَ حَقٌّ ، وَالْجَنَّةَ حَقٌّ ، وَالنَّارَ حَقٌّ ، وَأَنَّ السَّاعَةَ آتِيَةٌ لَارَيْبَ فِيها ، وَأَنَّ اللّٰهَ يَبْعَثُ مَنْ فِى الْقُبُورِ؛

اللّٰهُمَّ فَضْلُكَ رَجَائِى ، وَكَرَمُكَ وَرَحْمَتُكَ أَمَلِى ، لَاعَمَلَ لِى أَسْتَحِقُّ بِهِ الْجَنَّةَ ، وَلَا طاعَةَ لِى أَسْتَوْجِبُ بِهَا الرِّضْوانَ ، إِلّا أَنِّى اعْتَقَدْتُ تَوْحِيدَكَ وَعَدْلَكَ ، وَارْتَجَيْتُ إِحْسانَكَ وَفَضْلَكَ ، وَتَشَفَّعْتُ إِلَيْكَ بِالنَّبِيِّ وَآلِهِ مِنْ أَحِبَّتِكَ ، وَأَنْتَ أَكْرَمُ الْأَكْرَمِينَ وَأَرْحَمُ الرَّاحِمِينَ ، وَصَلَّى اللّٰهُ عَلىٰ نَبِيِّنا مُحَمَّدٍ وَآلِهِ أَجْمَعِينَ الطَّيِّبِينَ الطَّاهِرِينَ وَسَلَّمَ تَسْلِيماً كَثِيراً كَثِيراً ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلّا بِاللّٰهِ الْعَلِيِّ الْعَظِيمِ .

اللّٰهُمَّ يَا أَرْحَمَ الرَّاحِمِينَ إِنِّي أَوْدَعْتُكَ يَقِينِي هٰذَا وَثَباتَ دِينِى وَأَنْتَ خَيْرُ مُسْتَوْدَعٍ ، وَقَدْ أَمَرْتَنا بِحِفْظِ الْوَدائِعِ ، فَرُدَّهُ عَلَىَّ وَقْتَ حُضُورِ مَوْتِى ، بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ؛

اللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَدِيلَةِ عِنْدَ الْمَوْتِ.

اللّٰهُمَّ يَا أَرْحَمَ الرَّاحِمِينَ ، إِنِّى قَدْ أَوْدَعْتُكَ يَقِينِى هٰذَا وَثَباتَ دِينِى وَأَ نْتَ خَيْرُ مُسْتَوْدَعٍ ، وَقَدْ أَمَرْتَنا بِحِفْظِ الْوَدائِعِ ، فَرُدَّهُ عَلَىَّ وَقْتَ حُضُورِ مَوْتِى.

رَضِيتُ بِاللّٰهِ رَبّاً ، وَبِمُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَآلِهِ نَبِيّاً ، وَبِالْإِسْلامِ دِيناً ، وَبِالْقُرْآنِ كِتاباً ، وَبِالْكَعْبَةِ قِبْلَةً ، وَبِعَلِيٍّ وَلِيّاً وَ إِماماً ، وَبِالْحَسَنِ وَالْحُسَيْنِ وَعَلِيِّ بْنِ الْحُسَيْنِ وَمُحَمَّدِ بْنِ عَلِيٍّ وَجَعْفَرِ بْنِ مُحَمَّدٍ وَمُوسَى بْنِ جَعْفَرٍ وَعَلِيِّ بْنِ مُوسىٰ وَمُحَمَّدِ بْنِ عَلِيٍّ وَعَلِيِّ بْنِ مُحَمَّدٍ وَالْحَسَنِ بْنِ عَلِيٍّ وَالْحُجَّةِ بْنِ الْحَسَنِ صَلَواتُ اللّٰهِ عَلَيْهِمْ أَئِمَّةً . اللّٰهُمَّ إِنِّى رَضِيتُ بِهِمْ أَئِمَّةً فَارْضَنِى لَهُمْ إِنَّكَ عَلىٰ كُلِّ شَىْءٍ قَدِيرٌ.''',
    benefits: "يشتمل على شهادة التوحيد والإقرار بالعقائد الحقة لترسيخ الإيمان في النفس وتلاوته تحمي المؤمن من العديلة عند الموت.",
  ),
  Dua(
    title: "دعاء السحر",
    text: r'''اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ بَهائِكَ بِأَبْهاهُ وَكُلُّ بَهائِكَ بَهِيٌّ ، اللّٰهُمَّ إِنِّي أَسْأَلُكَ بِبَهائِكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ جَمالِكَ بِأَجْمَلِهِ وَكُلُّ جَمالِكَ جَمِيلٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِجَمالِكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ جَلالِكَ بِأَجَلِّهِ وَكُلُّ جَلالِكَ جَلِيلٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِجَلالِكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ عَظَمَتِكَ بِأَعْظَمِها وَكُلُّ عَظَمَتِكَ عَظِيمَةٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِعَظَمَتِكَ كُلِّها .

اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ نُورِكَ بِأَنْوَرِهِ وَكُلُّ نُورِكَ نَيِّرٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِنُورِكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ رَحْمَتِكَ بِأَوْسَعِها وَكُلُّ رَحْمَتِكَ واسِعَةٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِرَحْمَتِكَ كُلِّها. اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ كَلِماتِكَ بِأَتَمِّها وَكُلُّ كَلِماتِكَ تامَّةٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِكَلِماتِكَ كُلِّها؛

اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ كَمالِكَ بِأَكْمَلِهِ وَكُلُّ كَمالِكَ كامِلٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِكَمالِكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ أَسْمائِكَ بِأَكْبَرِها وَكُلُّ أَسْمائِكَ كَبِيرَةٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِأَسْمائِكَ كُلِّها . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ عِزَّتِكَ بِأَعَزِّها وَكُلُّ عِزَّتِكَ عَزِيزَةٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِعِزَّتِكَ كُلِّها . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ مَشِيئَتِكَ بِأَمْضاها وَكُلُّ مَشِيئَتِكَ ماضِيَةٌ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِمَشِيئَتِكَ كُلِّها .

اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ قُدْرَتِكَ بِالْقُدْرَةِ الَّتِى اسْتَطَلْتَ  بِها عَلَىٰ كُلِّ شَىْءٍ وَكُلُّ قُدْرَتِكَ مُسْتَطِيلَةٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِقُدْرَتِكَ كُلِّها . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ عِلْمِكَ بِأَنْفَذِهِ وَكُلُّ عِلْمِكَ نافِذٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِعِلْمِكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ قَوْلِكَ بِأَرْضاهُ وَكُلُّ قَوْ لِكَ رَضِيٌّ ، اللّٰهُمَّ إِنِّي أَسْأَلُكَ بِقَوْلِكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ مَسائِلِكَ بِأَحَبِّها إِلَيْكَ وَكُلُّهٰا  إِلَيْكَ حَبِيبَةٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِمَسائِلِكَ كُلِّها؛

اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ شَرَفِكَ بِأَشْرَفِهِ وَكُلُّ شَرَفِكَ شَرِيفٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِشَرَفِكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ سُلْطانِكَ بِأَدْوَمِهِ وَكُلُّ سُلْطانِكَ دَائِمٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِسُلْطانِكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ مُلْكِكَ بِأَ فْخَرِهِ وَكُلُّ مُلْكِكَ فاخِرٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِمُلْكِكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ عُلُوِّكَ بِأَعْلاهُ وَكُلُّ عُلُوِّكَ عالٍ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِعُلُوِّكَ كُلِّهِ .

اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ مَنِّكَ بِأَ قْدَمِهِ وَكُلُّ مَنِّكَ قَدِيمٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِمَنِّكَ كُلِّهِ . اللّٰهُمَّ إِنِّى أَسْأَلُكَ مِنْ آياتِكَ بِأَكْرَمِها وَكُلُّ آياتِكَ كَرِيمَةٌ ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بآياتِكَ كُلِّها . اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِما أَنْتَ فِيهِ مِنَ الشَّأْنِ وَالْجَبَرُوتِ وَأَسْأَلُكَ بِكُلِّ شَأْنٍ وَحْدَهُ وَجَبَرُوتٍ وَحْدَها ، اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِما تُجِيبُنِى بِهِ  حِينَ أَسْأَلُكَ فَأَجِبْنِى يَا اللّٰهُ.''',
    benefits: "دعاء عظيم الشأن مروي عن الإمام الرضا (عليه السلام) أنه قال: هو الدعاء الذي كان يدعو به الإمام الباقر (عليه السلام) في أسحار شهر رمضان المبارك.",
  ),
  Dua(
    title: "دعاء الحزين",
    text: r'''أُناجِيكَ يا مَوْجُوداً فِي كُلِّ مَكانٍ لَعَلَّكَ تَسْمَعُ نِدائِي، فَقَدْ عَظُمَ جُرْمِي وَقَلَّ حَيائِي، مَوْلايَ يا مَوْلايَ أَيَّ الْأَهْوالِ أَتَذَكَّرُ وَأَيَّها أَنْسَى وَلَوْ لَمْ يَكُنِ إِلاَّ الْمَوْتُ لَكَفى، كَيْفَ وَما بَعْدَ الْمَوْتِ أَعْظَمُ وَأَدْهَى.

مَوْلايَ يا مَوْلايَ حَتَّى مَتَى وَإِلَى مَتَى أَقُولُ لَكَ الْعُتْبَى مَرَّةً بَعْدَ أُخْرَى ثُمَّ لا تَجِدُ عِنْدِي صِدْقاً وَلا وَفاءً فَيا غَوْثاهُ ثُمَّ وَاغَوْثاهُ بِكَ يا اللهُ، مِنْ هَوَىً قَدْ غَلَبَنِي وَمِنْ عَدُوٍّ قَدِ اسْتَكْلَبَ عَلَيَّ وَمِنْ دُنْيا قَدْ تَزَيَّنَتْ لِي، وَمِنْ نَفْسٍ أَمَّارَةٍ بِالسُّوءِ إِلاَّ ما رَحِمَ رَبِّي.

مَوْلايَ يا مَوْلايَ إِنْ كُنْتَ رَحِمْتَ مِثْلِي فَارْحَمْنِي وَإِنْ كُنْتَ قَبِلْتَ مِثْلِي فَاقْبَلْنِي يا قابِلَ السَّحَرَةِ، اقْبَلْنِي يا مَنْ لَمْ أَزَلْ أَتَعَرَّفُ مِنْهُ الْحُسْنَى يا مَنْ يُغَذِّيني بِالنِّعَمِ صَباحاً وَمَساءً، ارْحَمْنِي يَوْمَ آتِيكَ فَرْداً شاخِصاً إِلَيْكَ بَصَرِي مُقَلَّداً عَمَلِي قَدْ تَبَرّأَ جَمِيعُ الْخَلْقِ مِنِّي.

نَعَمْ، وَأَبِي وَأُمّي وَمَنْ كَانَ لَهُ كَدَّي وَسَعْيِي فَإِنْ لَمْ تَرْحَمْنِي فَمَنْ يَرْحَمُنِي، وَمَنْ يُؤْنِسُ فِي الْقَبْرِ وَحْشَتِي، وَمَنْ يُنْطِقُ لِسانِي إِذا خَلَوْتُ بِعَمَلِي وَساءَلْتَنِي عَمَّا أَنْتَ أَعْلَمُ بِهِ مِنِّي، فَإِنْ قُلْتُ نَعَمْ، فَأَيْنَ الْمَهْرَبُ مِنْ عَدْلِكَ، وَإِنْ قُلْتُ لَمْ أَفْعَلْ قُلْتَ أَلَمْ أَكُنِ الشَّاهِدَ عَلَيْكَ.

فَعَفْوُكَ عَفْوُكَ يا مَوْلايَ قَبْلَ سَرابِيلِ الْقَطِرانِ، عَفْوُكَ عَفْوُكَ يا مَوْلايَ قَبْلَ جَهَنَّمَ وَالنِّيْرانِ، عَفْوُكَ عَفْوُكَ يا مَوْلايَ قَبْلَ أَنْ تُغَلَّ الْأَيْدِي إِلَى الْأَعْناقِ، يا أَرْحَمَ الرَّاحِمِينَ وَخَيْرَ الْغافِرِينَ.''',
    benefits: "يستحب قراءته بعد صلاة الليل ويورث الخشوع وتذكر الآخرة وغفران الذنوب.",
  ),
  Dua(
    title: "دعاء يستشير",
    text: r'''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ الْحَمْدُ لِلّٰهِ الَّذِى لَاإِلٰهَ إِلّا هُوَ الْمَلِكُ الْحَقُّ الْمُبِينُ ، الْمُدَبِّرُ بِلا وَزِيرٍ ، وَلَا خَلْقٍ مِنْ عِبادِهِ يَسْتَشِيرُ ، الْأَوَّلُ غَيْرُ مَوْصُوفٍ ، وَالْباقِى بَعْدَ فَناءِ الْخَلْقِ، الْعَظِيمُ الرُّبُوبِيَّةِ ، نُورُ السَّمَاوَاتِ وَالْأَرَضِينَ وَفاطِرُهُما وَمُبْتَدِعُهُما ، بِغَيْرِ عَمَدٍ خَلَقَهُما وَفَتَقَهُما فَتْقاً ، فَقامَتِ السَّمَاوَاتُ طائِعاتٍ بِأَمْرِهِ ، وَاسْتَقَرَّتِ الْأَرَضُونَ بِأَوْتادِها فَوْقَ الْماءِ ، ثُمَّ عَلا رَبُّنا فِى السَّمَاوَاتِ الْعُلىٰ ، ﴿الرَّحْمٰنُ عَلَى الْعَرْشِ اسْتَوىٰ ، لَهُ ما فِى السَّمَاوَاتِ وَما فِى الْأَرْضِ وَما بَيْنَهُما وَما تَحْتَ الثَّرىٰ﴾؛

فَأَنَا أَشْهَدُ بِأَنَّكَ أَنْتَ اللّٰهُ لَارافِعَ لِما وَضَعْتَ ، وَلَا واضِعَ لِما رَفَعْتَ ، وَلَا مُعِزَّ لِمَنْ أَذْلَلْتَ ، وَلَا مُذِلَّ لِمَنْ أَعْزَزْتَ ، وَلَا مانِعَ لِما أَعْطَيْتَ ، وَلَا مُعْطِىَ لِما مَنَعْتَ ،

وَأَنْتَ اللّٰهُ لَاإِلٰهَ إِلّا أَنْتَ ، كُنْتَ إِذْ لَمْ تَكُنْ سَماءٌ مَبْنِيَّةٌ ، وَلَا أَرْضٌ مَدْحِيَّةٌ ، وَلَا شَمْسٌ مُضِيئَةٌ ، وَلَا لَيْلٌ مُظْلِمٌ ، وَلَا نَهارٌ مُضِىءٌ ، وَلَا بَحْرٌ لُجِّيٌّ ، وَلَا جَبَلٌ رَاسٍ  ، وَلَا نَجْمٌ سارٍ ، وَلَا قَمَرٌ مُنِيرٌ ، وَلَا رِيحٌ تَهُبُّ ، وَلَا سَحَابٌ يَسْكُبُ ، وَلَا بَرْقٌ يَلْمَعُ ، وَلَا رَعْدٌ يُسَبِّحُ ، وَلَا رُوحٌ تَنَفَّسُ ، وَلَا طَائِرٌ يَطِيرُ ، وَلَا نَارٌ تَتَوَقَّدُ ، وَلَا ماءٌ يَطَّرِدُ ،

كُنْتَ قَبْلَ كُلِّ شَىْءٍ ، وَكَوَّنْتَ كُلَّ شَىْءٍ ، وَقَدَرْتَ عَلىٰ كُلِّ شَىْءٍ ، وَابْتَدَعْتَ كُلَّ شَىْءٍ ، وَأَغْنَيْتَ وَأَفْقَرْتَ، وَأَمَتَّ وَأَحْيَيْتَ ، وَأَضْحَكْتَ وَأَبْكَيْتَ؛ وَعَلَى الْعَرْشِ اسْتَوَيْتَ ، فَتَبارَكْتَ يَا اللّٰهُ وَتَعالَيْتَ ،

أَنْتَ اللّٰهُ الَّذِى لَاإِلٰهَ إِلّا أَنْتَ الْخَلَّاقُ الْمُعِينُ ، أَمْرُكَ غالِبٌ ، وَعِلْمُكَ نافِذٌ ، وَكَيْدُكَ غَرِيبٌ ، وَوَعْدُكَ صَادِقٌ ، وَقَوْلُكَ حَقٌّ ، وَحُكْمُكَ عَدْلٌ ، وَكَلامُكَ هُدىً ، وَوَحْيُكَ نُورٌ ، وَرَحْمَتُكَ واسِعَةٌ ، وَعَفْوُكَ عَظِيمٌ ، وَفَضْلُكَ كَثِيرٌ ، وَعَطاؤُكَ جَزِيلٌ ، وَحَبْلُكَ مَتِينٌ ، وَ إِمْكانُكَ عَتِيدٌ، وَجَارُكَ عَزِيزٌ ، وَبَأسُكَ شَدِيدٌ ، وَمَكْرُكَ مَكِيدٌ ،

أَنْتَ يَا رَبِّ مَوْضِعُ كُلِّ شَكْوىٰ؛ وَحاضِرُ كُلِّ مَلَاً ، وَ شاهِدُ كُلِّ نَجْوىٰ ، مُنْتَهىٰ كُلِّ حاجَةٍ ، مُفَرِّجُ كُلِّ حُزْنٍ  ، غِنىٰ كُلِّ مِسْكِينٍ ، حِصْنُ كُلِّ هَارِبٍ ، أَمانُ كُلِّ خَائِفٍ ، حِرْزُ الضُّعَفاءِ ، كَنْزُ الْفُقَرَاءِ ، مُفَرِّجُ الْغَمَّاءِ ، مُعِينُ الصَّالِحِينَ ، ذٰلِكَ اللّٰهُ رَبُّنا لَاإِلٰهَ إِلّا هُوَ ،

تَكْفِى مِنْ عِبادِكَ مَنْ تَوَكَّلَ عَلَيْكَ ، وَأَنْتَ جَارُ مَنْ لاذَبِكَ وَتَضَرَّعَ إِلَيْكَ ، عِصْمَةُ مَنِ اعْتَصَمَ بِكَ ، ناصِرُ مَنِ انْتَصَرَ بِكَ ، تَغْفِرُ الذُّنُوبَ لِمَنِ اسْتَغْفَرَكَ ، جَبَّارُ الْجَبَابِرَةِ ، عَظِيمُ الْعُظَمَاءِ؛ كَبِيرُ الْكُبَراءِ ، سَيِّدُ السَّادَاتِ ، مَوْلَى الْمَوَالِى ، صَرِيخُ المُسْتَصْرِخِينَ ، مُنَفِّسٌ عَنِ الْمَكْرُوبِينَ ، مُجِيبُ دَعْوَةِ الْمُضْطَرِّينَ ، أَسْمَعُ السَّامِعِينَ ، أَبْصَرُ النَّاظِرِينَ ، أَحْكَمُ الْحَاكِمِينَ ، أَسْرَعُ الْحَاسِبِينَ ، أَرْحَمُ الرَّاحِمِينَ ، خَيْرُ الْغَافِرِينَ ، قَاضِى حَوائِجِ الْمُؤْمِنِينَ ، مُغِيثُ الصَّالِحِينَ ،

أَنْتَ اللّٰهُ لَاإِلٰهَ إِلّا أَنْتَ رَبُّ الْعالَمِينَ ، أَنْتَ الْخالِقُ وَأَنَا الْمَخْلُوقُ ، وَأَنْتَ الْمَالِكُ وَأَنَا الْمَمْلُوكُ ، وَأَنْتَ الرَّبُّ وَأَنَا الْعَبْدُ ، وَأَنْتَ الرَّازِقُ وَأَنَا الْمَرْزُوقُ؛ وَأَنْتَ الْمُعْطِى وَأَنَا السَّائِلُ ، وَأَنْتَ الْجَوادُ وَأَنَا الْبَخِيلُ ، وَأَنْتَ الْقَوِىُّ وَأَنَا الضَّعِيفُ ، وَأَنْتَ الْعَزِيزُ وَأَنَا الذَّلِيلُ ، وَأَنْتَ الْغَنِىُّ و أَنَا الْفَقِيرُ ، وَأَنْتَ السَّيِّدُ وَأَنَا الْعَبْدُ ، وَأَنْتَ الْغافِرُ وَأَنَا الْمُسِىءُ ،وَأَنْتَ الْعَالِمُ وَأَنَا الْجَاهِلُ ، وَأَنْتَ الْحَلِيمُ وَأَنَا الْعَجُولُ ، وَأَنْتَ الرَّحْمٰنُ وَأَنَا الْمَرْحُومُ ، وَأَنْتَ الْمُعافِى وَأَنَا الْمُبْتَلىٰ ، وَأَنْتَ الْمُجِيبُ وَأَنَا الْمُضْطَرُّ ،

وَ أَنَا أَشْهَدُ بِأَنَّكَ أَنْتَ اللّٰهُ لَاإِلٰهَ إِلّا أَنْتَ ، الْمُعْطِى عِبادَكَ بِلا سُؤالٍ؛ وَأَشْهَدُ بِأَنَّكَ أَنْتَ اللّٰهُ الْواحِدُ الْأَحَدُ الْمُتَفَرِّدُ الصَّمَدُ الْفَرْدُ وَ إِلَيْكَ الْمَصِيرُ ، وَصَلَّى اللّٰهُ عَلىٰ مُحَمَّدٍ وَأَهْلِ بَيْتِهِ الطَّيِّبِينَ الطَّاهِرِينَ ، وَاغْفِرْ لِى ذُنُوبِى ، وَاسْتُرْ عَلَىَّ عُيُوبِى، وَافْتَحْ لِى مِنْ لَدُنْكَ رَحْمَةً وَرِزْقاً وَاسِعاً يَا أَرْحَمَ الرَّاحِمِينَ ، وَالْحَمْدُ لِلّٰهِ رَبِّ الْعالَمِينَ، وَحَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيلُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلّا بِاللّٰهِ الْعَلِيِّ الْعَظِيمِ.''',
    benefits: "رواه السيد ابن طاووس في (مهج الدعوات) عن أمير المؤمنين (عليه السلام) عن رسول الله (صلى الله عليه وآله وسلم) أنه علمه هذا الدعاء وأمره بقراءته في الشدة والرخاء.",
  ),
  Dua(
    title: "دعاء التوبة",
    text: r'''اللَّهُمَّ يَا مَنْ لَا يَصِفُهُ نَعْتُ الْوَاصِفِينَ، وَيَا مَنْ لَا يُجَاوِزُهُ رَجَاءُ الرَّاجِينَ، وَيَا مَنْ لَا يَضِيعُ لَدَيْهِ أَجْرُ الْمُحْسِنِينَ، وَيَا مَنْ هُوَ مُنْتَهَى خَوْفِ الْعَابِدِينَ، وَيَا مَنْ هُوَ غَايَةُ خَشْيَةِ الْمُتَّقِينَ.

هَذَا مَقَامُ مَنْ تَدَاوَلَتْهُ أَيْدِي الذُّنُوبِ، وَقَادَتْهُ أَزِمَّةُ الْخَطَايَا، وَاسْتَحْوَذَ عَلَيْهِ الشَّيْطَانُ، فَقَصَّرَ عَمَّا أَمَرْتَ بِهِ تَفْرِيطاً، وَتَعَاطَى مَا نَهَيْتَ عَنْهُ تَعْزِيراً، كَالْجَاهِلِ بِقُدْرَتِكَ عَلَيْهِ، أَوْ كَالْمُنْكِرِ فَضْلَ إِحْسَانِكَ إِلَيْهِ، حَتَّى إِذَا انْفَتَحَ لَهُ بَصَرُ الْهُدَى، وَتَقَشَّعَتْ عَنْهُ سَحَائِبُ الْعَمَى، أَحْصَى مَا ظَلَمَ بِهِ نَفْسَهُ، وَفَكَّرَ فِيمَا خَالَفَ بِهِ رَبَّهُ، فَرَأَى كَبِيرَ عِصْيَانِهِ كَبِيراً، وَجَلِيلَ مُخَالَفَتِهِ جَلِيلاً، فَأَقْبَلَ نَحْوَكَ مُؤَمِّلًا لَكَ مُسْتَحْيِياً مِنْكَ، وَوَجَّهَ رَغْبَتَهُ إِلَيْكَ ثِقَةً بِكَ، فَأَمَّكَ بِطَمَعِهِ يَقِيناً، وَقَصَدَكَ بِخَوْفِهِ إِخْلَاصاً، قَدْ خَلَا طَمَعُهُ مِنْ كُلِّ مَطْمُوعٍ فِيهِ غَيْرِكَ، وَأَفْرَخَ رَوْعُهُ مِنْ كُلِّ مَحْذُورٍ مِنْهُ سِوَاكَ، فَمَثَّلَ بَيْنَ يَدَيْكَ مُتَضَرِّعاً، وَغَمَّضَ بَصَرَهُ إِلَى الْأَرْضِ مُتَخَشِّعاً، وَطَأْطَأَ رَأْسَهُ لِعِزَّتِكَ مُتَذَلِّلًا، وَأَبَثَّكَ مِنْ سِرِّهِ مَا أَنْتَ أَعْلَمُ بِهِ مِنْهُ خُضُوعاً، وَعَدَّدَ مِنْ ذُنُوبِهِ مَا أَنْتَ أَحْصَى لَهَا خُشُوعاً، وَاسْتَغَاثَ بِكَ مِنْ عَظِيمِ مَا وَقَعَ بِهِ فِي عِلْمِكَ، وَقَبِيحِ مَا فَضَحَهُ فِي حُكْمِكَ، مِنْ ذُنُوبٍ أَدْبَرَتْ لَذَّاتُهَا فَذَهَبَتْ، وَأَقَامَتْ تَبِعَاتُهَا فَلَزِمَتْ.

لَا يُنْكِرُ يَا إِلَهِي عَدْلَكَ إِنْ عَاقَبْتَهُ، وَلَا يَسْتَعْظِمُ عَفْوَكَ إِنْ عَفَوْتَ عَنْهُ وَرَحِمْتَهُ، لِأَنَّكَ الرَّبُّ الْكَرِيمُ الَّذِي لَا يَتَعَاظَمُهُ غُفْرَانُ الذَّنْبِ الْعَظِيمِ.

اللَّهُمَّ فَهَا أَنَا ذَا قَدْ جِئْتُكَ مُطِيعاً لِأَمْرِكَ فِيمَا أَمَرْتَ بِهِ مِنَ الدُّعَاءِ، مُتَنَجِّزاً وَعْدَكَ فِيمَا وَعَدْتَ بِهِ مِنَ الْإِجَابَةِ، إِذْ تَقُولُ: «ادْعُونِي أَسْتَجِبْ لَكُمْ».

اللَّهُمَّ فصَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَالْقَنِي بِمَغْفِرَتِكَ كَمَا لَقِيتُكَ بِإِقْرَارِي، وَارْفَعْنِي عَنْ مَصَارِعِ الذُّنُوبِ كَمَا وَضَعْتُ لَكَ نَفْسِي، وَاسْتُرْنِي بِسِتْرِكَ كَمَا تَأَنَّيْتَنِي عَنِ الِانْتِقَامِ مِنِّي.

اللَّهُمَّ وَثَبِّتْ فِي طَاعَتِكَ نِيَّتِي، وَأَحْكِمْ فِي عِبَادَتِكَ بَصِيرَتِي، وَوَفِّقْنِي مِنَ الْأَعْمَالِ لِمَا تَغْسِلُ بِهِ دَنَسَ الْخَطَايَا عَنِّي، وَتَوَفَّنِي عَلَى مِلَّتِكَ وَمِلَّةِ نَبِيِّكَ مُحَمَّدٍ عَلَيْهِ السَّلَامُ إِذَا تَوَفَّيْتَنِي.

اللَّهُمَّ إِنِّي أَتُوبُ إِلَيْكَ فِي مَقَامِي هَذَا مِنْ كَبَائِرِ ذُنُوبِي وَصَغَائِرِهَا، وَبَوَاطِنِ سَيِّئَاتِي وَظَوَاهِرِهَا، وَسَالِفِ زَلَّاتِي وَحَادِثَاتِهَا، تَوْبَةَ مَنْ لَا يُحَدِّثُ نَفْسَهُ بِمَعْصِيَةٍ، وَلَا يُضْمِرُ أَنْ يَعُودَ فِي خَطِيئَةٍ، وَقَدْ قُلْتَ يَا إِلَهِي فِي مُحْكَمِ كِتَابِكَ: إِنَّكَ تَقْبَلُ التَّوْبَةَ عَنْ عِبَادِكَ، وَتَعْفُو عَنِ السَّيِّئَاتِ، وَتُحِبُّ التَّوَّابِينَ، فَاقْبَلْ تَوْبَتِي كَمَا وَعَدْتَ، وَاعْفُ عَنْ سَيِّئَاتِي كَمَا ضَمِنْتَ، وَأَوْجِبْ لِي مَحَبَّتَكَ كَمَا شَرَطْتَ، وَلَكَ يَا رَبِّ شَرْطِي أَلَّا أَعُودَ فِي مَكْرُوهِكَ، وَضَمَانِي أَلَّا أَرْجِعَ فِي مَذْمُومِكَ، وَعَهْدِي أَنْ أَهْجُرَ جَمِيعَ مَعَاصِيكَ.

اللَّهُمَّ إِنَّكَ أَعْلَمُ بِمَا عَمِلْتُ، فَاغْفِرْ لِي مَا عَلِمْتَ، وَاصْرِفْنِي بِقُدْرَتِكَ إِلَى مَا أَحْبَبْتَ.

اللَّهُمَّ وَعَلَيَّ تَبِعَاتٌ قَدْ حَفِظْتُهُنَّ، وَتَبِعَاتٌ قَدْ نَسِيتُهُنَّ، وَكُلُّهُنَّ بِعَيْنِكَ الَّتِي لَا تَنَامُ، وَعِلْمِكَ الَّذِي لَا يَنْسَى، فَعَوِّضْ مِنْهَا أَهْلَهَا، وَاحْطُطْ عَنِّي وِزْرَهَا، وَخَفِّفْ عَنِّي ثِقْلَهَا، وَاعْصِمْنِي مِنَ مُقَارَفَةِ رِيبَتِهَا.

اللَّهُمَّ وَإِنِّي أَتُوبُ إِلَيْكَ مِنْ كُلِّ مَا خَالَفَ إِرَادَتَكَ، أَوْ زَالَ عَنْ مَحَبَّتِكَ مِنْ خَطَرَاتِ قَلْبِي، وَحَرَكَاتِ جَوَارِحِي، وَنَظَرَاتِ عَيْنِي، وَحَكَمَاتِ لِسَانِي، تَوْبَةً تَسْلَمُ بِهَا كُلِّ جَارِحَةٍ عَلَى حِيَالِهَا مِنْ تَبِعَاتِكَ، وَتَأْمَنُ مِمَّا يَخَافُ الْمُعْتَدُونَ مِنْ أَلِيمِ سَطَوَاتِكَ.

اللَّهُمَّ فَارْحَمْ وَحْدَتِي بَيْنَ يَدَيْكَ، وَوَجِيبَ قَلْبِي مِنْ خَشْيَتِكَ، وَاضْطِرَابَ أَرْكَانِي مِنْ هَيْبَتِكَ، فَقَدْ أَقَامَتْنِي يَا رَبِّ ذُنُوبِي مَقَامَ الْخِزْيِ بِفِنَائِكَ، فَإِنْ سَكَتُّ لَمْ يَنْطِقْ عَنِّي أَحَدٌ، وَإِنْ شَفَعْتُ فَلَسْتُ بِأَهْلِ الشَّفَاعَةِ.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَشَفِّعْ فِي خَطَايَايَ كَرَمَكَ، وَعُدْ عَلَى سَيِّئَاتِي بِعَفْوِكَ، وَلَا تَجْزِنِي جَزَائِي مِنَ الْعُقُوبَةِ، وَابْسُطْ عَلَيَّ طَوْلَكَ، وَجَلِّلْنِي بِرَحْمَتِكَ، وَتَجَافَ عَنِّي بِعَفْوِكَ، فَلَا إِغْنَاءَ بِي عَنْ عَفْوِكَ.

اللَّهُمَّ وَأَنَا التَّائِهُ الَّذِي رَدَدْتَهُ، وَالْخَاطِئُ الَّذِي أَمْهَلْتَهُ، وَالْمُسِي‏ءُ الَّذِي اسْتَعْتَبْتَهُ، فَصَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَلَا تَجْعَلْنِي لِعِقَابِكَ نَصِيلاً، وَلَا لِمَكْرُوبِكَ قَبِيلاً، وَاجْعَلْنِي مِنْ أَكْثَرِ عِبَادِكَ إِلَيْكَ نَصِيباً فِي كُلِّ خَيْرٍ أَنْزَلْتَهُ أَوْ تُنْزِلُهُ، أَوْ إِحْسَانٍ عَجَّلْتَهُ أَوْ تُؤَخِّرُهُ، يَا كَرِيمَ الْعَفْوِ، يَا حَسَنَ التَّجَاوُزِ.

اللَّهُمَّ وَلَا تُخْلِ سَبِيلِي مِنِ افْتِقَارِي إِلَيْكَ، وَلَا تَقْطَعْ عَنِّي خَيْرَكَ، وَلَا تَحْرِمْنِي لُطْفَكَ، وَلَا تَمْنَعْنِي رِفْدَكَ، وَلَا تُعْرِضْ عَنِّي بِمَا لَا يُطِيقُ الْعَبْدُ الْحَمْلَ عَلَيْهِ، وَلَا تَصْرِفْ عَنِّي فَضْلَكَ، وَلَا تُبَاعِدْنِي مِنْ قُرْبِكَ، وَلَا تَقْطَعْنِي عَنْ جَنَابِكَ.

اللَّهُمَّ وَصَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَأَعِنِّي عَلَى التَّوْبَةِ، وَوَفِّقْنِي لَهَا، وَاقْبَلْهَا مِنِّي، وَأَقِلْنِي عَثْرَتِي، وَاسْتُرْنِي بِسِتْرِكَ، وَاعْفُ عَنِّي، وَاجْعَلْنِي مِنْ أَهْلِ التَّوْبَةِ الَّذِينَ تُحِبُّهُمْ وَتُحِبُّهُمْ.

يَا سَمِيعَ الدُّعَاءِ، يَا قَبُولَ التَّائِبِينَ، يَا أَرْحَمَ الرَّاحِمِينَ''',
    benefits: "الدعاء الحادي والثلاثون من الصحيفة السجادية في طلب التوبة والاستغفار والرجوع إلى الله عز وجل.",
  ),
  Dua(
    title: "دعاء العشرات",
    text: r'''بِسْمِ اللّهِ الرَّحْمنِ الرَّحِيمِ سُبْحانَ اللّٰهِ وَالْحَمْدُ لِلّٰهِ وَلَا إِلٰهَ إِلّا اللّٰهُ وَاللّٰهُ أَكْبَرُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلّا بِاللّٰهِ الْعَلِيِّ الْعَظِيمِ ، سُبْحانَ اللّٰهِ آناءَ اللَّيْلِ وَأَطْرافَ النَّهارِ ، سُبْحانَ اللّٰهِ بِالْغُدُوِّ وَالْآصالِ ، سُبْحانَ اللّٰهِ بالْعَشِيِّ وَالْإِبْكارِ ،

﴿سُبْحانَ اللّٰهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ ، وَلَهُ الْحَمْدُ فِى السَّماواتِ وَالْأَرْضِ وَعَشِيّاً وَحِينَ تُظْهِرُونَ ، يُخْرِجُ الْحَىَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ ، وَيُحْيِي الْأَرْضَ بَعْدَ مَوْتِها وَكَذَلِكَ تُخْرَجُونَ﴾، ﴿سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ ، وَسَلامٌ عَلَى الْمُرْسَلِينَ وَالْحَمْدُ لِلّٰهِ رَبِّ الْعالَمِينَ﴾؛

سُبْحانَ ذِى الْمُلْكِ وَالْمَلَكُوتِ ، سُبْحانَ ذِى الْعِزَّةِ وَالْجَبَرُوتِ ، سُبْحانَ ذِى الْكِبْرِياءِ وَالْعَظَمَةِ الْمَلِكِ الْحَقِّ المُهَيْمِنِ الْمُبِينِ القُدُّوسِ ، سُبْحانَ اللّٰهِ الْمَلِكِ الْحَيِّ الَّذِي لَايَمُوتُ ، سُبْحانَ اللّٰهِ الْمَلِكِ الْحَيِّ الْقُدُّوسِ ، سُبْحانَ الْقائِمِ الدَّائِمِ ، سُبْحانَ الدَّائِمِ الْقائِمِ ،

سُبْحانَ رَبِّىَ الْعَظِيمِ ، سُبْحانَ رَبِّىَ الْأَعْلىٰ ، سُبْحانَ الْحَيِّ الْقَيُّومِ ، سُبْحانَ الْعَلِيِّ الْأَعْلىٰ ، سُبْحانَهُ وَتَعالىٰ ، سُبُّوحٌ قُدُّوسٌ رَبُّنا وَرَبُّ الْمَلائِكَةِ وَالرُّوحِ؛ سُبْحانَ الدَّائِمِ غَيْرِ الْغافِلِ ، سُبْحانَ الْعالِمِ بِغَيْرِ تَعْلِيمٍ ، سُبْحانَ خالِقِ مَا يُرىٰ وَمَا لَايُرىٰ ، سُبْحانَ الَّذِى يُدْرِكُ الْأَبْصارَ وَلَا تُدْرِكُهُ الْأَبْصارُ ، وَهُوَ اللَّطِيفُ الْخَبِيرُ .

اللّٰهُمَّ إِنِّى أَصْبَحْتُ مِنْكَ فِى نِعْمَةٍ وَخَيْرٍ وَبَرَكَةٍ وَعافِيَةٍ ، فَصَلِّ عَلىٰ مُحَمَّدٍ وَآلِهِ وَأَتْمِمْ عَلَىَّ نِعْمَتَكَ وَخَيْرَكَ وَبَرَكَاتِكَ وَعافِيَتَكَ بِنَجاةٍ مِنَ النَّارِ ، وَارْزُقْنِى شُكْرَكَ وَعافِيَتَكَ وَفَضْلَكَ وَكَرامَتَكَ أَبَداً ما أَبْقَيْتَنِى . اللّٰهُمَّ بِنُورِكَ اهْتَدَيْتُ ، وَبِفَضْلِكَ اسْتَغْنَيْتُ ، وَبِنِعْمَتِكَ أَصْبَحْتُ وَأَمْسَيْتُ؛

اللّٰهُمَّ إِنِّى أُشْهِدُكَ وَكَفىٰ بِكَ شَهِيداً ، وَأُشْهِدُ مَلائِكَتَكَ وَأَنْبِياءَكَ وَرُسُلَكَ ، وَحَمَلَةَ عَرْشِكَ ، وَسُكّانَ سَماواتِكَ وَأَرْضِكَ  وَجَمِيعَ خَلْقِكَ ، بِأَنَّكَ أَنْتَ اللّٰهُ لَاإِلٰهَ إِلّا أَنْتَ ، وَحْدَكَ لَاشَرِيكَ لَكَ ، وَأَنَّ مُحَمَّداً صَلَّى اللّٰهُ عَلَيْهِ وَ آلِهِ عَبْدُكَ وَرَسُولُكَ ، وَأَنَّكَ عَلىٰ كُلِّ شَىْءٍ قَدِيرٌ ، تُحْيِى وَتُمِيتُ ، وَتُمِيتُ وَتُحْيِى ، وَأَشْهَدُ أَنَّ الْجَنَّةَ حَقٌّ ، وَأَنَّ النَّارَ حَقٌّ ، وَالنُّشُورَ  حَقٌّ ، وَالسَّاعَةَ آتِيَةٌ لَارَيْبَ فِيها ، وَأَنَّ اللّٰهَ يَبْعَثُ مَنْ فِى الْقُبُورِ؛

وَأَشْهَدُ أَنَّ عَلِىَّ بْنَ أَبِى طَالِبٍ أَمِيرُ الْمُؤْمِنِينَ حَقّاً حَقّاً ، وَأَنَّ الْأَئِمَّةَ مِنْ وُلْدِهِ هُمُ الْأَئِمَّةُ الْهُداةُ الْمَهْدِيُّونَ ، غَيرُ الضَّالِّينَ وَلَا الْمُضِلِّينَ ، وَأَنَّهُمْ أَوْلِياؤُكَ الْمُصْطَفَونَ ، وَحِزْبُكَ الْغالِبُونَ ، وَصِفْوَتُكَ وَخِيَرَتُكَ مِنْ خَلْقِكَ ، وَنُجَبَاؤُكَ الَّذِينَ انْتَجَبْتَهُمْ لِدِينِكَ ، وَاخْتَصَصْتَهُمْ مِنْ خَلْقِكَ ، وَاصْطَفَيْتَهُمْ عَلىٰ عِبادِكَ ، وَجَعَلْتَهُمْ حُجَّةً عَلَى الْعالَمِينَ ، صَلَواتُكَ عَلَيْهِمْ وَالسَّلامُ وَرَحْمَةُ اللّٰهِ وَبَرَكاتُهُ؛

اللّٰهُمَّ اكْتُبْ لِى هٰذِهِ الشَّهادَةَ عِنْدَكَ حَتّىٰ تُلَقِّنَنِيها يَوْمَ الْقِيامَةِ وَأَنْتَ عَنِّى راضٍ ، إِنَّكَ عَلىٰ ما تَشاءُ قَدِيرٌ . اللّٰهُمَّ لَكَ الْحَمْدُ حَمْداً يَصْعَدُ أَوَّلُهُ وَلَا يَنْفَدُ آخِرُهُ ، اللّٰهُمَّ لَكَ الْحَمْدُ حَمْداً تَضَعُ لَكَ السَّماءُ كَنَفَيْها  ، وَتُسَبِّحُ لَكَ الْأَرْضُ وَمَنْ عَلَيْها .

اللّٰهُمَّ لَكَ الْحَمْدُ حَمْداً سَرْمَداً أَبَداً لَاانْقِطاعَ لَهُ وَلَا نَفادَ وَلَكَ يَنْبَغِى وَ إِلَيْكَ يَنْتَهِى ، فِىَّ وَعَلَىَّ وَلَدَىَّ وَمَعِى وَقَبْلِى وَبَعْدِى وَأَمامِى وَفَوْقِى وَتَحْتِى ، وَ إِذا مِتُّ وَبَقِيتُ فَرْداً وَحِيداً ثُمَّ فَنِيتُ؛ وَلَكَ الْحَمْدُ إِذا نُشِرْتُ وَبُعِثْتُ ، يَا مَوْلاىَ .

اللّٰهُمَّ وَلَكَ الْحَمْدُ وَلَكَ  الشُّكْرُ بِجَمِيعِ مَحامِدِكَ كُلِّها عَلىٰ جَمِيعِ نَعْمائِكَ كُلِّها ، حَتَّىٰ يَنْتَهِىَ الْحَمْدُ إِلىٰ مَا تُحِبُّ رَبَّنا وَتَرْضىٰ . اللّٰهُمَّ لَكَ الْحَمْدُ عَلَىٰ كُلِّ أَكْلَةٍ وَشَرْبَةٍ وَبَطْشَةٍ وَقَبْضَةٍ وَبَسْطَةٍ ، وَفِى كُلِّ مَوْضِعِ شَعْرَةٍ .

اللّٰهُمَّ لَكَ الْحَمْدُ حَمْداً خالِداً مَعَ خُلُودِكَ ، وَلَكَ الْحَمْدُ حَمْداً لَامُنْتَهىٰ لَهُ دُونَ عِلْمِكَ ، وَلَكَ الْحَمْدُ حَمْداً لَاأَمَدَ لَهُ دُونَ مَشِيَّتِكَ ، وَلَكَ الْحَمْدُ حَمْداً لَا أَجْرَ لِقائِلِهِ إِلّا رِضاكَ ، وَلَكَ الْحَمْدُ عَلىٰ حِلْمِكَ بَعْدَ عِلْمِكَ؛ وَلَكَ الْحَمْدُ عَلىٰ عَفْوِكَ بَعْدَ قُدْرَتِكَ ،

وَلَكَ الْحَمْدُ باعِثَ الْحَمْدِ ، وَلَكَ الْحَمْدُ وارِثَ الْحَمْدِ ، وَلَكَ الْحَمْدُ بَدِيعَ الْحَمْدِ ، وَلَكَ الْحَمْدُ مُنْتَهَى الْحَمْدِ ، وَلَكَ الْحَمْدُ مُبْتَدِعَ الْحَمْدِ ، وَلَكَ الْحَمْدُ مُشْتَرِىَ الْحَمْدِ ، وَلَكَ الْحَمْدُ وَلِىَّ الْحَمْدِ ، وَلَكَ الْحَمْدُ قَدِيمَ الْحَمْدِ ، وَلَكَ الْحَمْدُ صَادِقَ الْوَعْدِ ، وَفِىَّ الْعَهْدِ ، عَزِيزَ الْجُنْدِ ، قَائِمَ الْمَجْدِ ، وَلَكَ الْحَمْدُ رَفِيعَ الدَّرَجاتِ ، مُجِيبَ الدَّعَواتِ ، مُنْزِلَ الْآياتِ مِنْ فَوْقِ سَبْعِ سَمَاواتٍ؛ عَظِيمَ الْبَرَكاتِ ، مُخْرِجَ النُّورِ مِنَ الظُّلُماتِ ، وَمُخْرِجَ مَنْ فِى الظُّلُماتِ إِلَى النُّورِ ، مُبَدِّلَ السَّيِّئاتِ حَسَناتٍ ، وَجاعِلَ الْحَسَناتِ دَرَجَاتٍ .

اللّٰهُمَّ لَكَ الْحَمْدُ غَافِرَ الذَّنْبِ ، وَقَابِلَ التَّوْبِ ، شَدِيدَ الْعِقابِ ذَا الطَّوْلِ  ، لَاإِلٰهَ إِلّا أَنْتَ إِلَيْكَ الْمَصِيرُ . اللّٰهُمَّ لَكَ الْحَمْدُ فِى اللَّيْلِ إِذا يَغْشىٰ ، وَلَكَ الْحَمْدُ فِى النَّهارِ إِذا تَجَلّىٰ ، وَلَكَ الْحَمْدُ فِى الْآخِرَةِ وَالْأُولىٰ ، وَلَكَ الْحَمْدُ عَدَدَ كُلِّ نَجْمٍ وَمَلَكٍ فِى السَّمَاءِ ، وَلَكَ الْحَمْدُ عَدَدَ الثَّرَىٰ وَالْحَصىٰ وَالنَّوَىٰ ، وَلَكَ الْحَمْدُ عَدَدَ ما فِى جَوِّ السَّماءِ ، وَلَكَ الْحَمْدُ عَدَدَ ما فِى جَوْفِ الْأَرْضِ؛

وَلَكَ الْحَمْدُ عَدَدَ أَوْزانِ مِياهِ الْبِحارِ ، وَلَكَ الْحَمْدُ عَدَدَ أَوْراقِ الْأَشْجارِ ، وَلَكَ الْحَمْدُ عَدَدَ ما عَلىٰ وَجْهِ الْأَرْضِ ، وَلَكَ الْحَمْدُ عَدَدَ مَا أَحْصىٰ كِتابُكَ ، وَلَكَ الْحَمْدُ عَدَدَ ما أَحاطَ بِهِ عِلْمُكَ ، وَلَكَ الْحَمْدُ عَدَدَ الْإِنْسِ وَالْجِنِّ ، وَالْهَوامِّ وَالطَّيْرِ وَالْبَهائِمِ وَالسِّباعِ ، حَمْداً كَثِيراً طَيِّباً مُبارَكاً فِيهِ كَما تُحِبُّ رَبَّنا وَتَرْضىٰ ، وَكَما يَنْبَغِى لِكَرَمِ وَجْهِكَ وَعِزِّ جَلالِكَ.

لَاإِلٰهَ إِلّا اللّٰهُ وَحْدَهُ لَاشَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ، وَهُوَ اللَّطِيفُ الْخَبِيرُ.

لَاإِلٰهَ إِلّا اللّٰهُ وَحْدَهُ لَاشَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ، يُحْيِى وَيُمِيتُ ، وَيُمِيتُ وَيُحْيِى وَهُوَ حَيٌّ لَايَمُوتُ ، بِيَدِهِ الْخَيْرُ وَهُوَ عَلىٰ كُلِّ شَىْءٍ قَدِيرٌ.

أَسْتَغْفِرُ اللّٰهَ الَّذِى لَاإِلٰهَ إِلّا هُوَ الْحَىُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ.

يَا اللّهُ يَا اللّهُ

يَا رَحْمَانُ يَا رَحْمَانُ

يَا رَحِيمُ يَا رَحِيمُ

يَا بَدِيعَ السَّمَاوَاتِ وَ الْأَرْضِ

يَا ذَا الْجَلالِ وَ الْإِكْرَامِ

يَا حَنَّانُ يَا مَنَّانُ

يَا حَيُّ يَا قَيُّومُ

يَا حَيُّ لا إِلهَ إِلّا أَنْتَ

يَا اللّهُ يَا لا إِلهَ إِلّا أَنْتَ

بِسْمِ اللّهِ الرَّحْمنِ الرَّحِيمِ

اَللّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ

اَللّهُمَّ افْعَلْ بِي مَا أَنْتَ أَهْلُهُ

آمِينَ آمِينَ

اللّٰهُمَّ اصْنَعْ بِى ما أَنْتَ أَهْلُهُ ، وَلَا تَصْنَعْ بِى ما أَنَا أَهْلُهُ ، فَإِنَّكَ أَهْلُ التَّقْوىٰ وَأَهْلُ الْمَغْفِرَةِ ، وَأَنَا أَهْلُ الذُّنُوبِ وَالْخَطايا ، فَارْحَمْنِى يَا مَوْلاىَ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ.

لَاحَوْلَ وَلَا قُوَّةَ إِلّا بِاللّٰهِ ، تَوَكَّلْتُ عَلَى الْحَيِّ الَّذِي لَايَمُوتُ ، وَالْحَمْدُ لِلّٰهِ الَّذِي لمْ يَتَّخِذْ وَلَداً ، وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِى الْمُلْكِ ، وَلَمْ يَكُنْ لَهُ وَ لِيٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبِيراً.''',
    benefits: "دعاء عظيم الشأن مروي في (مصباح المتهجد) للشيخ الطوسي، ويُستحب قراءته صباحاً ومساءً، وأفضل أوقاته في عصر يوم الجمعة.",
  ),
  Dua(
    title: "حديث الكساء",
    text: r'''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

عَنْ فاطِمَةَ الزَّهْراءِ عَلَيهَا السَّلامُ بِنْتِ رَسُولِ اللَّهِ صَلَّي اللَّهُ عَلَيهِ وَآلِهِ قالَ سَمِعْتُ فاطِمَةَ اَنَّها قالَتْ دَخَلَ عَلَيَّ اَبي رَسُولُ اللَّهِ في بَعْضِ الْأَيَّامِ، فَقالَ السَّلامُ عَلَيْكِ يا فاطِمَةُ، فَقُلْتُ عَلَيْكَ السَّلامُ قالَ اِنّي اَجِدُ في بَدَني ضُعْفاً، فَقُلْتُ لَهُ اُعيذُكَ بِاللَّهِ يا اَبَتاهُ مِنَ الضُّعْفِ، فَقَالَ يا فاطِمَةُ ايتيني بِالْكِسآءِ الْيَماني فَغَطّيني بِهِ، فَاَتَيْتُهُ بِالْكِسآءِ الْيَماني فَغَطَّيْتُهُ بِهِ، وَصِرْتُ اَنْظُرُ اِلَيْهِ، وَاِذا وَجْهُهُ يَتَلَأْلَؤُ كَاَنَّهُ الْبَدْرُ في لَيْلَةِ تَمامِهِ وَكَمالِهِ

فَما كانَتْ اِلاَّ ساعَةً وَاِذا بِوَلَدِيَ الْحَسَنِ قَدْ اَقْبَلَ، وَقالَ السَّلامُ عَلَيْكِ يا اُمَّاهُ، فَقُلْتُ وَعَلَيْكَ السَّلامُ يا قُرَّةَ عَيْني وَثَمَرَةَ فُؤادي، فَقالَ يا اُمَّاهُ اِنّي اَشَمُّ عِنْدَكِ رآئِحَةً طَيِّبَةً، كَاَنَّها رآئِحَةُ جَدّي رَسُولِ اللَّهِ، فَقُلْتُ نَعَمْ اِنَّ جَدَّكَ تَحْتَ الْكِسآءِ، فَاَقْبَلَ الْحَسَنُ نَحْوَ الْكِسآءِ، وَقالَ السَّلامُ عَلَيْكَ يا جَدَّاهُ يا رَسُولَ اللَّهِ، اَتَاْذَنُ لي اَنْ اَدْخُلَ مَعَكَ تَحْتَ الْكِسآءِ، فَقالَ وَعَلَيْكَ السَّلامُ يا وَلَدي وَيا صاحِبَ حَوْضي، قَدْ اَذِنْتُ لَكَ، فَدَخَلَ مَعَهُ تَحْتَ الْكِسآءِ،

فَما كانَتْ اِلاَّ ساعَةً وَاِذا بِوَلَدِيَ الْحُسَيْنِ قَدْ اَقْبَلَ، وَقالَ السَّلامُ عَلَيْكِ يا اُمَّاهُ، فَقُلْتُ وَعَلَيْكَ السَّلامُ يا وَلَدي وَيا قُرَّةَ عَيْني وَثَمَرَةَ فُؤادي، فَقالَ لي يا اُمَّاهُ اِنّي اَشَمُّ عِنْدَكِ رآئِحَةً طَيِّبَةً، كَاَنَّها رآئِحَةُ جَدّي رَسُولِ اللَّهِ صَلَّي اللَّهُ عَلَيْهِ وَآلِهِ فَقُلْتُ نَعَمْ اِنَّ جَدَّكَ وَاَخاكَ تَحْتَ الْكِسآءِ، فَدَنَي الْحُسَيْنُ نَحْوَ الْكِسآءِ، وَقالَ السَّلامُ عَلَيْكَ يا جَدَّاهُ، اَلسَّلامُ عَلَيْكَ يا مَنِ اخْتارَهُ اللَّهُ، اَتَاْذَنُ لي اَنْ اَكُونَ مَعَكُما تَحْتَ الْكِسآءِ، فَقالَ وَعَلَيْكَ السَّلامُ يا وَلَدي وَيا شافِعَ اُمَّتي، قَدْ اَذِنْتُ لَكَ فَدَخَلَ مَعَهُما تَحْتَ الْكِسآءِ

فَاَقْبَلَ عِنْدَ ذلِكَ اَبُوالْحَسَنِ عَلِيُّ بْنُ اَبي طالِبٍ، وَقالَ السَّلامُ عَلَيْكِ يا بِنْتَ رَسُولِ اللَّهِ، فَقُلْتُ وَعَلَيْكَ السَّلامُ يا اَبَا الْحَسَنِ وَ يا اَميرَ الْمُؤْمِنينَ فَقالَ يا فاطِمَةُ اِنّي اَشَمُّ عِنْدَكِ رائِحَةً طَيِّبَةً كَاَنَّها رآئِحَةُ اَخي وَابْنِ عَمّي رَسُولِ اللَّهِ، فَقُلْتُ نَعَمْ ها هُوَ مَعَ وَلَدَيْكَ تَحْتَ الْكِسآءِ، فَاَقْبَلَ عَلِيٌّ نَحْوَ الْكِسآءِ، وَقالَ السَّلامُ عَلَيْكَ يا رَسُولَ اللَّهِ، اَتَاْذَنُ لي اَنْ اَكُونَ مَعَكُمْ تَحْتَ الْكِسآءِ، قالَ لَهُ وَعَلَيْكَ السَّلامُ يا اَخي يا وَصِيّي وَخَليفَتي وَصاحِبَ لِوآئي، قَدْ اَذِنْتُ لَكَ فَدَخَلَ عَلِيٌّ تَحْتَ الْكِسآءِ،

ثُمَّ اَتَيْتُ نَحْوَ الْكِسآءِ، وَقُلْتُ اَلسَّلامُ عَلَيْكَ يا اَبَتاهُ يا رَسُولَ اللَّهِ، اَتَاْذَنُ لي اَن اَكُونَ مَعَكُمْ تَحْتَ الْكِسآءِ، قالَ وَعَلَيْكِ السَّلامُ يا بِنْتي وَيا بَضْعَتي قَدْ اَذِنْتُ لَكِ، فَدَخَلْتُ تَحْتَ الْكِسآءِ،

فَلَمَّا اكْتَمَلْنا جَميعاً تَحْتَ الْكِسآءِ، اَخَذَ اَبي رَسُولُ اللَّهِ بِطَرَفَيِ الْكِسآءِ، وَاَوْمَئَ بِيَدِهِ الْيُمْني اِلَي السَّمآءِ، وَقالَ اَللَّهُمَّ اِنَّ هؤُلاءِ اَهْلُ بَيْتي وَخآصَّتي وَحآمَّتي، لَحْمُهُمْ لَحْمي، وَدَمُهُمْ دَمي، يُؤْلِمُني ما يُؤْلِمُهُمْ، وَيَحْزُنُني ما يَحْزُنُهُمْ، اَنَا حَرْبٌ لِمَنْ حارَبَهُمْ، وَسِلْمٌ لِمَنْ سالَمَهُمْ وَعَدُوٌّ لِمَنْ عاداهُمْ، وَمُحِبٌّ لِمَنْ اَحَبَّهُمْ، اِنَّهُمْ مِنّي وَاَ نَا مِنْهُمْ، فَاجْعَلْ صَلَواتِكَ وَبَرَكاتِكَ وَرَحْمَتَكَ، وَغُفْرانَكَ وَرِضْوانَكَ عَلَيَّ وَعَلَيْهِمْ، وَاَذْهِبْ عَنْهُمُ الرِّجْسَ، وَطَهِّرْهُمْ تَطْهيراً،

فَقالَ اللَّهُ عَزَّوَجَلَّ يا مَلائِكَتي وَيا سُكَّانَ سَمواتي، اِنّي ما خَلَقْتُ سَمآءً مَبْنِيَّةً، وَلا اَرْضاً مَدْحِيَّةً، وَلا قَمَراً مُنيراً، وَلا شَمْساً مُضِيئَةً، وَلا فَلَكاً يَدُورُ، وَلا بَحْراً يَجْري، وَلا فُلْكاً يَسْري، اِلاَّ في مَحَبَّةِ هؤُلاءِ الْخَمْسَةِ الَّذينَ هُمْ تَحْتَ الْكِسآءِ، فَقالَ الْأَمينُ جِبْرآئيلُ يا رَبِّ وَمَنْ تَحْتَ الْكِسآءِ، فَقالَ عَزَّوَجَلَّ هُمْ اَهْلُ بَيْتِ النُّبُوَّةِ، وَمَعْدِنُ الرِّسالَةِ، هُمْ فاطِمَةُ وَاَبُوها وَبَعْلُها وَبَنُوها،

فَقالَ جِبْرآئيلُ يا رَبِّ، اَتَاْذَنُ لي اَنْ اَهْبِطَ اِلَي الْأَرْضِ لِأَكُونَ مَعَهُمْ سادِساً، فَقالَ اللَّهُ نَعَمْ قَدْ اَذِنْتُ لَكَ، فَهَبَطَ الْأَمينُ جِبْرآئيلُ، وَقالَ السَّلامُ عَلَيْكَ يا رَسُولَ اللَّهِ، الْعَلِيُ الْأَعْلي يُقْرِئُكَ السَّلامَ، وَيَخُصُّكَ بِالتَّحِيَّةِ وَالْإِكْرامِ، وَيَقُولُ لَكَ وَعِزَّتي وَجَلالي اِنّي ما خَلَقْتُ سَمآءً مَبْنِيَّةً، وَلا اَرْضاً مَدْحِيَّةً، وَلا قَمَراً مُنيراً، وَلا شَمْساً مُضيئَةً وَلا فَلَكاً يَدُورُ، وَلا بَحْراً يَجْري، وَلا فُلْكاً يَسْري، اِلاَّ لِأَجْلِكُمْ وَمَحَبَّتِكُمْ، وَقَدْ اَذِنَ لي اَنْ اَدْخُلَ مَعَكُمْ، فَهَلْ تَاْذَنُ لي يا رَسُولَ اللَّهِ، فَقالَ رَسُولُ اللَّهِ وَعَلَيْكَ السَّلامُ يا اَمينَ وَحْيِ اللَّهِ، اِنَّهُ نَعَمْ قَدْ اَذِنْتُ لَكَ، فَدَخَلَ جِبْرآئيلُ مَعَنا تَحْتَ الْكِسآءِ، فَقالَ لِأَبي اِنَّ اللَّهَ قَدْ اَوْحي اِلَيْكُمْ يَقُولُ: اِنَّما يُريدُ اللَّهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ اَهْلَ الْبَيْتِ، وَيُطَهِّرَكُمْ تَطْهيراً،

فَقالَ عَلِيٌّ لِأَبي يا رَسُولَ اللَّهِ، اَخْبِرْني ما لِجُلُوسِنا هذا تَحْتَ الْكِسآءِ مِنَ الْفَضْلِ عِنْدَ اللَّهِ؟ فَقالَ النَّبِيُّ وَالَّذي بَعَثَني بِالْحَقِّ نَبِيّاً، وَاصْطَفاني بِالرِّسالَةِ نَجِيّاً، ما ذُكِرَ خَبَرُنا هذا في مَحْفِلٍ مِنْ مَحافِلِ اَهْلِ الْأَرْضِ، وَفيهِ جَمْعٌ مِنْ شَيعَتِنا وَمُحِبّينا، اِلاَّ وَنَزَلَتْ عَلَيْهِمُ الرَّحْمَةُ وَحَفَّتْ بِهِمُ الْمَلائِكَةُ، وَاسْتَغْفَرَتْ لَهُمْ اِلي اَنْ يَتَفَرَّقُوا، فَقالَ عَلِيٌّ اِذاً وَاللَّهِ فُزْنا وَفازَ شيعَتُنا وَرَبِّ الْكَعْبَةِ،

فَقالَ النَّبِيُّ ثانِياً يا عَلِيُّ وَالَّذي بَعَثَني بِالْحَقِّ نَبِيّاً، وَاصْطَفاني بِالرِّسالَةِ نَجِيّاً، ما ذُكِرَ خَبَرُنا هذا في مَحْفِلٍ مِنْ مَحافِلِ اَهْلِ الْأَرْضِ، وَفيهِ جَمْعٌ مِنْ شيعَتِنا وَمُحِبّينا، وَفيهِمْ مَهْمُومٌ اِلاَّ وَفَرَّجَ اللَّهُ هَمَّهُ، وَلا مَغْمُومٌ اِلاَّ وَكَشَفَ اللَّهُ غَمَّهُ، وَلا طالِبُ حاجَةٍ اِلاَّ وَقَضَي اللّهُ حاجَتَهُ، فَقالَ عَلِيٌّ اِذاً وَاللَّهِ فُزْنا وَسُعِدْنا، وَكَذلِكَ شيعَتُنا فازُوا وَسُعِدُوا فِي الدُّنْيا وَالْأخِرَةِ، وَرَبِّ الْكَعْبَةِ.''',
    benefits: "حديث قدسي مروي في بيان فضيلة النبي الأكرم (صلى الله عليه وآله وسلم) وأهل بيته الأطهار (عليهم السلام) أصحاب الكساء (فاطمة وعلي والحسن والحسين).",
  ),
  Dua(
    title: "دعاء صنمي قريش",
    text: r'''بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، اَللّهُمَّ الْعَنْ صَنَمَيْ قُرَيْشٍ وَجِبْتَيْهِمَا وَطَاغُوتَيْهِمَا وَإِفْكَيْهِمَا وَابْنَتَيْهِمَا، اللَّذَيْنِ خَالَفَا أَمْرَكَ، وَأَنْكَرَا وَحْيَكَ، وَجَحَدَا إِنْعَامَكَ، وَعَصَيَا رَسُولَكَ، وَقَلَّبَا دِينَكَ، وَحَرَّفَا كِتَابَكَ، وَعَطَّلا أَحْكَامَكَ، وَأَبْطَلا فَرَائِضَكَ، وَأَلْحَدَا فِي آيَاتِكَ، وَعَادَيَا أَوْلِيَاءَكَ، وَوَالَيَا أَعْدَاءَكَ، وَخَرَّبَا بِلادَكَ، وَأَفْسَدَا عِبَادَكَ.

اَللّهُمَّ الْعَنْهُمَا وَأَتْبَاعَهُمَا وَأَوْلِيَاءَهُمَا وَأَشْيَاعَهُمَا وَمُحِبِّيهِمَا، فَقَدْ أَخْرَبَا بَيْتَ النُّبُوَّةِ، وَرَدَمَا بَابَهُ، وَنَقَضَا سَقْفَهُ، وَأَلْحَقَا سَمَاءَهُ بِأَرْضِهِ، وَعَالِيَهُ بِسَافِلِهِ، وَظَاهِرَهُ بِبَاطِنِهِ، وَاسْتَأْصَلا أَهْلَهُ، وَأَبَادَا أَنْصَارَهُ، وَقَتَلا أَطْفَالَهُ، وَأَخْلَيَا مِنْبَرَهُ مِنْ وَصِيِّهِ وَوَارِثِ عِلْمِهِ، وَجَحَدَا إِمَامَتَهُ، وَأَشْرَكَا بِرَبِّهِمَا، فَعَظِّمْ ذَنْبَهُمَا، وَخَلِّدْهُمَا فِي سَقَرَ، وَمَا أَدْرَاكَ مَا سَقَرُ، لا تُبْقِي وَلا تَذَرُ.

اَللّهُمَّ الْعَنْهُمْ بِعَدَدِ كُلِّ مُنْكَرٍ أَتَوْهُ، وَحَقٍّ أَخْفَوْهُ، وَمِنْبَرٍ عَلَوْهُ، وَمُؤْمِنٍ أرجَوهُ، وَمُنَافِقٍ وَلَّوْهُ، وَوَلِيٍّ آذَوْهُ، وَطَرِيدٍ آوَوْهُ، وَصَادِقٍ طَرَدُوهُ، وَكَافِرٍ نَصَرُوهُ، وَإِمَامٍ قَهَرُوهُ، وَفَرْضٍ غَيَّرُوهُ، وَأَثَرٍ أَنْكَرُوهُ، وَشَرٍّ آثَرُوهُ، وَدَمٍ أَرَاقُوهُ، وَخَبَرٍ بَدَّلُوهُ، وَحُكْمٍ قَلَّبُوهُ، وَكُفْرٍ أَبْدَعُوهُ، وَكِذْبٍ دَلَّسُوهُ، وَإِرْثٍ غَصَبُوهُ، وَفَيْءٍ اقْتَطَعُوهُ، وَسُحْتٍ أَكَلُوهُ، وَخُمُسٍ اسْتَحَلُّوهُ، وَبَاطِلٍ أَسَّسُوهُ، وَجَوْرٍ بَسَطُوهُ، وَظُلْمٍ نَشَرُوهُ، وَوَعْدٍ أَخْلَفُوهُ، وَعَهْدٍ نَقَضُوهُ، وَحَلالٍ حَرَّمُوهُ، وَحَرَامٍ حَلَّلُوهُ، وَنِفَاقٍ أَسَرُّوهُ، وَغَدْرٍ أَضْمَرُوهُ، وَبَطْنٍ فَتَّقُوهُ، وَضِلْعٍ كَسَرُوهُ، وَجَنِينٍ أَسْقَطُوهُ، وَصَكٍّ مَزَّقُوهُ، وَشَمْلٍ بَدَّدُوهُ، وَعَزِيزٍ أَذَلُّوهُ، وَذَلِيلٍ أَعَزُّوهُ، وَحَقٍّ مَنَعُوهُ، وَإِمَامٍ خَالَفُوهُ.

اَللّهُمَّ الْعَنْهُمَا بِكُلِّ آيَةٍ حَرَّفُوهَا، وَفَرِيضَةٍ تَرَكُوهَا، وَسُنَّةٍ غَيَّرُوهَا، وَأَحْكَامٍ عَطَّلُوهَا، وَرُسُومٍ مَنَعُوهَا، وَأَرْحَامٍ قَطَعُوهَا، وَشَهَادَاتٍ كَتَمُوهَا، وَوَصِيَّةٍ ضَيَّعُوهَا، وَأَيْمَانٍ نَكَثُوهَا، وَدَعْوَى أَبْطَلُوهَا، وَبَيِّنَةٍ أَنْكَرُوهَا، وَحِيلَةٍ أَحْدَثُوهَا، وَخِيَانَةٍ أَوْرَدُوهَا، وَعَقَبَةٍ ارْتَقُوهَا، وَدِبَابٍ دَحْرَجُوهَا، وَأَزْيَافٍ لَزِمُوهَا، وَأَمَانَاتٍ خَانُوهَا.

اَللّهُمَّ الْعَنْهُمَا فِي مَكْنُونِ السِّرِّ، وَظَاهِرِ الْعَلانِيَةِ، لَعْناً كَثِيراً دَائِباً أَبَداً سَرْمَداً، لا انْقِطَاعَ لأَمَدِهِ، وَلا نَفَادَ لِعَدَدِهِ، لَعْناً يَغْدُو أَوَّلُهُ وَلا يَرُوحُ آخِرُهُ، لَهُمْ وَلأَعْوَانِهِمْ وَأَنْصَارِهِمْ وَمُحِبِّيهِمْ وَمُوَالِيهِمْ، وَالْمَائِلِينَ إِلَيْهِمْ وَالنَّاهِضِينَ بِأَجْنِحَتِهِمْ، وَالْمُقْتَدِينَ بِكَلامِهِمْ، وَالْمُصَدِّقِينَ بِأَحْكَامِهِمْ.''',
    benefits: "روي عن أمير المؤمنين عليه السلام في عظم شأن هذا الدعاء في القنوت لطلب إحقاق الحق وزوال الباطل.",
  ),
  Dua(
    title: "دعاء الاحتجاب",
    text: r'''اِحْتَجَبْتُ بِنُورِ وَجْهِ اللهِ الْقَدِيمِ الْكَامِلِ، وَتَحَصَّنْتُ بِحِصْنِ اللهِ الْقَوِيِّ الشَّامِلِ، وَرَمَيْتُ مَنْ بَغَى عَلَيَّ بِسَهْمِ اللهِ وَسَيْفِهِ الْقَاتِلِ.

اَللّهُمَّ يَا غَالِباً عَلَى أَمْرِهِ، وَيَا قَائِماً فَوْقَ خَلْقِهِ، وَيَا حَائِلاً بَيْنَ الْمَرْءِ وَقَلْبِهِ، حُلْ بَيْنِي وَبَيْنَ الشَّيْطَانِ وَنَزْغِهِ، وَبَيْنَ مَا لا طَاقَةَ لِي بِهِ مِنْ أَحَدٍ مِنْ عِبَادِكَ، كُفَّ عَنِّي أَلْسِنَتَهُمْ، وَاغْلُلْ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَاجْعَلْ بَيْنِي وَبَيْنَهُمْ سَدّاً مِنْ نُورِ عَظَمَتِكَ، وَحِجَاباً مِنْ قُوَّتِكَ، وَجُنْداً مِنْ سُلْطَانِكَ، فَإِنَّكَ حَيٌّ قَادِرٌ.

اَللّهُمَّ اغْشَ عَنِّي أَبْصَارَ النَّاظِرِينَ حَتَّى أَرِدَ الْمَوَارِدَ، وَاغْشَ عَنِّي أَبْصَارَ النُّورِ وَأَبْصَارَ الظُّلْمَةِ وَأَبْصَارَ الْمُرِيدِينَ بِيَ السُّوءَ حَتَّى لا أُبَالِيَ مِنْ أَبْصَارِهِمْ، يَكَادُ سَنَا بَرْقِهِ يَذْهَبُ بِالأَبْصَارِ، يُقَلِّبُ اللهُ اللَّيْلَ وَالنَّهَارَ، إِنَّ فِي ذَلِكَ لَعِبْرَةً لأُولِي الأَبْصَارِ.

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، كهيعص كِفَايَتُنَا وَهُوَ حَسْبِي، بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، حمعسق حِمَايَتُنَا وَهُوَ حَسْبِي.

كَماءٍ أَنْزَلْنَاهُ مِنَ السَّمَاءِ فَاخْتَلَطَ بِهِ نَبَاتُ الأَرْضِ فَأَصْبَحَ هَشِيماً تَذْرُوهُ الرِّيَاحُ، هُوَ اللهُ الَّذِي لا إِلَهَ إِلا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ. يَوْمَ الآزِفَةِ إِذِ الْقُلُوبُ لَدَى الْحَنَاجِرِ كَاظِمِينَ مَا لِلظَّالِمِينَ مِنْ حَمِيمٍ وَلا شَفِيعٍ يُطَاعُ، عَلِمَتْ نَفْسٌ مَا أَحْضَرَتْ.

فَلا أُقْسِمُ بِالْخُنَّسِ الْجَوَارِ الْكُنَّسِ، وَاللَّيْلِ إِذَا عَسْعَسَ، وَالصُّبْحِ إِذَا تَنَفَّسَ، ص، وَالْقُرْآنِ ذِي الذِّكْرِ، بَلِ الَّذِينَ كَفَرُوا فِي عِزَّةٍ وَشِقَاقٍ.

(شَاهَتِ الْوُجُوهُ)، (شَاهَتِ الْوُجُوهُ)، (شَاهَتِ الْوُجُوهُ)، وَكَلَّتِ الأَلْسُنُ وَعَمِيَتِ الأَبْصَارُ، اَللّهُمَّ اجْعَلْ خَيْرَهُمْ بَيْنَ عَيْنَيْهِمْ وَشَرَّهُمْ تَحْتَ قَدَمَيْهِمْ، وَخَاتَمَ سُلَيْمَانَ بَيْنَ أَكْتَافِهِمْ، فَسَيَكْفِيكَهُمُ اللهُ وَهُوَ السَّمِيعُ الْعَلِيمُ.

ص، صِبْغَةَ اللهِ وَمَنْ أَحْسَنُ مِنَ اللهِ صِبْغَةً، كهيعص اكْفِنَا، حمعسق احْمِنَا، سُبْحَانَ الْقَادِرِ الْقَاهِرِ الْكَافِي، وَجَعَلْنَا مِنْ بَيْنِ أَيْدِيهِمْ سَدّاً وَمِنْ خَلْفِهِمْ سَدّاً فَأَغْشَيْنَاهُمْ فَهُمْ لا يُبْصِرُونَ، صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لا يَعْقِلُونَ، أُولَئِكَ الَّذِينَ طَبَعَ اللهُ عَلَى قُلُوبِهِمْ وَسَمْعِهِمْ وَأَبْصَارِهِمْ وَأُولَئِكَ هُمُ الْغَافِلُونَ.

تَحَصَّنْتُ بِذِي الْمُلْكِ وَالْمَلَكُوتِ، وَاعْتَصَمْتُ بِذِي الْعِزَّةِ وَالْعَظَمَةِ وَالْجَبَرُوتِ، وَتَوَكَّلْتُ عَلَى الْحَيِّ الَّذِي لا يَمُوتُ، دَخَلْتُ فِي حِرْزِ اللهِ وَفِي حِفْظِ اللهِ وَفِي أَمَانِ اللهِ مِنْ شَرِّ الْبَرِيَّةِ أَجْمَعِينَ.

كهيعص، حمعسق، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللهِ الْعَلِيِّ الْعَظِيمِ، وَصَلَّى اللهُ عَلَى مُحَمَّدٍ وَآلِهِ الطَّاهِرِينَ، بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ.''',
    benefits: "دعاء عظيم مروي عن أمير المؤمنين عليه السلام للتحصين من كيد الأعداء والجن والأنس وبث الطمأنينة.",
  ),
  Dua(
    title: "دعاء الحفظ",
    text: r'''بِسْمِ الله الرَّحْمنِ الرَّحيمِ، بِسْمِ اللّهِ خَيْرِ الاسَّماء، بِسْمِ الله رَبِّ الارْضِ وَالسَّماء، بِسْمِ الله الّذي لايَضُرُّ مَعَ اسْمِهِ سَمُّ وَلا داءٌ، بِسْمِ الله أَصْبَحْتُ وَعلى الله تَوَكَّلْتُ، بِسْمِ الله عَلى قَلْبي وَنَفْسي، بِسْمِ الله عَلى ديني وَعَقْلي، بِسْمِ الله عَلى أهْلي وَمالي، بِسْمِ الله عَلى ما أعْطاني رَبّي، بِسْمِ الله الَّذي لايَضُرُّ مَعَ اسْمِهِ شَيٌ في الارْضِ وَلا في السَّماء وَهُوَ السَّميعُ العَليمُ.

الله الله رَبّي لا أُشْرِكُ بِهِ شَيْئاً، الله أكْبَرُ الله أكْبَرُ وَأعَزُّ وَأجَلُّ مِمَّا أخافُ وَأحْذَرُ، عَزَّ جارُكَ وَجَلَّ ثَناؤُكَ وَلا إلهَ غَيْرُكَ، اللَّهُمَّ إِنّي أعُوذُ بِكَ مِنْ شَرِّ نَفْسي وَمِنْ شَرِّ كُلِّ سُلْطانٍ شَدِيدٍ، وَمِنْ شَرِّ كُلِّ جَبّارٍ عَنِيدٍ، وَمِنْ شَرِّ قَضاءِ السُّوءِ، وَمِنْ كُلِّ دابَّةٍ أنْتَ آخِذٌ بِناصِيَتِها، إنَّكَ عَلى صِراطٍ مُسْتَقِيمٍ وَأنْتَ عَلى كُلِّ شَيْءٍ حَفِيظٌ.

إِنَّ وَلِيِّيَ اللَّهُ الَّذِي نَزَّلَ الْكِتَابَ وَهُوَ يَتَوَلَّى الصَّالِحِينَ، فَإِن تَوَلَّوْا فَقُلْ حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ.''',
    benefits: "روي عن النبي الأكرم صلى الله عليه وآله للحفظ والأمان من الآفات والشرور وكيد الشياطين والسلاطين.",
  ),
  Dua(
    title: "دعاء الرزق",
    text: r'''اللَّهُمَّ ارْزُقْنِي مِنْ فَضْلِكَ الواسِعِ الحَلالِ الطَيّبِ، رِزْقاً واسِعاً حَلالاً طَيّباً بَلاغاً لِلدُنيا وَالآخِرَةِ، صَبَّاً صَبَّاً هَنيئاً مَريئاً، مِنْ غَيْرِ كَدٍّ وَلا مَنٍّ مِنْ أحَدٍ مِنْ خَلْقِكَ، إِلاّ سَعَةً مِنْ فَضْلِكَ الواسِعَ، فَإنَّكَ قُلْتَ {وَاسْأَلُوا الله مِنْ فَضْلِهِ}، فَمِنْ فَضْلِكَ أسْأَلُ، وَمِنْ عَطيتِكَ أسْأَلُ، وَمِنْ يَدِكَ المَلاى أسْأَلُ.''',
    benefits: "دعاء مروي عن الإمام جعفر الصادق عليه السلام لطلب سعة الرزق والبركة فيه من غير تعب ولا منة أحد.",
  ),
  Dua(
    title: "دعاء قضاء الحاجة",
    text: r'''اللَّهُمَّ إِنِّي أَتَوَجَّهُ إِلَيْكَ بِأَحَبِّ الأسْماءِ إِلَيْكَ وَأَعْظَمِها لَدَيْكَ وَأَتَقَرَّبُ وَأَتَوَسَّلُ إِلَيْكَ بِمَنْ أَوْجَبْتَ حَقَّهُ عَلَيْكَ، بِمُحَمَّدٍ وَعَليٍّ وَفاطِمَةَ وَالحَسَنِ وَالحُسَيْنِ وَعَلِيِّ بْنِ الحُسَيْنِ وَمُحَمَّدِ بْنِ عَلِيٍّ وَجَعْفَرِ بْنِ مُحَمَّدٍ وَموسى بنِ جَعْفَرٍ وَعَلِيِّ بْنِ مُوسى وَمُحَمَّدِ بْنِ عَلِيٍّ وَعَلِيِّ بْنِ مُحَمَّدٍ وَالحَسَنِ بْنِ عَلِيٍّ وَالحُجَّةِ المُنْتَظَرِ (صَلَواتُ الله عَلَيهِم أجمَعينَ) أن تصلي عليهم وتكفيني وتقدم قضاء حوائجي يا الله يا رب العالمين.''',
    benefits: "دعاء مروي لقضاء الحوائج المستعصية بالتوسل بالنبي الأكرم وأهل بيته الأطهار صلوات الله عليهم.",
  ),
  Dua(
    title: "دعاء الشفاء",
    text: r'''بِسْمِ الله دَواءٌ، وَالْحَمْدُ للهِ شِفاءٌ، وَلا إِلهَ إِلَّا الله كِفاءٌ، هُوَ الشَّافي شِفاءٌ، وَهُوَ الْكافي كِفاءٌ، أَذْهِبِ الْبَأْسَ بِرَبِّ النَّاسِ، شِفاءٌ لا يُغادِرُهُ سُقْمٌ، وَصَلَّى الله عَلى مُحَمَّدٍ وَآلِهِ النُّجَباءِ.

اللَّهُمَّ إِنِّي أَسْأَلُكَ بِحَقِّ الْقُرْآنِ الْعَظِيمِ الَّذِي نَزَلَ بِهِ الرُّوحُ الْأَمِينُ وَ هُوَ عِنْدَكَ فِي أُمِّ الْكِتَابِ عَلِيٌّ حَكِيمٌ أَنْ تَشْفِيَنِي بِشِفَائِكَ وَ تُدَاوِيَنِي بِدَوَائِكَ وَ تُعَافِيَنِي مِنْ بَلَائِكَ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ.''',
    benefits: "يقرأ لطلب العافية والشفاء من الأمراض والأسقام ببركة أسماء الله والقرآن الكريم.",
  ),
  Dua(
    title: "دعاء دفع البلاء",
    text: r'''يَا مَنْ تُحَلُّ بِهِ عُقَدُ الْمَكارِهِ ، وَيَا مَنْ يُفْثَأُ بِهِ حَدُّ الشَّدائِدِ ، وَيَا مَنْ يُلْتَمَسُ مِنْهُ الْمَخْرَجُ إِلىٰ رَوْحِ الْفَرَجِ ، ذَلَّتْ لِقُدْرَتِكَ الصِّعابُ ، وَتَسَبَّبَتْ بِلُطْفِكَ الْأَسْبابُ ، وَجَرىٰ بِقُدْرَتِكَ الْقَضاءُ ، وَمَضَتْ عَلىٰ إِرادَتِكَ الْأَشْياءُ ، فَهِىَ بِمَشِيئَتِكَ دُونَ قَوْلِكَ مُؤْتَمِرَةٌ ، وَبِإِرادَتِكَ دُونَ نَهْيِكَ مُنْزَجِرَةٌ ، أَنْتَ الْمَدْعُوُّ لِلْمُهِمَّاتِ ، وَأَنْتَ الْمَفْزَعُ فِى الْمُلِمَّاتِ ، لَايَنْدَفِعُ مِنْها إِلّا ما دَفَعْتَ ، وَلَا يَنْكَشِفُ مِنْها إِلّا ما كَشَفْتَ ،

وَقَدْ نَزَلَ بِى يَا رَبِّ ما قَدْ تَكَأَّدَنِى ثِقْلُهُ ، وَأَلَمَّ بِى ما قَدْ بَهَظَنِى حَمْلُهُ ، وَبِقُدْرَتِكَ أَوْرَدْتَهُ عَلَىَّ ، وَبِسُلْطانِكَ وَجَّهْتَهُ إِلَىَّ ، فَلا مُصْدِرَ لِما أَوْرَدْتَ ، وَلَا صارِفَ لِما وَجَّهْتَ ، وَلَا فاتِحَ لِما أَغْلَقْتَ ، وَلَا مُغْلِقَ لِما فَتَحْتَ ، وَلَا مُيَسِّرَ لِما عَسَّرْتَ ، وَلَا ناصِرَ لِمَنْ خَذَلْتَ ،

فَصَلِّ عَلىٰ مُحَمَّدٍ وَآلِهِ وَافْتَحْ لِى يَا رَبِّ بَابَ الْفَرَجِ بِطَوْلِكَ؛ وَاكْسِرْ عَنِّى سُلْطانَ الْهَمِّ بِحَوْلِكَ ، وَأَنِلْنِى حُسْنَ النَّظَرِ فِيما شَكَوْتُ ، وَأَذِقْنِى حَلاوَةَ الصُّنْعِ فِيما سَأَلْتُ ،وَهَبْ لِى مِنْ لَدُنْكَ رَحْمَةً وَفَرَجاً هَنِيئاً ، وَاجْعَلْ لِى مِنْ عِنْدِكَ مَخْرَجاً وَحِيّاً ، وَلَا تَشْغَلْنِى بِالاهْتِمامِ عَنْ تَعاهُدِ فُرُوضِكَ ، وَاسْتِعْمالِ سُنَّتِكَ ،

فَقَدْ ضِقْتُ لِما نَزَلَ بِى يَا رَبِّ ذَرْعاً ، وَامْتَلَأْتُ بِحَمْلِ ما حَدَثَ عَلَىَّ هَمّاً ، وَأَنْتَ الْقادِرُ عَلىٰ كَشْفِ ما مُنِيتُ بِهِ ، وَدَفْعِ ما وَقَعْتُ فِيهِ ، فَافْعَلْ بِى ذٰلِكَ وَإِنْ لَمْ أَسْتَوْجِبْهُ مِنْكَ ، يَا ذَا الْعَرْشِ الْعَظِيمِ ، وَذَا الْمَنِّ الْكَرِيمِ ، فَأَنْتَ قادِرٌ يَا أَرْحَمَ الرَّاحِمِينَ ، آمِينَ رَبَّ الْعالَمِينَ.''',
    benefits: "علّمه الإمام الهادي (عليه السلام) لليسع القمي، وكان أهل البيت (عليهم السلام) يقرأونه لدفع البلاء والشرور والخوف وضيق الصدر.",
  ),
  Dua(
    title: "دعاء السفر",
    text: r'''اللَّهُمَّ احْفَظْنِي وَاحْفَظْ مَا مَعِي، وَبَلِّغْنِي وَبَلِّغْ مَا مَعِي بِبَلَاغِكَ الْحَسَنِ، بِاللَّهِ أَسْتَفْتِحُ وَبِاللَّهِ أَسْتَنْجِحُ وَبِمُحَمَّدٍ (صَلَّى اللهُ عَلَيْهِ وآلِهِ) أَتَوَجَّهُ. اللَّهُمَّ سَهِّلْ لِي كُلَّ حُزُونَةٍ، وَذَلِّلْ لِي كُلَّ صُعُوبَةٍ، وَأَعْطِنِي مِنَ الْخَيْرِ كُلِّهِ أَكْثَرَ مِمَّا أَرْجُو، وَاصْرِفْ عَنِّي مِنَ الشَّرِّ أَكْثَرَ مِمَّا أَحْذَرُ فِي عَافِيَةٍ، يَا أَرْحَمَ الرَّاحِمِينَ.

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمُنْقَلَبِ، وَسُوءِ الْمَنْظَرِ فِي النَّفْسِ وَالْأَهْلِ وَالْمَالِ وَالْوَلَدِ. اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَأَنْتَ الْخَلِيفَةُ فِي الْأَهْلِ وَلا يَجْمَعُهُمَا غَيْرُكَ.''',
    benefits: "يستحب قراءته للمسافر لحفظ النفس والأهل والمال وتيسير صعوبات السفر.",
  ),
  Dua(
    title: "دعاء الخوف",
    text: r'''اللَّهُمَّ إِنَّكَ لا يَكْفي مِنْكَ أَحَدٌ، وَأَنْتَ تَكْفي مِنْ كُلِّ أَحَدٍ مِنْ خَلْقِكَ، فَاكْفِنِي ما أخاف وأحذر وعافني واعفُ عني.

بِالله أَسْتَفْتِحُ، وَبِالله أَسْتَنْجِحُ، وَبِمُحَمَّدٍ صَلَّى الله عَلَيْهِ وَآلِهِ أَتَوَجَّهُ، اللَّهُمَّ ذَلِّلْ لِي صُعُوبَتَهُ، وَسَهِّلْ لِي حُزُونَتَهُ، فَإِنَّكَ تَمْحو ما تَشاءُ وَتُثْبِتُ، وَعِنْدَكَ أُمُّ الكِتابِ.''',
    benefits: "روي عن الإمام الصادق عليه السلام للأمن من مخاوف الدنيا وأشرار الخلق وتيسير الأمور الصعبة.",
  ),
  Dua(
    title: "دعاء النوم",
    text: r'''آمَنْتُ بِالله وَكَفَرْتُ بِالطّاغوتِ، اللَّهُمَّ احْفَظْني في مَنامي وَفي يَقَظَتي.

أَعوذُ بِعِزَّةِ الله، وَأَعوذُ بِقُدْرَةِ الله، وَأَعوذُ بِسُلْطانِ الله، وَأَعوذُ بِجَمالِ الله، وَأَعوذُ بِدَفْعِ الله، وَأَعوذُ بِمَنْعِ الله، وَأَعوذُ بِجَمْعِ الله، وَأَعوذُ بِمُلْكِ الله، وَأَعوذُ بِوَجْهِ الله، وَأَعوذُ بِرَسولِ الله (صَلَّى الله عَلَيْهِ وَآلِهِ) مِنْ شَرِّ ما خَلَقَ وَبَرَأَ وَذَرَأَ.''',
    benefits: "يقرأ قبل النوم للتحصين والحفظ من الكوابيس وهواجس الشياطين طوال الليل.",
  ),
  Dua(
    title: "دعاء طلب الرزق",
    text: r'''اللَّهُمَّ إِنَّهُ لَيْسَ لِي عِلْمٌ بِمَوْضِعِ رِزْقِي، وَإِنَّمَا أَطْلُبُهُ بِخَطَرَاتٍ تَخْطُرُ عَلَى قَلْبِي، فَأَجُولُ فِي طَلَبِهِ الْبُلْدَانَ، فَأَنَا فِيمَا أَنَا طَالِبٌ كَالْحَيْرَانِ، لَا أَدْرِي أَ فِي سَهْلٍ هُوَ أَمْ فِي جَبَلٍ، أَمْ فِي أَرْضٍ أَمْ فِي سَمَاءٍ، أَمْ فِي بَرٍّ أَمْ فِي بَحْرٍ، وَعَلَى يَدَيْ مَنْ وَمِنْ قِبَلِ مَنْ، وَقَدْ عَلِمْتُ أَنَّ عِلْمَهُ عِنْدَكَ وَأَسْبَابَهُ بِيَدِكَ، وَأَنْتَ تَقْسِمُهُ بِلُطْفِكَ وَتُسَبِّبُهُ بِرَحْمَتِكَ.

اللَّهُمَّ فَصَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَاجْعَلْ يَا رَبِّ رِزْقَكَ لِي وَاسِعاً، وَمَطْلَبَهُ سَهْلًا، وَمَأْخَذَهُ قَرِيباً، وَلَا تُعَنِّتْنِي بِطَلَبِ مَا لَمْ تُقَدِّرْ لِي فِيهِ رِزْقاً، فَإِنَّكَ غَنِيٌّ عَنْ عَذَابِي، وَأَنَا فَقِيرٌ إِلَى رَحْمَتِكَ، فَصَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَجُدْ عَلَى عَبْدِكَ بِفَضْلِكَ، إِنَّكَ ذُو فَضْلٍ عَظِيمٍ.''',
    benefits: "من تعقيبات صلاة العشاء المروية في مفاتيح الجنان وهو جليل الشأن لطلب الرزق وتيسير أسبابه.",
  ),
  Dua(
    title: "دعاء الاستغفار",
    text: r'''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ. اللَّهُمَّ إِنِّي أَسْتَغْفِرُكَ مِنْ كُلِّ ذَنْبٍ قَوِيَ عَلَيْهِ بَدَنِي بِعَافِيَتِكَ، أَوْ نَالَتْهُ قُدْرَتِي بِفَضْلِ نِعْمَتِكَ، أَوْ بَسَطْتُ إِلَيْهِ يَدِي بِسَابِغِ رِزْقِكَ، أَوْ احْتَجَبْتُ فِيهِ مِنَ النَّاسِ بِسِتْرِكَ، أَوْ اتَّكَلْتُ فِيهِ عِنْدَ خَوْفِي مِنْهُ عَلَى أَنَاتِكَ، أَوْ وَثِقْتُ مِنْ سَطْوَتِكَ عَلَيَّ فِيهِ بِحِلْمِكَ، أَوْ عَوَّلْتُ فِيهِ عَلَى كَرَمِ عَفْوِكَ.

اللَّهُمَّ إِنِّي أَسْتَغْفِرُكَ مِنْ كُلِّ ذَنْبٍ خُنْتُ فِيهِ أَمَانَتِي، أَوْ بَخَسْتُ بِفِعْلِهِ نَفْسِي، أَوْ احْتَطَبْتُ بِهِ عَلَى بَدَنِي، أَوْ قَدَّمْتُ فِيهِ لَذَّتِي، أَوْ آثَرْتُ فِيهِ شَهْوَتِي، أَوْ سَعَيْتُ فِيهِ لِغَيْرِي، أَوْ اسْتَغْوَيْتُ إِلَيْهِ مَنْ تَبِعَنِي، أَوْ كَابَرْتُ فِيهِ مَنْ مَنَعَنِي، أَوْ قَهَرْتُ عَلَيْهِ مَنْ عَادَانِي، أَوْ غَلَبْتُ عَلَيْهِ بِفَضْلِ حِيلَتِي، أَوْ أَحَلْتُ عَلَيْكَ مَوْلايَ فَلَمْ تَغْلِبْنِي عَلَى فِعْلِي إِذْ كُنْتُ كَارِهاً لِمَعْصِيَتِي فَحَلُمْتَ عَنِّي، لَكِنْ سَبَقَ عِلْمُكَ فِيَّ بِفِعْلِي ذَلِكَ، لَمْ تُدْخِلْنِي يَا رَبِّ فِيهِ جَبْراً، وَلَمْ تَحْمِلْنِي عَلَيْهِ قَهْراً، وَلَمْ تَظْلِمْنِي فِيهِ شَيْئاً، فَأَسْتَغْفِرُكَ لَهُ وَلِجَمِيعِ ذُنُوبِي.''',
    benefits: "استغفار مروي عن أمير المؤمنين علي بن أبي طالب عليه السلام يمحو الذنوب ويجلب الرزق والبركة.",
  ),
  Dua(
    title: "دعاء ختم القرآن",
    text: r'''اللَّهُمَّ إِنَّكَ أَعَنْتَنِي عَلَى خَتْمِ كِتَابِكَ الَّذِي أَنْزَلْتَهُ نُوراً، وَجَعَلْتَهُ مُهَيْمِناً عَلَى كُلِّ كِتَابٍ أَنْزَلْتَهُ، وَفَضَّلْتَهُ عَلَى كُلِّ حَدِيثٍ قَصَصْتَهُ، وَفُرْقَاناً فَرَّقْتَ بِهِ بَيْنَ حَلاَلِكَ وَحَرَامِكَ، وَقُرْآناً أَعْرَبْتَ بِهِ عَنْ شَرَائِعِ أَحْكامِكَ، وَكِتَاباً فَصَّلْتَهُ لِعبَادِكَ تَفْصِيلاً، وَوَحْياً أَنْزَلْتَهُ عَلَى نَبِيِّكَ مُحَمَّدٍ صَلَوَاتُكَ عَلَيْهِ وَآلِهِ تَنْزِيلاً، وَجَعَلْتَهُ نُوراً نَهْتَدِي مِنْ ظُلَمِ الضَّلاَلَةِ وَالْجَهَالَةِ بِاتِّبَاعِهِ، وَشِفَاءً لِمَنْ أَنْصَتَ بِفَهْمِ التَّصْدِيقِ إِلَى اسْتِمَاعِهِ، وَمِيزَانَ قِسْطٍ لاَ يَحِيفُ عَنِ الْحَقِّ لِسَانُهُ، وَنُورَ هُدًى لاَ يُطْفَأُ عَنِ الشَّاهِدِينَ بُرْهَانُهُ، وَعَلَمَ نَجَاةٍ لاَ يَضِلُّ مَنْ أَمَّ قَصْدَ سُنَّتِهِ، وَلاَ تَنَالُ أَيْدِي الْهَلَكَاتِ مَنْ تَعَلَّقَ بِعُرْوَةِ عِصْمَتِهِ.

اللَّهُمَّ فَإِذْ أَفَدْتَنَا الْمَعُونَةَ عَلَى تِلاَوَتِهِ، وَسَهَّلْتَ جَوَاسِيَ أَلْسِنَتِنَا بِحُسْنِ عِبَارَتِهِ، فَاجْعَلْنَا مِمَّنْ يَرْعَاهُ حَقَّ رِعَايَتِهِ، وَيَدِينُ لَكَ بِاعْتِقَادِ التَّسْلِيمِ لِمُحْكَمِ آيَاتِهِ، وَيَفْزَعُ إِلَى الْإِقْرَارِ بِمُتَشَابِهِهِ وَمُوضَحَاتِ بَيِّنَاتِهِ.

اللَّهُمَّ إِنَّكَ أَنْزَلْتَهُ عَلَى نَبِيِّكَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ مُجْمَلاً، وَأَلْهَمْتَهُ عِلْمَ عَجَائِبِهِ مُكَمَّلاً، وَوَرَّثْتَنَا عِلْمَهُ مُفَسَّراً، وَفَضَّلْتَنَا عَلَى مَنْ جَهِلَ عِلْمَهُ، وَقَوَّيْتَنَا عَلَيْهِ لِتَرْفَعَنَا فَوْقَ مَنْ لَمْ يُطِقْ حَمْلَهُ.

اللَّهُمَّ فَكَمَا جَعَلْتَ قُلُوبَنَا لَهُ حَمَلَةً، وَعَرَّفْتَنَا بِرَحْمَتِكَ شَرَفَهُ وَفَضْلَهُ، فَصَلِّ عَلَى مُحَمَّدٍ الْخَطِيبِ بِهِ، وَعَلَى آلِهِ الْخُزَّانِ لَهُ، وَاجْعَلْنَا مِمَّنْ يَعْتَرِفُ بِأَنَّهُ مِنْ عِنْدِكَ، حَتَّى لاَ يُعَارِضَنَا الشَّكُّ فِي تَصْدِيقِهِ، وَلاَ يَخْتَلِجَنَا الزَّيْغُ عَنْ قَصْدِ طَرِيقِهِ.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَاجْعَلْنَا مِمَّنْ يَعْتَصِمُ بِحَبْلِهِ، وَيَأْوِي مِنَ الْمُتَشَابِهَاتِ إِلَى حِرْزِ مَعْقِلِهِ، وَيَسْكُنُ فِي ظِلِّ جَنَاحِهِ، وَيَهْتَدِي بِضَوْءِ صَبَاحِهِ، وَيَقْتَدِي بِتَبَلُّجِ إِسْفَارِهِ، وَيَسْتَصْبِحُ بِمِصْبَاحِهِ، وَلاَ يَلْتَمِسُ الْهُدَى فِي غَيْرِهِ.

اللَّهُمَّ وَكَمَا نَصَبْتَ بِهِ مُحَمَّداً عَلَماً لِلدَّلاَلَةِ عَلَيْكَ، وَأَنْهَجْتَ بِآلِهِ سُبُلَ الرِّضَا إِلَيْكَ، فَصَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَاجْعَلِ الْقُرْآنَ وَسِيلَةً لَنَا إِلَى أَشْرَفِ مَنَازِلِ الْكَرَامِةِ، وَسُلَّماً نَعْرُجُ فِيهِ إِلَى مَحَلِّ السَّلاَمَةِ، وَسَبَباً نُجْزَى بِهِ النَّجَاةَ فِي عَرْصَةِ الْقِيَامةِ، وَذَرِيعَةً نَقْدُمُ بِهَا عَلَى نَعِيمِ دَارِ الْمُقَامَةِ.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَاحْطُطْ بِالْقُرْآنِ عَنَّا ثِقْلَ الْأَوْزَارِ، وَهَبْ لَنَا حُسْنَ شَمَائِلِ الْأَبْرَارِ، وَاقْفُ بِنَا آثَارَ الَّذِينَ قَامُوا لَكَ بِهِ آنَاءَ اللَّيْلِ وَأَطْرَافَ النَّهَارِ، حَتَّى تُطَهِّرَنَا مِنْ كُلِّ دَنَسٍ بِتَطْهِيرِهِ، وَتَقْفُوَ بِنَا آثَارَ الَّذِينَ اسْتَضَاؤُوا بِنُورِهِ، وَلَمْ يُلْهِهِمُ الْأَمَلُ عَنِ الْعَمَلِ فَيَقْطَعَهُمْ بِخُدَعِ غُرُورِهِ.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَاجْعَلِ الْقُرْآنَ لَنَا فِي ظُلَمِ اللَّيَالِي مُونِساً، وَمِنْ نَزَغَاتِ الشَّيْطَانِ وَخَطَرَاتِ الْوَسَاوِسِ حَارِساً، وَلِأَقْدَامِنَا عَنْ نَقْلِهَا إِلَى الْمَعَاصِي حَابِساً، وَلِأَلْسِنَتِنَا عَنِ الْخَوْضِ فِي الْبَاطِلِ مِنْ غَيْرِ مَا آفَةٍ مُخْرِساً، وَلِجَوَارِحِنَا عَنِ اقْتِرَافِ الْآثَامِ زَاجِراً، وَلِمَا طَوَتِ الْغَفْلَةُ عَنَّا مِنْ تَصَفُّحِ الاعْتِبَارِ نَاشِراً، حَتَّى تُوصِلَ إِلَى قُلُوبِنَا فَهْمَ عَجَائِبهِ، وَزَوَاجِرَ أَمْثَالِهِ الَّتِي ضَعُفَتِ الْجِبَالُ الرَّوَاسِي عَلَى صَلاَبَتِهَا عَنِ احْتِمَالِهِ.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَأَدِمْ بِالْقُرْآنِ صَلاَحَ ظَاهِرِنَا، وَاحْجُبْ بِهِ خَطَرَاتِ الْوَسَاوِسِ عَنْ صِحيحِ ضَمَائِرِنَا، وَاغْسِلْ بِهِ دَرَنَ قُلُوبِنَا وَعَلاَئِقَ أَوْزَارِنَا، وَاجْمَعْ بِهِ مُنْتَشَرَ أُمُورِنَا، وَارْوِ بِهِ فِي مَوْقِفِ الْعَرْضِ عَلَيْكَ ظَمَأَ هَوَاجِرِنَا، وَاكْسُنَا بِهِ حُلَلَ الْأَمَانِ يَوْمَ الْفَزَعِ الْأَكْبَرِ فِي نُشُورِنَا.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَاجْبُرْ بِالْقُرْآنِ خَلَّتَنَا مِنْ عَدَمِ الْإِمْلاَقِ، وَسُقْ إِلَيْنَا بِهِ رَغَدَ الْعَيْشِ وَخِصْبَ سَعَةِ الْأَرْزَاقِ، وَجَنِّبْنَا بِهِ الضَّرَائِبَ الْمَذْمُومَةَ وَمَدَانِيَ الْأَخْلاَقِ، وَاعْصِمْنَا بِهِ مِنْ هُوَّةِ الْكُفْرِ وَدَوَاعِي النِّفَاقِ، حَتَّى يَكُونَ لَنَا فِي الْقِيَامَةِ إِلَى رِضْوَانِكَ وَجِنَانِكَ قَائِداً، وَلَنَا فِي الدُّنْيَا عَنْ سَخَطِكَ وَتَعَدِّي حُدُودِكَ ذَائِداً، وَلِمَا عِنْدَكَ بِتَحْلِيلِ حَلاَلِهِ وَتَحْرِيمِ حَرَامِهِ شَاهِداً.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَهَوِّنْ بِالْقُرْآنِ عِنْدَ الْمَوْتِ عَلَى أَنْفُسِنَا كَرْبَ السِّيَاقِ، وَجَهْدَ الْأَنِينِ، وَتَرَادُفَ الْحَشَارِجِ إِذَا بَلَغَتِ النُّفُوسُ التَّرَاقِيَ، وَقِيلَ مَنْ رَاقٍ؟ وَتَجَلَّى مَلَكُ الْمَوْتِ لِقَبْضِهَا مِنْ حُجُبِ الْغُيُوبِ، وَرَمَاهَا عَنْ قَوْسِ الْمَنَايَا بِأَسْهُمِ وَحْشَةِ الْفِرَاقِ، وَدَافَ لَهَا مِنْ ذُعَافِ الْمَوْتِ كَأْساً مَسْمُومَةَ الْمَذَاقِ، وَدَنَا مِنَّا إِلَى الْآخِرَةِ رَحِيلٌ وَانْطِلاَقٌ، وَصَارَتِ الْأَعْمَالُ قَلاَئِدَ فِي الْأَعْنَاقِ، وَكَانَتِ الْقُبُورُ هِيَ الْمَأْوَى إِلَى مِيقَاتِ يَوْمِ التَّلاَقِ.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَبَارِكْ لَنَا فِي حُلُولِ دَارِ الْبِلَى، وَطُولِ الْمُقَامَةِ بَيْنَ أَطْبَاقِ الثَّرَى، وَاجْعَلِ الْقُبُورَ بَعْدَ فِرَاقِ الدُّنْيَا خَيْرَ مَنَازِلِنَا، وَافْسَحْ لَنَا بِرَحْمَتِكَ فِي ضِيقِ مَلاَحِدِنَا، وَلاَ تَفْضَحْنَا فِي حَاضِرِي الْقِيَامَةِ بِمُوبِقَاتِ آثَامِنَا.

اللَّهُمَّ ارْحَمْ بِالْقُرْآنِ فِي مَوْقِفِ الْعَرْضِ عَلَيْكَ ذُلَّ مَقَامِنَا، وَثَبِّتْ بِهِ عِنْدَ اضْطِرَابِ جِسْرِ جَهَنَّمَ يَوْمَ الْمَجَازِ عَلَيْهَا زَلَلَ أَقْدَامِنَا، وَنَوِّرْ بِهِ قَبْلَ الْبَعْثِ سُدَفَ قُبُورِنَا، وَنَجِّنَا بِهِ مِنْ كُلِّ كَرْبٍ يَوْمَ الْقِيَامَةِ وَشَدَائِدِ أَهْوَالِ يَوْمِ الطَّامَّةِ، وَبَيِّضْ وُجُوهَنَا يَوْمَ تَسْوَدُّ وُجُوهُ الظَّلَمَةِ فِي يَوْمِ الْحَسْرَةِ وَالنَّدَامَةِ، وَاجْعَلْ لَنَا فِي صُدُورِ الْمُؤْمِنِينَ وُدّاً، وَلاَ تَجْعَلِ الْحَيَاةَ عَلَيْنَا نَكَدًا.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ كَمَا بَلَّغَ رِسَالَتَكَ، وَصَدَعَ بِأَمْرِكَ، وَنَصَحَ لِعِبَادِكَ.

اللَّهُمَّ اجْعَلْ نَبِيَّنَا صَلَوَاتُكَ عَلَيْهِ وَعَلَى آلِهِ يَوْمَ الْقِيَامَةِ أَقْرَبَ النَّبِيِّينَ مِنْكَ مَجْلِساً، وَأَمْكَنَهُمْ مِنْكَ شَفَاعَةً، وَأَجَلَّهُمْ عِنْدَكَ قَدْراً، وَأَوْجَهَهُمْ عِنْدَكَ جَاهًا.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَشَرِّفْ بُنْيَانَهُ، وَعَظِّمْ بُرْهَانَهُ، وَثَقِّلْ مِيزَانَهُ، وَتَقَبَّلْ شَفَاعَتَهُ، وَقَرِّبْ وَسِيلَتَهُ، وَبَيِّضْ وَجْهَهُ، وَأَتِمَّ نُورَهُ، وَارْفَعْ دَرَجَتَهُ، وَأَحْيِنَا عَلَى سُنَّتِهِ، وَتَوَفَّنَا عَلَى مِلَّتِهِ، وَخُذْ بِنَا مِنْهَاجَهُ، وَاسْلُكْ بِنَا سَبِيلَهُ، وَاجْعَلْنَا مِنْ أَهْلِ طَاعَتِهِ، وَاحْشُرْنَا فِي زُمْرَتِهِ، وَأَوْرِدْنَا حَوْضَهُ، وَاسْقِنَا بِكَأْسِهِ، وَصَلِّ اللَّهُمَّ عَلَى مُحَمَّدٍ وَآلِهِ، صَلاَةً تُبَلِّغُهُ بِهَا أَفْضَلَ مَا يَأْمُلُ مِنْ خَيْرِكَ وَفَضْلِكَ وَكَرَامَتِكَ، إِنَّكَ ذُو رَحْمَةٍ وَاسِعَةٍ، وَفَضْلٍ كَرِيمٍ.

اللَّهُمَّ اجْزِهِ بِمَا بَلَّغَ مِنْ رِسَالاَتِكَ، وَأَدَّى مِنْ آيَاتِكَ، وَنَصَحَ لِعِبَادِكَ، أَفْضَلَ مَا جَزَيْتَ أَحَداً مِنْ مَلاَئِكَتِكَ الْمُقَرَّبِينَ، وَأَنْبِيَائِكَ الْمُرْسَلِينَ الْمُصْطَفَيْنَ، وَالسَّلاَمُ عَلَيْهِ وَعَلَى آلِهِ الطَّيِّبِينَ الطَّاهِرِينَ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ.''',
    benefits: "الدعاء الثاني والأربعون من الصحيفة السجادية، دعاء عظيم الشأن يقرأ عند ختم كتاب الله عز وجل لطلب بركة القرآن ومغفرة الذنوب.",
  ),
  Dua(
    title: "دعاء القاموس",
    text: r'''بِسمِ الله الرَّحمنِ الرَّحيمِ، رَبِّ أدخِلني في لُجَّةِ بَحرِ أحَديَّتِكَ، وَطَمطامِ يَمِّ وَحدانيَّتِكَ، وَقَوِّني بِقوَّةِ سَطوَةِ سُلطانِ فَردانيَّتِكَ، حَتَّى أخرُجَ إلى فَضاءِ سَعَةِ رَحمَتِكَ، وَفي وَجهي لَمَعاتُ بَرقِ القُربِ مِن آثارِ حِمايَتِكَ، مَهيباً بِهَيبَتِكَ، عَزيزاً بِعِنايَتِكَ، مُتَجَلِّلاً مُكَرَّماً بِتَعليمِكَ وَتَزكيَـتِكَ، وَألبِسني خِلَعَ العِزَّةِ وَالقَبولِ، وَسَهِّل لي مَناهِجَ الوُصلَةِ وَالوُصولِ، وَتَوِّجني بِتاجِ الكَرامَةِ وَالوَقارِ، وَألِّف بَيني وَبَينَ أحِبَّائِكَ في دارِ الدُّنيا وَدارِ القَرارِ، وَارزُقني مِن نورِ اسمِكَ هَيبَةً وَسَطوَةً تَنقادُ ليَ القُلوبُ وَالأرواحُ، وَتَخضَعُ لَدَيَّ النُّفوسُ وَالأشباحُ، يا مَن ذَلَّت لَهُ رِقابُ الجَبابِرَةِ، وَخَضَعَت لَدَيهِ أعناقُ الاكاسِرَةِ، لا مَلجَأ وَلا مَنجى مِنكَ إلاّ إلَيكَ، وَلا إعانَةَ إلاّ بِكَ، وَلا اتِّكاءَ إلاّ عَلَيكَ، ادفَع عَنّي كَيدَ الحاسِدينَ، وَظُلُماتِ شَرِّ المُعانِدينَ، وَارحَمني تَحتَ سُرادِقاتِ عَرشِكَ يا أكرَمَ الاكرَمينَ.

أيِّد ظاهِري في تَحصيلِ مَراضيكَ، وَنَوِّر قَلبي وَسِرّي بِالاطِّلاعِ عَلى مَناهِجِ مَساعيكَ، إلهي كَيفَ أصدُرُ عَن بابِكَ بِخَيبَةٍ مِنكَ وَقَد وَرَدتُهُ عَلى ثِقَةٍ بِكَ؟ وَكَيفَ تُؤيِسُني مِن عَطائِكَ وَقَد أمَرتَني بِدُعائِكَ؟ وَها أنا مُقبِلٌ عَلَيكَ مُلتَجئٌ إلَيكَ، باعِد بَيني وَبَينَ أعدائي كَما باعَدتَ بَينَ أعدائي، اختَطِف أبصارَهُم عَنّي بِنورِ قُدسِكَ وَجَلالِ مَجدِكَ، إنَّكَ أنتَ اللهُ المُعطي جَلائِلَ النِّعَمِ المُكَرَّمَةِ لِمَن ناجاكَ بِلَطائِفِ رَحمَتِكَ، يا حَيُّ يا قَيّومُ، يا ذا الجَلالِ وَالإكرامِ، وَصَلَّى اللهُ عَلى سَيِّدِنا وَنبيِّنا مُحَمَّدٍ وآلِهِ أجمَعينَ الطَّيِّبينَ الطَّاهِرينَ.''',
    benefits: "دعاء القاموس (السيفي الصغير) المروي في الصحيفة العلوية، ذو آثار عجيبة في الحفظ والتحصين وقضاء الحوائج ودفع كيد الأعداء.",
  ),
  Dua(
    title: "دعاء يوم عرفة",
    text: r'''الْحَمْدُ لِلّٰهِ الَّذِى لَيْسَ لِقَضائِهِ دافِعٌ ، وَلَا لِعَطائِهِ مانِعٌ ، وَلَا كَصُنْعِهِ صُنْعُ صانِعٍ ، وَهُوَ الْجَوادُ الْواسِعُ ، فَطَرَ أَجْناسَ الْبَدائِعِ ، وَأَتْقَنَ بِحِكْمَتِهِ الصَّنائِعَ ، لَا تَخْفىٰ عَلَيْهِ الطَّلائِعُ ، وَلَا تَضِيعُ عِنْدَهُ الْوَدائِعُ ، جازِى كُلِّ صانِعٍ ، وَرايِشُ كُلِّ قانِعٍ ، وَراحِمُ كُلِّ ضارِعٍ ، وَ مُنْزِلُ الْمَنافِعِ وَالْكِتابِ الْجامِعِ بِالنُّورِ السَّاطِعِ، وَهُوَ لِلدَّعَواتِ سامِعٌ، وَ لِلْكُرُباتِ دافِعٌ ، وَلِلدَّرَجاتِ رافِعٌ ، وَ لِلْجَبابِرَةِ قامِعٌ؛ فَلا إِلٰهَ غَيْرُهُ ، وَلَا شَىْءَ يَعْدِلُهُ ، وَلَيْسَ كَمِثْلِهِ شَىْءٌ ، وَهُوَ السَّمِيعُ الْبَصِيرُ اللَّطِيفُ الْخَبِيرُ ، وَهُوَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ .

اللّٰهُمَّ إِنِّى أَرْغَبُ إِلَيْكَ وَأَشْهَدُ بِالرُّبُوبِيَّةِ لَكَ مُقِرّاً بِأَنَّكَ رَبِّى ، وَأَنَّ إِلَيْكَ مَرَدِّى ، ابْتَدَأْتَنِى بِنِعْمَتِكَ قَبْلَ أَنْ أَكُونَ شَيْئاً مَذْكُوراً ، وَخَلَقْتَنِى مِنَ التُّرابِ ، ثُمَّ أَسْكَنْتَنِى الْأَصْلابَ آمِناً لِرَيْبِ  الْمَنُونِ ، وَاخْتِلافِ الدُّهُورِ وَالسِّنِينَ؛

فَلَمْ أَزَلْ ظاعِناً مِنْ صُلْبٍ إِلىٰ رَحِمٍ فِى تَقادُمٍ مِنَ الْأَيَّامِ الْماضِيَةِ وَالْقُرُونِ الْخالِيَةِ لَمْ تُخْرِجْنِى لِرَأْفَتِكَ بِى وَلُطْفِكَ لِى  وَ إِحْسانِكَ إِلَىَّ فِى دَوْلَةِ أَئِمَّةِ الْكُفْرِ الَّذِينَ نَقَضُوا عَهْدَكَ وَكَذَّبُوا رُسُلَكَ ، لَكِنَّكَ أَخْرَجْتَنِى رَأْفَةً مِنْكَ وَتَحَنُّناً عَلَىَّ  لِلَّذِى سَبَقَ لِى مِنَ الْهُدَى الَّذِى لَهُ يَسَّرْتَنِى وَفِيهِ أَنْشَأْتَنِى ، وَمِنْ قَبْلِ ذٰلِكَ رَؤُفْتَ بِى بِجَمِيلِ صُنْعِكَ وَسَوابِغِ نِعَمِكَ فَابْتَدَعْتَ خَلْقِى مِنْ مَنِيٍّ يُمْنىٰ ، وَأَسْكَنْتَنِي فِي ظُلُماتٍ ثَلاثٍ بَيْنَ لَحْمٍ وَدَمٍ وَجِلْدٍ؛

لَمْ تُشْهِدْنِى خَلْقِى ، وَلَمْ تَجْعَلْ إِلَىَّ شَيْئاً مِنْ أَمْرِى ، ثُمَّ أَخْرَجْتَنِى لِلَّذِى سَبَقَ لِى مِنَ الْهُدىٰ إِلَى الدُّنْيا تامّاً سَوِيّاً ، وَحَفِظْتَنِى فِى الْمَهْدِ طِفْلاً صَبِيّاً ، وَرَزَقْتَنِى مِنَ الْغِذاءِ لَبَناً مَرِيّاً ، وَعَطَفْتَ عَلَىَّ قُلُوبَ الْحَواضِنِ ، وَكَفَّلْتَنِى الْأُمَّهاتِ الرَّواحِمَ  ، وَكَلَأْتَنِى مِنْ طَوارِقِ الْجانِّ ، وَسَلَّمْتَنِى مِنَ الزِّيادَةِ وَالنُّقْصانِ ، فَتَعالَيْتَ يَا رَحِيمُ يَا رَحْمٰنُ ، حَتَّىٰ إِذَا اسْتَهْلَلْتُ ناطِقاً بِالْكَلامِ؛

أَتْمَمْتَ عَلَىَّ سَوابِغَ الْإِنْعامِ ، وَرَبَّيتَنِى زائِداً فِى كُلِّ عامٍ ، حَتَّىٰ إِذَا اكْتَمَلَتْ فِطْرَتِى وَاعْتَدَلَتْ مِرَّتِى  أَوْجَبْتَ عَلَىَّ حُجَّتَكَ بِأَنْ أَلْهَمْتَنِى مَعْرِفَتَكَ ، وَرَوَّعْتَنِى  بِعَجائِبِ حِكْمَتِكَ ، وَأَيْقَظْتَنِى لِما ذَرَأْتَ فِى سَمائِكَ وَأَرْضِكَ مِنْ بَدائِعِ خَلْقِكَ ، وَنَبَّهْتَنِى لِشُكْرِكَ وَذِكْرِكَ ، وَأَوْجَبْتَ عَلَىَّ طاعَتَكَ وَعِبادَتَكَ ، وَفَهَّمْتَنِى مَا جاءَتْ بِهِ رُسُلُكَ ، وَيَسَّرْتَ لِى تَقَبُّلَ مَرْضاتِكَ ، وَمَنَنْتَ عَلَىَّ فِى جَمِيعِ ذٰلِكَ بِعَوْنِكَ وَلُطْفِكَ؛

ثُمَّ إِذْ خَلَقْتَنِى مِنْ خَيْرِ الثَّرىٰ، لَمْ تَرْضَ لِى يَا إِلٰهِى نِعْمَةً  دُونَ أُخْرىٰ ، وَرَزَقْتَنِى مِنْ أَنْواعِ الْمَعاشِ وَصُنُوفِ الرِّياشِ بِمَنِّكَ الْعَظِيمِ الْأَعْظَمِ عَلَىَّ ، وَ إِحْسانِكَ الْقَدِيمِ إِلَىَّ ، حَتَّىٰ إِذا أَتْمَمْتَ عَلَىَّ جَمِيعَ النِّعَمِ وَصَرَفْتَ عَنِّى كُلَّ النِّقَمِ لَمْ يَمْنَعْكَ جَهْلِى وَجُرْأَتِى عَلَيْكَ أَنْ دَلَلْتَنِى إِلَىٰ  مَا يُقَرِّبُنِى إِلَيْكَ ، وَوَفَّقْتَنِى لِما يُزْ لِفُنِى لَدَيْكَ ، فَإِنْ دَعَوْتُكَ أَجَبْتَنِى ، وَ إِنْ سَأَلْتُكَ أَعْطَيْتَنِى ، وَ إِنْ أَطَعْتُكَ شَكَرْتَنِى ، وَ إِنْ شَكَرْتُكَ زِدْتَنِى؛

كُلُّ ذٰلِكَ إِكْمالٌ  لِأَنْعُمِكَ عَلَىَّ وَ إِحْسانِكَ إِلَىَّ ، فَسُبْحانَكَ سُبْحانَكَ مِنْ مُبْدِىً مُعِيدٍ حَمِيدٍ مَجِيدٍ ! وَتَقَدَّسَتْ أَسْماؤُكَ ، وَعَظُمَتْ آلاؤُكَ ، فَأَىُّ نِعَمِكَ يَا إِلٰهِى أُحْصِى عَدَداً وَذِكْراً ؟ أَمْ أَىُّ عَطاياكَ أَقُومُ بِها شُكْراً وَهِىَ يَا رَبِّ أَكْثَ‍رُ مِنْ أَنْ يُحْصِيهَا الْعادُّونَ ، أَوْ يَبْلُغَ عِلْماً بِهَا الْحافِظُونَ ؟ ثُمَّ مَا صَرَفْتَ وَدَرَأْتَ عَنِّى اللّٰهُمَّ مِنَ الضُّرِّ وَالضَّرَّاءِ أَكْثَرُ مِمَّا ظَهَرَ لِى مِنَ الْعافِيَةِ وَالسَّرَّاءِ ، وَأَنَا أَشْهَدُ يَا إِلٰهِى بِحَقِيقَةِ إِيمانِى؛

وَعَقْدِ عَزَماتِ يَقِينِى ، وَخالِصِ صَرِيحِ تَوْحِيدِى ، وَباطِنِ مَكْنُونِ ضَمِيرِى ، وَعَلائِقِ مَجارِى نُورِ بَصَرِى ، وَأَسارِيرِ صَفْحَةِ جَبِينِى ، وَخُرْقِ مَسارِبِ نَفْسِى  ، وَخَذارِيفِ مارِنِ عِرْنِينِى ، وَمَسارِبِ سِماخِ  سَمْعِى ، وَمَا ضُمَّتْ وَأَطْبَقَتْ عَلَيْهِ شَفَتاىَ ، وَحَرَكاتِ لَفْظِ لِسانِى ، وَمَغْرَزِ حَنَكِ فَمِى وَفَكِّى وَمَنابِتِ أَضْراسِى؛

وَمَساغِ مَطْعَمِى وَمَشْرَبِى ، وَحِمالَةِ أُمِّ رَأْسِى ، وَبُلُوعِ فارِغِ حَبائِلِ عُنُقِى ، وَمَا اشْتَمَلَ عَلَيْهِ تامُورُ صَدْرِى ، وَحَمائِلِ حَبْلِ وَتِينِى ، وَ نِياطِ حِجابِ قَلْبِى ، وَأَفْلاذِ حَواشِى كَبِدِى ، وَمَا حَوَتْهُ شَراسِيفُ أَضْلاعِى ، وَحِقاقُ مَفاصِلِى ، وَقَبْضُ عَوامِلِى ، وَأَطْرافُ أَنامِلِى ، وَلَحْمِى وَدَمِى وَشَعْرِى وَبَشَرِى وَعَصَبِى وَقَصَبِى وَعِظامِى وَمُخِّى وَعُرُوقِى وَجَمِيعُ جَوارِحِى وَمَا انْتَسَجَ عَلَىٰ ذٰلِكَ أَيَّامَ رِضاعِى ، وَمَا أَقَلَّتِ الْأَرْضُ مِنِّى وَنَوْمِى وَيَقْظَتِى وَسُكُونِى ، وَحَرَكاتِ رُكُوعِى وَسُجُودِى؛

أَنْ لَوْ حاوَلْتُ وَاجْتَهَدْتُ مَدَى الْأَعْصارِ وَالْأَحْقابِ لَوْ عُمِّرْتُها أَنْ أُؤَدِّىَ شُكْرَ واحِدَةٍ مِنْ أَنْعُمِكَ مَا اسْتَطَعْتُ ذٰلِكَ إِلّا بِمَنِّكَ الْمُوجَبِ عَلَىَّ بِهِ شُكْرُكَ أَبَداً جَدِيداً ، وَثَناءً طارِفاً عَتِيداً ، أَجَلْ وَلَوْ حَرَصْتُ أَنَا وَالْعادُّونَ مِنْ أَنامِكَ أَنْ نُحْصِىَ مَدىٰ إِنْعامِكَ سالِفِهِ وَآنِفِهِ مَا حَصَرْناهُ عَدَداً ، وَلَا أَحْصَيْناهُ أَمَداً ، هَيْهاتَ أَنَّىٰ ذٰلِكَ وَأَنْتَ الْمُخْبِرُ فِى كِتابِكَ النَّاطِقِ وَالنَّبَاَ الصَّادِقِ ﴿وَ إِنْ تَعُدُّوا نِعْمَةَ اللّٰهِ لاٰ تُحْصُوهٰا﴾؛

صَدَقَ كِتابُكَ اللّٰهُمَّ وَ إِنْباؤُكَ ، وَبَلَّغَتْ أَنْبِياؤُكَ وَرُسُلُكَ مَا أَنْزَلْتَ عَلَيْهِمْ مِنْ وَحْيِكَ ، وَشَرَعْتَ لَهُمْ وَبِهِمْ مِنْ دِينِكَ ، غَيْرَ أَنِّى يَا إِلٰهِى أَشْهَدُ بِجَُهْدِى وَجِدِّى وَمَبْلَغِ طاعَتِى  وَوُسْعِى ، وَأَقُولُ مُؤْمِناً مُوقِناً الْحَمْدُلِلّٰهِ الَّذِى لَمْ يَتَّخِذْ وَلَداً فَيَكُونُ‌َ مَوْرُوثاً ، وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِى مُلْكِهِ فَيُضادَّهُ فِيَما ابْتَدَعَ؛

وَلَا وَلِيٌّ مِنَ الذُّلِّ فَيُرْفِدَهُ فِيما صَنَعَ ، فَسُبْحانَهُ سُبْحانَهُ ﴿لَوْ كانَ فِيهِما آلِهَةٌ إِلّا اللّٰهُ لَفَسَدَتا﴾ وَتَفَطَّرَتا ! سُبْحانَ اللّٰهِ الْواحِدِ الْأَحَدِ الصَّمَدِ الَّذِى لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ ! الْحَمْدُلِلّٰهِ حَمْداً يُعادِلُ حَمْدَ مَلائِكَتِهِ الْمُقَرَّبِينَ وَأَنْبِيائِهِ الْمُرْسَلِينَ ، وَصَلَّى اللّٰهُ عَلَىٰ خِيَرَتِهِ مُحَمَّدٍ خاتَِمِ النَّبِيِّينَ وَآلِهِ الطَّيِّبِينَ الطَّاهِرِينَ الْمُخْلَصِينَ وَسَلَّمَ.

اللّٰهُمَّ اجْعَلْنِى أَخْشاكَ كَأَنِّى أَراكَ ، وَأَسْعِدْنِى بِتَقْواكَ ، وَلَا تُشْقِنِى بِمَعْصِيَتِكَ ، وَخِرْ لِى فِى قَضائِكَ ، وَبارِكْ لِى فِى قَدَرِكَ ، حَتَّىٰ لَاأُحِبَّ تَعْجِيلَ مَا أَخَّرْتَ وَلَا تَأْخِيرَ مَا عَجَّلْتَ .

اللّٰهُمَّ اجْعَلْ غِناىَ فِى نَفْسِى ، وَالْيَقِينَ فِى قَلْبِى ، وَالْإِخْلاصَ فِى عَمَلِى ، وَالنُّوْرَ فِى بَصَرِى ، وَالْبَصِيرَةَ فِى دِينِى ، وَمَتِّعْنِى بِجَوارِحِى ، وَاجْعَلْ سَمْعِى وَبَصَرِى الْوارِثَيْنِ مِنِّى ، وَانْصُرْنِى عَلَىٰ مَنْ ظَلَمَنِى ، وَأَرِنِى فِيهِ ثارِى وَمَآرِبِى ، وَأَقِرَّ بِذٰلِكَ عَيْنِى .

اللّٰهُمَّ اكْشِفْ كُرْبَتِى ، وَاسْتُرْ عَوْرَتِى ، وَاغْفِرْ لِى خَطِيئَتِى ، وَاخْسَأْ شَيْطانِى ، وَفُكَّ رِهانِى ، وَاجْعَلْ لِى يَا إِلٰهِى الدَّرَجَةَ الْعُلْيا فِى الْآخِرَةِ وَالْأُولىٰ؛

اللّٰهُمَّ لَكَ الْحَمْدُ كَما خَلَقْتَنِى فَجَعَلْتَنِى سَمِيعاً بَصِيراً ، وَلَكَ الْحَمْدُ كَما خَلَقْتَنِى فَجَعَلْتَنِى خَلْقاً سَوِيّاً رَحْمَةً بِى وَقَدْ كُنْتَ عَنْ خَلْقِى غَنِيّاً ، رَبِّ بِما بَرَأْتَنِى فَعَدَّلْتَ فِطْرَتِى ، رَبِّ بِما أَنْشَأْتَنِى فَأَحْسَنْتَ صُورَتِى ، رَبِّ بِما أَحْسَنْتَ إِلَىَّ  وَفِى نَفْسِى عافَيْتَنِى ، رَبِّ بِما كَلَأْتَنِى وَوَفَّقْتَنِى ، رَبِّ بِما أَنْعَمْتَ عَلَىَّ فَهَدَيْتَنِى ، رَبِّ بِما أَوْلَيْتَنِى وَمِنْ كُلِّ خَيْرٍ أَعْطَيْتَنِى ، رَبِّ بِما أَطْعَمْتَنِى وَسَقَيْتَنِى ، رَبِّ بِما أَغْنَيْتَنِى وَأَقْنَيْتَنِى ، رَبِّ بِما أَعَنْتَنِى وَأَعْزَزْتَنِى، رَبِّ بِما أَلْبَسْتَنِى مِنْ سِتْرِكَ الصَّافِى ، وَيَسَّرْتَ لِى مِنْ صُنْعِكَ الْكافِى ؛ صَلِّ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ ، وَأَعِنِّى عَلَىٰ بَوائِقِ الدُّهُورِ وَصُرُوفِ اللَّيالِى وَالْأَيَّامِ ، وَنَجِّنِى مِنْ أَهْوالِ الدُّنْيا وَكُرُباتِ الْآخِرَةِ ، وَاكْفِنِى شَرَّ مَا يَعْمَلُ الظَّالِمُونَ فِى الْأَرْضِ .

اللّٰهُمَّ مَا أَخافُ فَاكْفِنِى ، وَمَا أَحْذَرُ فَقِنِى ، وَفِى نَفْسِى وَدِينِى فَاحْرُسْنِى ، وَفِى سَفَرِى فَاحْفَظْنِى ، وَفِى أَهْلِى وَمالِى فَاخْلُفْنِى ، وَفِيما رَزَقْتَنِى فَبارِكْ لِى ، وَفِى نَفْسِى فَذَلِّلْنِى ، وَفِى أَعْيُنِ النَّاسِ فَعَظِّمْنِى ، وَمِنْ شَرِّ الْجِنِّ وَالْإِنْسِ فَسَلِّمْنِى ، وَبِذُنُوبِى فَلا تَفْضَحْنِى ، وَبِسَرِيرَتِى فَلا تُخْزِنِى ، وَبِعَمَلِى فَلا تَبْتَلِنِى ، وَ نِعَمَكَ فَلا تَسْلُبْنِى ، وَ إِلىٰ غَيْرِكَ فَلا تَكِلْنِى؛

إِلٰهِى إِلىٰ مَنْ تَكِلُنِى ، إِلىٰ قَرِيبٍ فَيَقْطَعُنِى ، أَمْ إِلىٰ بَعِيدٍ فَيَتَجَهَّمُنِى ، أَمْ إِلَى الْمُسْتَضْعِفِينَ لِى وَأَنْتَ رَبِّى وَ مَلِيكُ أَمْرِى ؟ أَشْكُو إِلَيْكَ غُرْبَتِى ، وَبُعْدَ دارِى ، وَهَوانِى عَلَىٰ مَنْ مَلَّكْتَهُ أَمْرِى ، إِلٰهِى فَلاٰ تُحْلِلْ عَلَىَّ غَضَبَكَ ، فَإِنْ لَمْ تَكُنْ غَضِبْتَ عَلَىَّ فَلا أُبالِى سِواكَ ، سُبْحانَكَ غَيْرَ أَنَّ عافِيَتَكَ أَوْسَعُ لِى ، فَأَسْأَلُكَ يَا رَبِّ بِنُورِ وَجْهِكَ الَّذِى أَشْرَقَتْ لَهُ الْأَرْضُ وَالسَّماواتُ ، وَكُشِفَتْ بِهِ الظُّلُماتُ؛

وَصَلَُحَ بِهِ أَمْرُ الْأَوَّلِينَ وَالْآخِرِينَ أَنْ لَاتُمِيتَنِى عَلَىٰ غَضَبِكَ وَلَا تُنْزِلْ بِى سَخَطَكَ ، لَكَ الْعُتْبىٰ ، لَكَ الْعُتْبىٰ حَتَّىٰ تَرْضىٰ قَبْلَ ذٰلِكَ لَاإِلٰهَ إِلّا أَنْتَ رَبَّ الْبَلَدِ الْحَرامِ وَالْمَشْعَرِ الْحَرامِ وَالْبَيْتِ الْعَتِيقِ الَّذِى أَحْلَلْتَهُ الْبَرَكَةَ وَجَعَلْتَهُ لِلنَّاسِ أَمْناً ، يَا مَنْ عَفا عَنْ عَظِيمِ الذُّنُوبِ بِحِلْمِهِ ، يَا مَنْ أَسْبَغَ النَّعْماءَ بِفَضْلِهِ ، يَا مَنْ أَعْطَى الْجَزِيلَ بِكَرَمِهِ ، يَا عُدَّتِى فِى شِدَّتِى ، يَا صاحِبِى فِى وَحْدَتِى ، يَا غِياثِى فِى كُرْبَتِى ، يَا وَلِيِّى فِى نِعْمَتِى ، يَا إِلٰهِى وَ إِلٰهَ آبائِى إِبْراهِيمَ وَ إِسْماعِيلَ وَ إِسْحاقَ وَيَعْقُوبَ وَرَبَّ جَبْرَئِيلَ وَمِيكائِيلَ  وَ إِسْرافِيلَ وَرَبَّ مُحَمَّدٍ خاتَِمِ النَّبِيِّينَ وَآلِهِ الْمُنْتَجَبِينَ ، وَ مُنْزِلَ التَّوْراةِ وَالْإِنْجِيلِ وَالزَّبُورِ وَالْفُرْقانِ وَمُنَزِّلَ كهيعص وَطٰهٰ وَيٰس وَالْقُرْآنِ الْحَكِيمِ؛

أَنْتَ كَهْفِى حِينَ تُعْيِينِى الْمَذاهِبُ فِى سَعَتِها ، وَتَضِيقُ بِىَ الْأَرْضُ بِرُحْبِها  ، وَلَوْلَا رَحْمَتُكَ لَكُنْتُ مِنَ الْهالِكِينَ ، وَأَنْتَ مُقِيلُ عَثْرَتِى ، وَلَوْلا سَتْرُكَ إِيَّاىَ لَكُنْتُ مِنَ الْمَفْضُوحِينَ ، وَأَنْتَ مُؤَيِّدِى بِالنَّصْرِ عَلَىٰ أَعْدائِى ، وَلَوْلا نَصْرُكَ إِيَّاىَ  لَكُنْتُ مِنَ الْمَغْلُوبِينَ ، يَا مَنْ خَصَّ نَفْسَهُ بِالسُّمُوِّ وَالرِّفْعَةِ فَأَوْلِياؤُهُ بِعِزِّهِ يَعْتَزُّونَ ، يَا مَنْ جَعَلَتْ لَهُ الْمُلُوكُ نِيرَ الْمَذَلَّةِ عَلَىٰ أَعْناقِهِمْ فَهُمْ مِنْ سَطَواتِهِ خائِفُونَ؛

يَعْلَمُ خائِنَةَ الْأَعْيُنِ وَمَا تُخْفِى الصُّدُورُ ، وَغَيْبَ مَا تَأْتِى بِهِ الْأَزْمِنَةُ وَالدُّهُورُ ، يَا مَنْ لَايَعْلَمُ كَيْفَ هُوَ إِلّا هُوَ ، يَا مَنْ لَايَعْلَمُ مَا هُوَ إِلّا هُوَ ، يَا مَنْ لَايَعْلَمُهُ إِلّا هُوَ  ، يَا مَنْ كَبَسَ الْأَرْضَ عَلَى الْماءِ وَسَدَّ الْهَواءَ بِالسَّماءِ ، يَا مَنْ لَهُ أَكْرَمُ الْأَسْماءِ ، يَا ذَا الْمَعْرُوفِ الَّذِى لَايَنْقَطِعُ أَبَداً ، يَا مُقَيِّضَ الرَّكْبِ لِيُوسُفَ فِى الْبَلَدِ الْقَفْرِ وَمُخْرِجَهُ مِنَ الْجُبِّ وَجاعِلَهُ بَعْدَ الْعُبُودِيَّةِ مَلِكاً ، يَا رادَّهُ عَلَىٰ يَعْقُوبَ بَعْدَ أَنِ ابْيَضَّتْ عَيْناهُ مِنَ الْحُزْنِ فَهُوَ كَظِيمٌ ، يَا كاشِفَ الضُّرِّ وَالْبَلْوىٰ عَنْ أَيُّوبَ ، وَمُمْسِكَ يَدَيْ إِبْراهِيمَ عَنْ ذَبْحِ ابْنِهِ بَعْدَ كِبَرِ سِنِّهِ وَفَناءِ عُمُرِهِ؛

يَا مَنِ اسْتَجابَ لِزَكَرِيَّا فَوَهَبَ لَهُ يَحْيىٰ وَلَمْ يَدَعْهُ فَرْداً وَحِيداً ، يَا مَنْ أَخْرَجَ يُونُسَ مِنْ بَطْنِ الْحُوتِ ، يَا مَنْ فَلَقَ الْبَحْرَ لِبَنِى إِسْرائِيلَ فَأَنْجاهُمْ وَجَعَلَ فِرْعَوْنَ وَجُنُودَهُ مِنَ الْمُغْرَقِينَ ، يَا مَنْ أَرْسَلَ الرِّياحَ مُبَشِّراتٍ بَيْنَ يَدَيْ رَحْمَتِهِ ، يَا مَنْ لَمْ يَعْجَلْ عَلَىٰ مَنْ عَصاهُ مِنْ خَلْقِهِ ، يَا مَنِ اسْتَنْقَذَ السَّحَرَةَ مِنْ بَعْدِ طُولِ الْجُحُودِ وَقَدْ غَدَوْا فِى نِعْمَتِهِ يَأْكُلُونَ رِزْقَهُ ، وَيَعْبُدُونَ غَيْرَهُ وَقَدْ حادُّوهُ وَنادُّوهُ وَكَذَّبُوا رُسُلَهُ؛

يَا اللّٰهُ يَا اللّٰهُ يَا بَدِىءُ ، يَا بَدِيعُ لَانِدَّ لَكَ  ، يَا دائِماً لَانَفادَ لَكَ ، يَا حَيّاً حِينَ لَاحَىَّ ، يَا مُحْيِىَ الْمَوْتىٰ ، يَا مَنْ هُوَ قائِمٌ عَلَىٰ كُلِّ نَفْسٍ بِما كَسَبَتْ ، يَا مَنْ قَلَّ لَهُ شُكْرِى فَلَمْ يَحْرِمْنِى ، وَعَظُمَتْ خَطِيئَتِى فَلَمْ يَفْضَحْنِى ، وَرَآنِى عَلَى الْمَعاصِى فَلَمْ يَشْهَرْنِى  ، يَا مَنْ حَفِظَنِى فِى صِغَرِى ، يَا مَنْ رَزَقَنِى فِى كِبَرِى ، يَا مَنْ أَيَادِيهِ عِنْدِى لَاتُحْصىٰ ، وَ نِعَمُهُ لَاتُجازىٰ ، يَا مَنْ عارَضَنِى بِالْخَيْرِ وَالْإِحْسانِ وَعارَضْتُهُ بِالْإِساءَةِ وَالْعِصْيانِ ، يَا مَنْ هَدانِى لِلْإِيمانِ مِنْ قَبْلِ أَنْ أَعْرِفَ شُكْرَ الامْتِنانِ ، يَا مَنْ دَعَوْتُهُ مَرِيضاً فَشَفانِى؛

وَعُرْياناً فَكَسانِى ، وَجائِعاً فَأَشْبَعَنِى ، وَعَطْشاناً فَأَرْوانِى ، وَذَلِيلاً فَأَعَزَّنِى ، وَجاهِلاً فَعَرَّفَنِى ، وَوَحِيداً فَكَثَّرَنِى ، وَغائِباً فَرَدَّنِى ، وَمُقِلّاً فَأَغْنانِى ، وَمُنْتَصِراً فَنَصَرَنِى ، وَغَنِيّاً فَلَمْ يَسْلُبْنِى ، وَأَمْسَكْتُ عَنْ جَمِيعِ ذٰلِكَ فَابْتَدَأَنِى ، فَلَكَ الْحَمْدُ وَالشُّكْرُ يَا مَنْ أَقالَ عَثْرَتِى ، وَنَفَّسَ كُرْبَتِى ، وَأَجابَ دَعْوَتِى ، وَسَتَرَ عَوْرَتِى ، وَغَفَرَ ذُنُوبِى ، وَبَلَّغَنِى طَلِبَتِى ، وَنَصَرَنِى عَلَىٰ عَدُوِّى ، وَ إِنْ أَعُدَّ نِعَمَكَ وَمِنَنَكَ وَكَرائِمَ مِنَحِكَ لَاأُحْصِيها؛

يَا مَوْلاىَ أَنْتَ الَّذِى مَنَنْتَ ، أَنْتَ الَّذِى أَنْعَمْتَ ، أَنْتَ الَّذِى أَحْسَنْتَ ، أَنْتَ الَّذِى أَجْمَلْتَ ، أَنْتَ الَّذِى أَفْضَلْتَ ، أَنْتَ الَّذِى أَكْمَلْتَ ، أَنْتَ الَّذِى رَزَقْتَ ، أَنْتَ الَّذِى وَفَّقْتَ ، أَنْتَ الَّذِى أَعْطَيْتَ ، أَنْتَ الَّذِى أَغْنَيْتَ ، أَنْتَ الَّذِى أَقْنَيْتَ ، أَنْتَ الَّذِى آوَيْتَ ، أَنْتَ الَّذِى كَفَيْتَ ، أَنْتَ الَّذِى هَدَيْتَ ، أَنْتَ الَّذِى عَصَمْتَ ، أَنْتَ الَّذِى سَتَرْتَ ، أَنْتَ الَّذِى غَفَرْتَ ، أَنْتَ الَّذِى أَقَلْتَ ، أَنْتَ الَّذِى مَكَّنْتَ ، أَنْتَ الَّذِى أَعْزَزْتَ ، أَنْتَ الَّذِى أَعَنْتَ ، أَنْتَ الَّذِى عَضَدْتَ ، أَنْتَ الَّذِى أَيَّدْتَ ، أَنْتَ الَّذِى نَصَرْتَ ، أَنْتَ الَّذِى شَفَيْتَ ، أَنْتَ الَّذِى عافَيْتَ ، أَنْتَ الَّذِى أَكْرَمْتَ؛

تَبارَكْتَ وَتَعالَيْتَ ، فَلَكَ الْحَمْدُ دائِماً ، وَلَكَ الشُّكْرُ واصِباً أَبَداً ، ثُمَّ أَنَا يَا إِلٰهِىَ الْمُعْتَرِفُ بِذُنُوبِى فَاغْفِرْها لِى ، أَنَا الَّذِى أَسَأْتُ ، أَنَا الَّذِى أَخْطَأْتُ ، أَنَا الَّذِى هَمَمْتُ ، أَنَا الَّذِى جَهِلْتُ ، أَنَا الَّذِى غَفَلْتُ ، أَنَا الَّذِى سَهَوْتُ ، أَنَا الَّذِى اعْتَمَدْتُ ، أَنَا الَّذِى تَعَمَّدْتُ ، أَنَا الَّذِى وَعَدْتُ ، وَأَنَا الَّذِى أَخْلَفْتُ ، أَنَا الَّذِى نَكَثْتُ ، أَنَا الَّذِى أَقْرَرْتُ ، أَنَا الَّذِى اعْتَرَفْتُ بِنِعْمَتِكَ عَلَىَّ وَعِنْدِى وَأَبُوءُ بِذُنُوبِى فَاغْفِرْها لِى ، يَا مَنْ لَاتَضُرُّهُ ذُنُوبُ عِبادِهِ وَهُوَ الْغَنِىُّ عَنْ طاعَتِهِمْ ، وَالْمُوَفِّقُ مَنْ عَمِلَ صالِحاً مِنْهُمْ بِمَعُونَتِهِ وَرَحْمَتِهِ ، فَلَكَ الْحَمْدُ إِلٰهِى وَسَيِّدِى؛

إِلٰهِى أَمَرْتَنِى فَعَصَيْتُكَ ، وَنَهَيْتَنِى فَارْتَكَبْتُ نَهْيَكَ ، فَأَصْبَحْتُ لَاذا بَراءَةٍ لِى  فَأَعْتَذِرَُ، وَلَا ذا قُوَّةٍ فَأَنْتَصِرَُ ، فَبِأَيِّ شَىْءٍ أَسْتَقْبِلُكَ  يَا مَوْلاىَ ؟ أَبِسَمْعِى ؟ أَمْ بِبَصَرِى ؟ أَمْ بِلِسانِى ؟ أَمْ بِيَدِى ؟ أَمْ بِرِجْلِى ؟ أَلَيْسَ كُلُّها نِعَمَكَ عِنْدِى وَبِكُلِّها عَصَيْتُكَ يَا مَوْلاىَ؟ فَلَكَ الْحُجَّةُ وَالسَّبِيلُ عَلَىَّ ، يَا مَنْ سَتَرَنِى مِنَ الْآباءِ وَالْأُمَّهاتِ أَنْ يَزْجُرُونِى ، وَمِنَ الْعَشائِرِ وَالْإِخْوانِ أَنْ يُعَيِّرُونِى ، وَمِنَ السَّلاطِينِ أَنْ يُعاقِبُونِى ، وَلَوِ اطَّلَعُوا يَا مَوْلاىَ عَلَىٰ مَا اطَّلَعْتَ عَلَيْهِ مِنِّى إِذاً مَا أَنْظَرُونِى ، وَلَرَفَضُونِى وَقَطَعُونِى ، فَها أَنَا ذا يَا إِلٰهِى ، بَيْنَ يَدَيْكَ يَا سَيِّدِى؛

خاضِعٌ ذَلِيلٌ حَصِيرٌ حَقِيرٌ ، لَاذُو بَراءَةٍ فَأَعْتَذِرَُ ، وَلَا ذُو قُوَّةٍ فَأَنْتَصِرَُ ، وَلَا حُجَّةٍ فَأَحْتَجَ‌ُّ بِها ، وَلَا قائِلٌ لَمْ أَجْتَرِحْ وَلَمْ أَعْمَلْ سُوءاً ، وَمَا عَسَى الْجُحُودُ وَلَوْ جَحَدْتُ يَا مَوْلاىَ يَنْفَعُنِى ، كَيْفَ وَأَنَّىٰ ذٰلِكَ وَجَوارِحِى كُلُّها شاهِدَةٌ عَلَىَّ بِما قَدْ عَمِلْتُ  ، وَعَلِمْتُ يَقِيناً غَيْرَ ذِى شَكٍّ أَنَّكَ سائِلِى مِنْ عَظائِمِ الْأُمُورِ ، وَأَنَّكَ الْحَكَمُ الْعَدْلُ الَّذِى لَاتَجُورُ ، وَعَدْلُكَ مُهْلِكِى وَمِنْ كُلِّ عَدْلِكَ مَهْرَبِى ، فَإِنْ تُعَذِّبْنِى يَا إِلٰهِى فَبِذُنُوبِى بَعْدَ حُجَّتِكَ عَلَىَّ ، وَ إِنْ تَعْفُ عَنِّى فَبِحِلْمِكَ وَجُودِكَ وَكَرَمِكَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الظَّالِمِينَ؛

لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الْمُسْتَغْفِرِينَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الْمُوَحِّدِينَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الْخائِفِينَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الْوَجِلِينَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الرَّاجِينَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الرَّاغِبِينَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الْمُهَلِّلِينَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ السَّائِلِينَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الْمُسَبِّحِينَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الْمُكَبِّرِينَ ، لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ رَبِّى وَرَبُّ آبائِىَ الْأَوَّلِينَ؛

اللّٰهُمَّ هٰذَا ثَنائِى عَلَيْكَ مُمَجِّداً ، وَ إِخْلاصِى لِذِكْرِكَ مُوَحِّداً ، وَ إِقْرارِى بِآلائِكَ مُعَدِّداً ، وَ إِنْ كُنْتُ مُقِرّاً أَنِّى لَمْ أُحْصِها لِكَثْرَتِها وَسُبُوغِها وَتَظاهُرِها وَتَقادُمِها إِلىٰ حادِثٍ مَا لَمْ تَزَلْ تَتَعَهَّدُنِى  بِهِ مَعَها مُنْذُ خَلَقْتَنِى وَبَرَأْتَنِى مِنْ أَوَّلِ الْعُمْرِ مِنَ الْإِغْناءِ مِنَ الْفَقْرِ ، وَكَشْفِ الضُّرِّ ، وَتَسْبِيبِ الْيُسْرِ ، وَدَفْعِ الْعُسْرِ ، وَتَفْرِيجِ الْكَرْبِ ، وَالْعافِيَةِ فِى الْبَدَنِ ، وَالسَّلامَةِ فِى الدِّينِ ، وَلَوْ رَفَدَنِى عَلَىٰ قَدْرِ ذِكْرِ نِعْمَتِكَ جَمِيعُ الْعالَمِينَ مِنَ الْأَوَّلِينَ وَالْآخِرِينَ مَا قَدَرْتُ وَلَا هُمْ عَلَىٰ ذٰلِكَ ، تَقَدَّسْتَ وَتَعالَيْتَ مِنْ رَبٍّ كَرِيمٍ عَظِيمٍ رَحِيمٍ لَاتُحْصىٰ آلاؤُكَ ، وَلَا يُبْلَغُ ثَناؤُكَ؛ وَلَا تُكافىٰ نَعْماؤُكَ ، صَلِّ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَتْمِمْ عَلَيْنا نِعَمَكَ ، وَأَسْعِدْنا بِطاعَتِكَ ، سُبْحانَكَ لَاإِلٰهَ إِلّا أَنْتَ .

اللّٰهُمَّ إِنَّكَ تُجِيبُ الْمُضْطَرَّ ، وَتَكْشِفُ السُّوءَ ، وَتُغِيثُ الْمَكْرُوبَ ، وَتَشْفِى السَّقِيمَ ، وَتُغْنِى الْفَقِيرَ ، وَتَجْبُرُ الْكَسِيرَ ، وَتَرْحَمُ الصَّغِيرَ ، وَتُعِينُ الْكَبِيرَ ، وَلَيْسَ دُونَكَ ظَهِيرٌ ، وَلَا فَوْقَكَ قَدِيرٌ ، وَأَنْتَ الْعَلِىُّ الْكَبِيرُ ، يَا مُطْلِقَ الْمُكَبَّلِ الْأَسِيرِ ، يَا رازِقَ الطِّفْلِ الصَّغِيرِ ، يَا عِصْمَةَ الْخائِفِ الْمُسْتَجِيرِ ، يَا مَنْ لَاشَرِيكَ لَهُ وَلَا وَزِيرَ؛

صَلِّ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ ، وَأَعْطِنِى فِى هٰذِهِ الْعَشِيَّةِ أَفْضَلَ مَا أَعْطَيْتَ وَأَنَلْتَ أَحَداً مِنْ عِبادِكَ مِنْ نِعْمَةٍ تُولِيها ، وَآلاءٍ تُجَدِّدُها ، وَبَلِيَّةٍ تَصْرِفُها ، وَكُرْبَةٍ تَكْشِفُها ، وَدَعْوَةٍ تَسْمَعُها ، وَحَسَنَةٍ تَتَقَبَّلُها ، وَسَيِّئَةٍ تَتَغَمَّدُها ، إِنَّكَ لَطِيفٌ بِما تَشاءُ خَبِيرٌ وَعَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ .

اللّٰهُمَّ إِنَّكَ أَقْرَبُ مَنْ دُعِىَ ، وَأَسْرَعُ مَنْ أَجابَ ، وَأَكْرَمُ مَنْ عَفا ، وَأَوْسَعُ مَنْ أَعْطىٰ ، وَأَسْمَعُ مَنْ سُئِلَ ، يَا رَحْمٰنَ الدُّنْيا وَالْآخِرَةِ وَرَحِيمَهُما ، لَيْسَ كَمِثْلِكَ مَسْؤُولٌ ، وَلَا سِواكَ مَأْمُولٌ ، دَعَوْتُكَ فَأَجَبْتَنِى ، وَسَأَلْتُكَ فَأَعْطَيْتَنِى ، وَرَغِبْتُ إِلَيْكَ فَرَحِمْتَنِى ، وَوَثِقْتُ بِكَ فَنَجَّيْتَنِى ، وَفَزِعْتُ إِلَيْكَ فَكَفَيْتَنِى؛

اللّٰهُمَّ فَصَلِّ عَلَىٰ مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ وَنَبِيِّكَ وَعَلَىٰ آلِهِ الطَّيِّبِينَ الطَّاهِرِينَ أَجْمَعِينَ ، وَتَمِّمْ لَنا نَعْماءَكَ ، وَهَنِّئْنا عَطاءَكَ ، وَاكْتُبْنا لَكَ شاكِرِينَ ، وَلِآلائِكَ ذاكِرِينَ ، آمِينَ آمِينَ رَبَّ الْعالَمِينَ .

اللّٰهُمَّ يَا مَنْ مَلَكَ فَقَدَرَ ، وَقَدَرَ فَقَهَرَ ، وَعُصِىَ فَسَتَرَ ، وَاسْتُغْفِرَ فَغَفَرَ ، يَا غايَةَ الطَّالِبِينَ الرَّاغِبِينَ وَمُنْتَهىٰ أَمَلِ الرَّاجِينَ ، يَا مَنْ أَحاطَ بِكُلِّ شَىْءٍ عِلْماً ، وَوَسِعَ الْمُسْتَقِيلِينَ رَأْفَةً وَرَحْمَةً وَحِلْماً؛

اللّٰهُمَّ إِنَّا نَتَوَجَّهُ إِلَيْكَ فِى هٰذِهِ الْعَشِيَّةِ الَّتِى شَرَّفْتَها وَعَظَّمْتَها بِمُحَمَّدٍ نَبِيِّكَ وَرَسُولِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ وَأَمِينِكَ عَلَىٰ وَحْيِكَ ، الْبَشِيرِ النَّذِيرِ ، السِّراجِ الْمُنِيرِ ، الَّذِى أَنْعَمْتَ بِهِ عَلَى الْمُسْلِمِينَ وَجَعَلْتَهُ رَحْمَةً لِلْعالَمِينَ .

اللّٰهُمَّ فَصَلِّ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَما مُحَمَّدٌ أَهْلٌ لِذٰلِكَ مِنْكَ يَا عَظِيمُ فَصَلِّ عَلَيْهِ وَعَلَىٰ آلِهِ الْمُنْتَجَبِينَ الطَّيِّبِينَ الطَّاهِرِينَ أَجْمَعِينَ ، وَتَغَمَّدْنا بِعَفْوِكَ عَنَّا ، فَإِلَيْكَ عَجَّتِ الْأَصْواتُ بِصُنُوفِ اللُّغاتِ ، فَاجْعَلْ لَنَا اللّٰهُمَّ فِى هٰذِهِ الْعَشِيَّةِ نَصِيباً مِنْ كُلِّ خَيْرٍ تَقْسِمُهُ بَيْنَ عِبادِكَ ، وَنُورٍ تَهْدِى بِهِ ، وَرَحْمَةٍ تَنْشُرُها ، وَبَرَكَةٍ تُنْزِلُها ، وَعافِيَةٍ تُجَلِّلُها ، وَرِزْقٍ تَبْسُطُهُ يَا أَرْحَمَ الرَّاحِمِينَ؛

اللّٰهُمَّ أَقْلِبْنا فِى هٰذَا الْوَقْتِ مُنْجِحِينَ مُفْلِحِينَ مَبْرُورِينَ غانِمِينَ ، وَلَا تَجْعَلْنا مِنَ الْقانِطِينَ ، وَلَا تُخْلِنا مِنْ رَحْمَتِكَ ، وَلَا تَحْرِمْنا مَا نُؤَمِّلُهُ مِنْ فَضْلِكَ ، وَلَا تَجْعَلْنا مِنْ رَحْمَتِكَ مَحْرُومِينَ ، وَلَا لِفَضْلِ مَا نُؤَمِّلُهُ مِنْ عَطائِكَ قانِطِينَ ، وَلَا تَرُدَّنا خائِبِينَ ، وَلَا مِنْ بابِكَ مَطْرُودِينَ ، يَا أَجْوَدَ الْأَجْوَدِينَ ، وَأَكْرَمَ الْأَكْرَمِينَ ، إِلَيْكَ أَقْبَلْنا مُوقِنِينَ ، وَ لِبَيْتِكَ الْحَرامِ آمِّينَ قاصِدِينَ ، فَأَعِنَّا عَلَىٰ مَناسِكِنا ، وَأَكْمِلْ لَنا حَجَّنا ، وَاعْفُ عَنَّا وَعافِنا ، فَقَدْ مَدَدْنا إِلَيْكَ أَيْدِيَنا فَهِىَ بِذِلَّةِ الاعْتِرافِ مَوْسُومَةٌ؛

اللّٰهُمَّ فَأَعْطِنا فِى هٰذِهِ الْعَشِيَّةِ مَا سَأَلْناكَ ، وَاكْفِنا مَا اسْتَكْفَيْناكَ ، فَلا كافِىَ لَنا سِواكَ ، وَلَا رَبَّ لَنا غَيْرُكَ ، نافِذٌ فِينا حُكْمُكَ ، مُحِيطٌ بِنا عِلْمُكَ ، عَدْلٌ فِينا قَضاؤُكَ ، اقْضِ لَنَا الْخَيْرَ ، وَاجْعَلْنا مِنْ أَهْلِ الْخَيْرِ .

اللّٰهُمَّ أَوْجِبْ لَنا بِجُودِكَ عَظِيمَ الْأَجْرِ ، وَكَرِيمَ الذُّخْرِ ، وَدَوامَ الْيُسْرِ ، وَاغْفِرْ لَنا ذُنُوبَنا أَجْمَعِينَ ، وَلَا تُهْلِكْنا مَعَ الْهالِكِينَ ، وَلَا تَصْرِفْ عَنَّا رَأْفَتَكَ وَرَحْمَتَكَ يَا أَرْحَمَ الرَّاحِمِينَ؛

اللّٰهُمَّ اجْعَلْنا فِى هٰذَا الْوَقْتِ مِمَّنْ سَأَلَكَ فَأَعْطَيْتَهُ ، وَشَكَرَكَ فَزِدْتَهُ ، وَثابَ إِلَيْكَ فَقَبِلْتَهُ ، وَتَنَصَّلَ  إِلَيْكَ مِنْ ذُنُوبِهِ كُلِّها فَغَفَرْتَها لَهُ ، يَا ذَا الْجَلالِ وَالْإِكْرامِ .

اللّٰهُمَّ وَنَقِّنا وَسَدِّدْنا  وَاقْبَلْ تَضَرُّعَنا ، يَا خَيْرَ مَنْ سُئِلَ ، وَيَا أَرْحَمَ مَنِ اسْتُرْحِمَ ، يَا مَنْ لَا يَخْفىٰ عَلَيْهِ إِغْماضُ الْجُفُونِ ، وَلَا لَحْظُ الْعُيُونِ ، وَلَا مَا اسْتَقَرَّ فِى الْمَكْنُونِ ، وَلَا مَا انْطَوَتْ عَلَيْهِ مُضْمَراتُ الْقُلُوبِ ، أَلَا كُلُّ ذٰلِكَ قَدْ أَحْصاهُ عِلْمُكَ ، وَوَسِعَهُ حِلْمُكَ ، سُبْحانَكَ وَتَعالَيْتَ عَمَّا يَقُولُ الظَّالِمُونَ عُلُوّاً كَبِيراً ، تُسَبِّحُ لَكَ السَّماواتُ السَّبْعُ وَالْأَرَضُونَ وَمَنْ فِيهِنَّ وَ إِنْ مِنْ شَىْءٍ إِلّا يُسَبِّحُ بِحَمْدِكَ؛

فَلَكَ الْحَمْدُ وَالْمَجْدُ وَعُلُوُّ الْجَدِّ ، يَا ذَا الْجَلالِ وَالْإِكْرامِ ، وَالْفَضْلِ وَالْإِنْعامِ ، وَالْأَيادِى الْجِسامِ ، وَأَنْتَ الْجَوادُ الْكَرِيمُ ، الرَّؤُوفُ الرَّحِيمُ . اللّٰهُمَّ أَوْسِعْ عَلَىَّ مِنْ رِزْقِكَ الْحَلالِ ، وَعافِنِى فِى بَدَنِى وَدِينِى ، وَآمِنْ خَوْفِى ، وَأَعْتِقْ رَقَبَتِى مِنَ النَّارِ . اللّٰهُمَّ لَاتَمْكُرْ بِى وَلَا تَسْتَدْرِجْنِى وَلَا تَخْدَعْنِى ، وَادْرَأْ عَنِّى شَرَّ فَسَقَةِ الْجِنِّ وَالْإِنْسِ.

يَا أَسْمَعَ السَّامِعِينَ ، يَا أَبْصَرَ النَّاظِرِينَ ، وَيَا أَسْرَعَ الْحاسِبِينَ ، وَيَا أَرحَمَ الرَّاحِمِينَ ، صَلِّ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ السَّادَةِ الْمَيامِينِ ، وَأَسْأَلُكَ اللّٰهُمَّ حاجَتِىَ الَّتِى إِنْ أَعْطَيْتَنِيها لَمْ يَضُرَّنِى مَا مَنَعْتَنِى ، وَ إِنْ مَنَعْتَنِيها لَمْ‌يَنْفَعْنِى مَا أَعْطَيْتَنِى ، أَسْأَلُكَ فَكاكَ رَقَبَتِى مِنَ النَّارِ ، لَاإِلٰهَ إِلّا أَنْتَ وَحْدَكَ لاشَرِيكَ لَكَ ، لَكَ الْمُلْكُ ، وَلَكَ الْحَمْدُ ، وَأَنْتَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ ، يَا رَبِّ يَا رَبِّ...

إِلٰهِى أَنَا الْفَقِيرُ فِى غِناىَ فَكَيْفَ لَاأَكُونُ فَقِيراً فِى فَقْرِى ؟ ! إِلٰهِى أَنَا الْجاهِلُ فِى عِلْمِى فَكَيْفَ لَاأَكُونُ جَهُولاً فِى جَهْلِى ؟ ! إِلٰهِى إِنَّ اخْتِلافَ تَدْبِيرِكَ وَسُرْعَةَ طَواءِ  مَقادِيرِكَ مَنَعا عِبادَكَ الْعارِفِينَ بِكَ عَنِ السُّكُونِ إِلىٰ عَطاءٍ ، وَالْيَأْسِ مِنْكَ فِى بَلاءٍ . إِلٰهِى مِنِّى مَا يَلِيقُ بِلُؤْمِى وَمِنْكَ مَا يَلِيقُ بِكَرَمِكَ؛

إِلٰهِى وَصَفْتَ نَفْسَكَ بِاللُّطْفِ وَالرَّأْفَةِ لِى قَبْلَ وُجُودِ ضَعْفِى أَفَتَمْنَعُنِى مِنْهُما بَعْدَ وُجُودِ ضَعْفِى ؟ إِلٰهِى إِنْ ظَهَرَتِ الْمَحاسِنُ مِنِّى فَبِفَضْلِكَ وَلَكَ الْمِنَّةُ عَلَىَّ ، وَ إِنْ ظَهَرَتِ الْمَساوِئُ مِنِّى فَبِعَدْلِكَ وَلَكَ الْحُجَّةُ عَلَىَّ .

إِلٰهِى كَيْفَ تَكِلُنِى وَقَدْ تَكَفَّلْتَ  لِى ؟ وَكَيْفَ أُضامُ وَأَنْتَ النَّاصِرُ لِى ؟ أَمْ كَيْفَ أَخِيبُ وَأَنْتَ الْحَفِىُّ بِى ؟ ها أَنَا أَتَوَسَّلُ إِلَيْكَ بِفَقْرِى إِلَيْكَ ، وَكَيْفَ أَتَوَسَّلُ إِلَيْكَ بِمَا هُوَ مَحالٌ أَنْ يَصِلَ إِلَيْكَ ؟ أَمْ كَيْفَ أَشْكُو إِلَيْكَ حالِى وَهُوَ لَايَخْفىٰ عَلَيْكَ ؟ أَمْ كَيْفَ أُتَرْجِمُ بِمَقالِى وَهُوَ مِنْكَ بَرَزٌ إِلَيْكَ؛ أَمْ كَيْفَ تُخَيِّبُ آمالِى وَهِىَ قَدْ وَفَدَتْ إِلَيْكَ ؟ أَمْ كَيْفَ لَاتُحْسِنُ أَحْوالِى وَبِكَ قامَتْ؟

إِلٰهِى مَا أَلْطَفَكَ بِى مَعَ عَظِيمِ جَهْلِى ! وَمَا أَرْحَمَكَ بِى مَعَ قَبِيحِ فِعْلِى ! إِلٰهِى مَا أَقْرَبَكَ مِنِّى وَأَبْعَدَنِى عَنْكَ ! وَمَا أَرْأَفَكَ بِى ! فَمَا الَّذِى يَحْجُبُنِى عَنْكَ ؟ إِلٰهِى عَلِمْتُ بِاخْتِلافِ الْآثارِ وَتَنَقُّلاتِ الْأَطْوارِ ، أَنَّ مُرادَكَ مِنِّى أَنْ تَتَعَرَّفَ إِلَىَّ فِى كُلِّ شَىْءٍ حَتَّىٰ لا أَجْهَلَكَ فِى شَىْءٍ . إِلٰهِى كُلَّما أَخْرَسَنِى لُؤْمِى أَنْطَقَنِى كَرَمُكَ ، وَكُلَّما آيَسَتْنِى أَوْصافِى أَطْمَعَتْنِى مِنَنُكَ؛

إِلٰهِى مَنْ كانَتْ مَحاسِنُهُ مَساوِئَ فَكَيْفَ لَاتَكُونُ مَساويِهِ مَساوِئَ ؟! وَمَنْ كانَتْ حَقائِقُهُ دَعاوِىَ فَكَيْفَ لَاتَكُونُ دَعاويِهِ دَعاوِىَ ؟! إِلٰهِى حُكْمُكَ النَّافِذُ وَمَشِيئَتُكَ الْقاهِرَةُ لَمْ يَتْرُكا لِذِى مَقالٍ مَقالاً ، وَلَا لِذِى حالٍ حالاً . إِلٰهِى كَمْ مِنْ طاعَةٍ بَنَيْتُها ، وَحالَةٍ شَيَّدْتُها هَدَمَ اعْتِمادِى عَلَيْها عَدْلُكَ ، بَلْ أَقالَنِى مِنْها فَضْلُكَ . إِلٰهِى إِنَّكَ تَعْلَمُ أَنِّى وَ إِنْ لَمْ تَدُمِ الطَّاعَةُ مِنِّى فِعْلاً جَزْماً فَقَدْ دامَتْ مَحَبَّةً وَعَزْماً . إِلٰهِى كَيْفَ أَعْزِمُ وَأَنْتَ الْقاهِرُ ؟ وَكَيْفَ لَاأَعْزِمُ وَأَنْتَ الْآمِرُ؛

إِلٰهِى تَرَدُّدِى فِى الْآثارِ يُوجِبُ بُعْدَ الْمَزارِ فَاجْمَعْنِى عَلَيْكَ بِخِدْمَةٍ تُوصِلُنِى إِلَيْكَ ، كَيْفَ يُسْتَدَلُّ عَلَيْكَ بِما هُوَ فِى وُجُودِهِ مُفْتَقِرٌ إِلَيْكَ ؟ أَيَكُونُ لِغَيْرِكَ مِنَ الظُّهُورِ مَا لَيْسَ لَكَ حَتَّىٰ يَكُونَ هُوَ الْمُظْهِرَ لَكَ ؟ مَتىٰ غِبْتَ حَتَّىٰ تَحْتاجَ إِلىٰ دَلِيلٍ يَدُلُّ عَلَيْكَ؟ وَمَتىٰ بَعُدْتَ حَتَّىٰ تَكُونَ الْآثارُ هِىَ الَّتِى تُوصِلُ إِلَيْكَ ؟ عَمِيَتْ عَيْنٌ لَاتَراكَ عَلَيْها رَقِيباً ، وَخَسِرَتْ صَفْقَةُ عَبْدٍ لَمْ تَجْعَلْ لَهُ مِنْ حُبِّكَ نَصِيباً؛

إِلٰهِى أَمَرْتَ بِالرُّجُوعِ إِلَى الْآثارِ فَأَرْجِعْنِى إِلَيْكَ بِكِسْوَةِ الْأَنْوارِ وَهِدايَةِ الاسْتِبْصارِ حَتَّىٰ أَرْجِعَ إِلَيْكَ مِنْها كَما دَخَلْتُ إِلَيْكَ مِنْها مَصُونَ السِّرِّ عَنِ النَّظَرِ إِلَيْها ، وَمَرْفُوعَ الْهِمَّةِ عَنِ الاعْتِمادِ عَلَيْها ، إِنَّكَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ .

إِلٰهِى هٰذَا ذُلِّى ظاهِرٌ بَيْنَ يَدَيْكَ ، وَهٰذَا حالِى لَايَخْفىٰ عَلَيْكَ ، مِنْكَ أَطْلُبُ الْوُصُولَ إِلَيْكَ ، وَبِكَ أَسْتَدِلُّ عَلَيْكَ ، فَاهْدِنِى بِنُورِكَ إِلَيْكَ ، وَأَقِمْنِى بِصِدْقِ الْعُبُودِيَّةِ بَيْنَ يَدَيْكَ . إِلٰهِى عَلِّمْنِى مِنْ عِلْمِكَ الْمَخْزُونِ ، وَصُنِّى بِسِتْرِكَ الْمَصُونِ؛

إِلٰهِى حَقِّقْنِى بِحَقائِقِ أَهْلِ الْقُرْبِ ، وَاسْلُكْ بِى مَسْلَكَ أَهْلِ الْجَذْبِ . إِلٰهِى أَغْنِنِى بِتَدْبِيرِكَ لِى عَنْ تَدْبِيرِى ، وَبِاخْتِيارِكَ عَن اخْتِيارِى ، وَأَوْقِفْنِى عَلَىٰ مَراكِزِ اضْطِرارِى .

إِلٰهِى أَخْرِجْنِى مِنْ ذُلِّ نَفْسِى ، وَطَهِّرْنِى مِنْ شَكِّى وَشِرْكِى قَبْلَ حُلُولِ رَمْسِى ، بِكَ أَنْتَصِرُ فَانْصُرْنِى ، وَعَلَيْكَ أَتَوَكَّلُ فَلا تَكِلْنِى ، وَ إِيَّاكَ أَسْأَلُ فَلا تُخَيِّبْنِى ، وَفِى فَضْلِكَ أَرْغَبُ فَلا تَحْرِمْنِى ، وَبِجَنابِكَ أَنْتَسِبُ فَلا تُبْعِدْنِى ، وَبِبابِكَ أَقِفُ فَلا تَطْرُدْنِى؛

إِلٰهِى تَقَدَّسَ رِضاكَ أَنْ يَكُونَ لَهُ عِلَّةٌ مِنْكَ فَكَيْفَ تَكُونُ لَهُ عِلَّةٌ مِنِّى ؟ إِلٰهِى أَنْتَ الْغَنِىُّ بِذاتِكَ أَنْ يَصِلَ إِلَيْكَ النَّفْعُ مِنْكَ فَكَيْفَ لَا تَكُونُ غَنِيّاً عَنِّى ؟ إِلٰهِى إِنَّ الْقَضاءَ وَالْقَدَرَ يُمَنِّينِى ، وَ إِنَّ الْهَوىٰ بِوَثائِقِ الشَّهْوَةِ أَسَرَنِى ، فَكُنْ أَنْتَ النَّصِيرَ لِى حَتَّىٰ تَنْصُرَنِى وَتُبَصِّرَنِى ، وَأَغْنِنِى بِفَضْلِكَ حَتَّىٰ أَسْتَغْنِىَ بِكَ عَنْ طَلَبِى ، أَنْتَ الَّذِى أَشْرَقْتَ الْأَنْوارَ فِى قُلُوبِ أَوْلِيائِكَ حَتَّىٰ عَرَفُوكَ وَوَحَّدُوكَ ، وَأَنْتَ الَّذِى أَزَلْتَ الْأَغْيارَ عَنْ قُلُوبِ أَحِبَّائِكَ حَتَّىٰ لَمْ يُحِبُّوا سِواكَ وَلَمْ يَلْجَأُوا إِلىٰ غَيْرِكَ ، أَنْتَ الْمُؤْنِسُ لَهُمْ حَيْثُ أَوْحَشَتْهُمُ الْعَوالِمُ ، وَأَنْتَ الَّذِى هَدَيْتَهُمْ حَيْثُ اسْتَبانَتْ لَهُمُ الْمَعالِمُ ، مَاذا وَجَدَ مَنْ فَقَدَكَ وَمَا الَّذِى فَقَدَ مَنْ وَجَدَكَ ؟

لَقَدْ خابَ مَنْ رَضِىَ دُونَكَ بَدَلاً ، وَلَقَدْ خَسِرَ مَنْ بَغىٰ عَنْكَ مُتَحَوِّلاً ، كَيْفَ يُرْجىٰ سِواكَ وَأَنْتَ مَا قَطَعْتَ الْإِحْسانَ ؟ وَكَيْفَ يُطْلَبُ مِنْ غَيْرِكَ وَأَنْتَ مَا بَدَّلْتَ عادَةَ الامْتِنانِ ؟ يَا مَنْ أَذاقَ أَحِبَّاءَهُ حَلاوَةَ الْمُؤانَسَةِ فَقامُوا بَيْنَ يَدَيْهِ مُتَمَلِّقِينَ ، وَيَا مَنْ أَلْبَسَ أَوْلِياءَهُ مَلابِسَ هَيْبَتِهِ فَقامُوا بَيْنَ يَدَيْهِ مُسْتَغْفِرِينَ ، أَنْتَ الذَّاكِرُ قَبْلَ الذَّاكِرِينَ ، وَأَنْتَ الْبادِئُ بِالإِحْسانِ قَبْلَ تَوَجُّهِ الْعابِدِينَ ، وَأَنْتَ الْجَوادُ بِالْعَطاءِ قَبْلَ طَلَبِ الطَّالِبِينَ ، وَأَنْتَ الْوَهَّابُ ثُمَّ لِما وَهَبْتَ لَنا مِنَ الْمُسْتَقْرِضِينَ؛

إِلٰهِى اطْلُبْنِى بِرَحْمَتِكَ حَتَّىٰ أَصِلَ إِلَيْكَ ، وَاجْذِبْنِى بِمَنِّكَ حَتَّىٰ أُقْبِلَ عَلَيْكَ . إِلٰهِى إِنَّ رَجائِى لَايَنْقَطِعُ عَنْكَ وَ إِنْ عَصَيْتُكَ ، كَما أَنَّ خَوفِى لَايُزايِلُنِى وَ إِنْ أَطَعْتُكَ ، فَقَدْ دَفَعَتْنِى الْعَوالِمُ إِلَيْكَ ، وَقَدْ أَوْقَعَنِى عِلْمِى بِكَرَمِكَ عَلَيْكَ .

إِلٰهِى كَيْفَ أَخِيبُ وَأَنْتَ أَمَلِى ؟ أَمْ كَيْفَ أُهانُ وَعَلَيْكَ مُتَّكَلِى ؟ إِلٰهِى كَيْفَ أَسْتَعِزُّ وَفِى الذِّلَّةِ أَرْكَزْتَنِى ؟ أَمْ كَيْفَ لَا أَسْتَعِزُّ وَ إِلَيْكَ نَسَبْتَنِى؛

إِلٰهِى كَيْفَ لَاأَفْتَقِرُ وَأَنْتَ الَّذِى فِى الْفُقَراءِ أَقَمْتَنِى ؟ أَمْ كَيْفَ أَفْتَقِرُ وَأَنْتَ الَّذِى بِجُودِكَ أَغْنَيْتَنِى ؟ وَأَنْتَ الَّذِى لَاإِلٰهَ غَيْرُكَ تَعَرَّفْتَ لِكُلِّ شَىْءٍ فَما جَهِلَكَ شَىْءٌ ، وَأَنْتَ الَّذِى تَعَرَّفْتَ إِلَىَّ فِى كُلِّ شَىْءٍ فَرَأَيْتُكَ ظاهِراً فِى كُلِّ شَىْءٍ ، وَأَنْتَ الظَّاهِرُ لِكُلِّ شَىْءٍ ، يَا مَنِ اسْتَوىٰ بِرَحْمانِيَّتِهِ فَصارَ الْعَرْشُ غَيْباً فِى ذاتِهِ ، مَحَقْتَ الْآثارَ بِالْآثارِ ، وَمَحَوْتَ الْأَغْيارَ بِمُحِيطاتِ أَفْلاكِ الْأَنْوارِ ، يَا مَنِ احْتَجَبَ فِى سُرادِقاتِ عَرْشِهِ عَنْ أَنْ تُدْرِكَهُ الْأَبْصارُ ، يَا مَنْ تَجَلَّىٰ بِكَمالِ بَهائِهِ فَتَحَقَّقَتْ عَظَمَتُهُ مِنَ الاسْتِواءَ ، كَيْفَ تَخْفىٰ وَأَنْتَ الظَّاهِرُ ؟ أَمْ كَيْفَ تَغِيبُ وَأَنْتَ الرَّقِيبُ الْحاضِرُ ؟ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ ، وَالْحَمْدُ لِلّٰهِ وَحْدَهُ.''',
    benefits: "من أدعية يوم عرفة العظيمة، يدعى به لطلب التوبة والمغفرة وسعة الرزق وقضاء الحوائج.",
  ),
  Dua(
    title: "دعاء رفع المصاحف",
    text: r'''اللّٰهُمَّ إِنِّى أَسْأَلُكَ بِكِتابِكَ الْمُنْزَلِ وَمَا فِيهِ وَفِيهِ اسْمُكَ الْأَكْبَرُ وَأَسْماؤُكَ الْحُسْنىٰ وَمَا يُخافُ وَيُرْجىٰ أَنْ تَجْعَلَنِى مِنْ عُتَقائِكَ مِنَ النّارِ.

اللّٰهُمَّ بِحَقِّ هٰذَا الْقُرْآنِ وَبِحَقِّ مَنْ أَرْسَلْتَهُ بِهِ وَبِحَقِّ كُلِّ مُؤْمِنٍ مَدَحْتَهُ فِيهِ وَبِحَقِّكَ عَلَيْهِمْ فَلَا أَحَدَ أَعْرَفُ بِحَقِّكَ مِنْكَ.

ثمّ قل عشر مرّات: «بِكَ يَا اللّٰهُ» وعشر مرّات: «بِمُحَمَّدٍ» وعشر مرّات: «بِعَلِيٍّ» وعشر مرّات: «بِفَاطِمَةَ» وعشر مرّات: «بِالْحَسَنِ» وعشر مرّات: «بِالْحُسَيْنِ» وعشر مرّات: «بِعَلِيِّ بْنِ الْحُسَيْنِ» وعشر مرّات: «بِمُحَمَّدِ بْنِ عَلِيٍّ» وعشر مرّات: «بِجَعْفَرِ بْنِ مُحَمَّدٍ» وعشر مرّات: «بِمُوسَى بْنِ جَعْفَرٍ» وعشر مرّات: «بِعَلِيِّ بْنِ مُوسَى» وعشر مرّات: «بِمُحَمَّدِ بْنِ عَلِيٍّ» وعشر مرّات: «بِعَلِيِّ بْنِ مُحَمَّدٍ» وعشر مرّات: «بِالْحَسَنِ بْنِ عَلِيٍّ» وعشر مرّات: «بِالْحُجَّةِ».''',
    benefits: "من أعمال ليالي القدر المباركة، حيث يوضع المصحف الشريف على الرأس ويُدعى بالقسم بالله تعالى وبأنبيائه وأوليائه لغفران الذنوب وقضاء الحوائج.",
  ),
];
