import 'package:shia_hijri_calendar/shia_hijri_calendar.dart';
import 'package:quran/quran.dart' as quran;
// models/shia_data.dart

class QuranVerse {
  final int number;
  final String text;
  final String translation;
  final String tafsir;

  QuranVerse({
    required this.number,
    required this.text,
    required this.translation,
    required this.tafsir,
  });
}

class Surah {
  final String name;
  final String englishName;
  final String type; // مكة / المدينة
  final List<QuranVerse> verses;

  Surah({
    required this.name,
    required this.englishName,
    required this.type,
    required this.verses,
  });
}

class Dua {
  final String title;
  final String text;
  final String benefits;

  Dua({required this.title, required this.text, required this.benefits});
}

class Ziyarat {
  final String title;
  final String text;
  final String benefits;

  Ziyarat({required this.title, required this.text, required this.benefits});
}

class HijriEvent {
  final int day;
  final int month; // 1 to 12
  final String title;
  final String description;
  final String recommendedActs;
  final bool isMartyrdom;

  HijriEvent({
    required this.day,
    required this.month,
    required this.title,
    required this.description,
    required this.recommendedActs,
    this.isMartyrdom = false,
  });
}

class ShiaData {
  static final List<Surah> surahs = List.generate(114, (index) {
    final surahNumber = index + 1;
    final count = quran.getVerseCount(surahNumber);
    return Surah(
      name: quran.getSurahNameArabic(surahNumber),
      englishName: quran.getSurahName(surahNumber),
      type: quran.getPlaceOfRevelation(surahNumber) == "Makkah"
          ? "مكية"
          : "مدنية",
      verses: List.generate(count, (vIndex) {
        final verseNum = vIndex + 1;
        return QuranVerse(
          number: verseNum,
          text: quran.getVerse(surahNumber, verseNum, verseEndSymbol: true),
          translation: "",
          tafsir: "",
        );
      }),
    );
  });

  static final List<Dua> duas = [
    Dua(
      title: 'يا من تحل به عُقد المكاره',
      benefits: 'دعاء الامام السجاد عليه السلام في المُهمّات اذا عرضت له مهمّة أو نزلت ملّهمة و عند الكرب',
      text: '''يا من تُحلُّ به عُقدُ المكاره، ويا من يُفثأُ به حدُّ الشّدائد، ويا من يُلتمسُ منهُ المخرجُ إلى روح الفرج، ذلّت لقُدرتك الصّعابُ وتسبّبت بلُطفك الاسبابُ، وجرى بقُدرتك القضاءُ ومضت على إرادتك الاشياءُ، فهي بمشيّتك دُون قولك مُؤتمرةٌ، وبإرادتك دُون نهيك مُنزجرةٌ. أنت المدعُوُّ للمُهمّات، وأنت المفزعُ في المُلمّات، لايندفعُ منها إلاّ ما دفعت، ولا ينكشفُ منها إلاّ ما كشفت. وقد نزل بي يا ربّ ما قد تكأدنيّ ثقلُهُ، وألمّ بي ما قد بهظني حملُهُ، وبقُدرتك أوردتهُ عليّ وبسُلطانك وجّهتهُ إليّ. فلا مُصدر لما أوردت، ولا صارف لما وجّهت، ولا فاتح لما أغلقت، ولا مُغلق لما فتحت، ولا مُيسّر لما عسّرت، ولا ناصر لمن خذلت فصلّ على مُحمّد وآله، وافتح لي يا ربّ باب الفرج بطولك، واكسر عنّي سُلطان الهمّ بحولك، وأنلني حُسن ألنّظر فيما شكوتُ، وأذقني حلاوة الضُّنع فيما سالتُ. وهب لي من لدُنك رحمةً وفرجاً هنيئاً واجعل لي من عندك مخرجاً وحيّاً. ولا تشغلني بالاهتمام عن تعاهُد فُرُوضك واستعمال سُنّتك. فقد ضقتُ لما نزل بي يا ربّ ذرعاً، وامتلاتُ بحمل ما حدث عليّ همّاً، وأنت القادرُ على كشف مامُنيتُ به، ودفع ماوقعتُ فيه، فافعل بي ذلك وإن لم أستوجبهُ منك، يا ذا العرش العظيم  .''',
    ),
    Dua(
      title: 'دعاء العهد',
      benefits: 'روي عن الصادق (عليه السلام) أنه قال : من دعا إلى الله تعالى أربعين صباحاً بهذا العهد كان من أنصار قائمنا، فإن مات قبله أخرجه الله تعالى من قبره ....',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

اَللَّهُمَّ رَبَّ النُّورِ الْعَظِيمِ وَرَبَّ الْكُرْسِيِّ الرَّفِيعِ وَرَبَّ الْبَحْرِ الْمَسْجُورِ وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالزَّبُورِ وَرَبَّ الظِّلِّ وَالْحَرُورِ وَمُنْزِلَ الْقُرْآنِ الْعَظِيمِ وَرَبَّ الْمَلَائِكَةِ الْمُقَرَّبِينَ وَالْأَنْبِيَاءِ وَالْمُرْسَلِينَ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِوَجْهِكَ الْكَرِيمِ وَبِنُورِ وَجْهِكَ الْمُنِيرِ وَمُلْكِكَ الْقَدِيمِ يَا حَيُّ يَا قَيُّومُ أَسْأَلُكَ بِاسْمِكَ الَّذِي أَشْرَقَتْ بِهِ السَّمَاوَاتُ وَالْأَرَضُونَ وَبِاسْمِكَ الَّذِي يَصْلُحُ بِهِ الْأَوَّلُونَ وَالْآخِرُونَ يَا حَيًّا قَبْلَ كُلِّ حَيٍّ وَيَا حَيًّا بَعْدَ كُلِّ حَيٍّ وَيَا حَيًّا حِينَ لَا حَيَّ يَا مُحْيِيَ الْمَوْتَى وَمُمِيتَ الْأَحْيَاءِ يَا حَيُّ لَا إِلَهَ إِلَّا أَنْتَ اَللَّهُمَّ بَلِّغْ مَوْلَانَا الْإِمَامَ الْهَادِيَ الْمَهْدِيَّ الْقَائِمَ بِأَمْرِكَ صَلَوَاتُ اللَّهِ عَلَيْهِ وَعَلَى آبَائِهِ الطَّاهِرِينَ عَنْ جَمِيعِ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ فِي مَشَارِقِ الْأَرْضِ وَمَغَارِبِهَا سَهْلِهَا وَجَبَلِهَا وَبَرِّهَا وَبَحْرِهَا وَعَنِّي وَعَنْ وَالِدَيَّ مِنَ الصَّلَوَاتِ زِنَةَ عَرْشِ اللَّهِ وَمِدَادَ كَلِمَاتِهِ وَمَا أَحْصَاهُ عِلْمُهُ وَأَحَاطَ بِهِ كِتَابُهُ اَللَّهُمَّ إِنِّي أُجَدِّدُ لَهُ فِي صَبِيحَةِ يَوْمِي هَذَا وَمَا عِشْتُ مِنْ أَيَّامِي عَهْدًا وَعَقْدًا وَبَيْعَةً لَهُ فِي عُنُقِي لَا أَحُولُ عَنْهَا وَلَا أَزُولُ أَبَدًا اَللَّهُمَّ اجْعَلْنِي مِنْ أَنْصَارِهِ وَأَعْوَانِهِ وَالذَّابِّينَ عَنْهُ وَالْمُسَارِعِينَ إِلَيْهِ فِي قَضَاءِ حَوَائِجِهِ وَالْمُمْتَثِلِينَ لِأَوَامِرِهِ وَالْمُحَامِينَ عَنْهُ وَالسَّابِقِينَ إِلَى إِرَادَتِهِ وَالْمُسْتَشْهَدِينَ بَيْنَ يَدَيْهِ اَللَّهُمَّ إِنْ حَالَ بَيْنِي وَبَيْنَهُ الْمَوْتُ الَّذِي جَعَلْتَهُ عَلَى عِبَادِكَ حَتْمًا مَقْضِيًّا فَأَخْرِجْنِي مِنْ قَبْرِي مُؤْتَزِرًا كَفَنِي شَاهِرًا سَيْفِي مُجَرِّدًا قَنَاتِي مُلَبِّيًا دَعْوَةَ الدَّاعِي فِي الْحَاضِرِ وَالْبَادِي اَللَّهُمَّ أَرِنِي الطَّلْعَةَ الرَّشِيدَةَ وَالْغُرَّةَ الْحَمِيدَةَ وَاكْحُلْ نَاظِرِي بِنَظْرَةٍ مِنِّي إِلَيْهِ وَعَجِّلْ فَرَجَهُ وَسَهِّلْ مَخْرَجَهُ وَأَوْسِعْ مَنْهَجَهُ وَاسْلُكْ بِي مَحَجَّتَهُ وَأَنْفِذْ أَمْرَهُ وَاشْدُدْ أَزْرَهُ وَاعْمُرِ اللَّهُمَّ بِهِ بِلَادَكَ وَأَحْيِ بِهِ عِبَادَكَ فَإِنَّكَ قُلْتَ وَقَوْلُكَ الْحَقُّ ظَهَرَ الْفَسَادُ فِي الْبَرِّ وَالْبَحْرِ بِمَا كَسَبَتْ أَيْدِي النَّاسِ فَأَظْهِرِ اللَّهُمَّ لَنَا وَلِيَّكَ وَابْنَ بِنْتِ نَبِيِّكَ الْمُسَمَّى بِاسْمِ رَسُولِكَ حَتَّى لَا يَظْفَرَ بِشَيْءٍ مِنَ الْبَاطِلِ إِلَّا مَزَّقَهُ وَيُحِقَّ الْحَقَّ وَيُحَقِّقَهُ وَاجْعَلْهُ اللَّهُمَّ مَفْزَعًا لِمَظْلُومِ عِبَادِكَ وَنَاصِرًا لِمَنْ لَا يَجِدُ لَهُ نَاصِرًا غَيْرَكَ وَمُجَدِّدًا لِمَا عُطِّلَ مِنْ أَحْكَامِ كِتَابِكَ وَمُشَيِّدًا لِمَا وَرَدَ مِنْ أَعْلَامِ دِينِكَ وَسُنَنِ نَبِيِّكَ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَاجْعَلْهُ اللَّهُمَّ مِمَّنْ حَصَّنْتَهُ مِنْ بَأْسِ الْمُعْتَدِينَ اَللَّهُمَّ وَسُرَّ نَبِيَّكَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ بِرُؤْيَتِهِ وَمَنْ تَبِعَهُ عَلَى دَعْوَتِهِ وَارْحَمِ اسْتِكَانَتَنَا بَعْدَهُ اَللَّهُمَّ اكْشِفْ هَذِهِ الْغُمَّةَ عَنْ هَذِهِ الْأُمَّةِ بِحُضُورِهِ وَعَجِّلْ لَنَا ظُهُورَهُ إِنَّهُمْ يَرَوْنَهُ بَعِيدًا وَنَرَاهُ قَرِيبًا بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ 

ثم تضرب على فخذك الأيمن بيدك ثلاث مرات وتقول كل مرة 

الْعَجَلَ الْعَجَلَ يَا مَوْلَايَ يَا صَاحِبَ الزَّمَانِ''',
    ),
    Dua(
      title: 'الدعاء الجامع',
      benefits: 'عن أبي حمزة قال: أخذت هذا الدعاء من الباقر عليه السلام وكان يسميه الدعاء الجامع',
      text: '''بِسْمِ الله الرَّحْمنِ الرَّحيمِ 

 أشْهَدُ أنْ لا إلهَ إِلاّ الله وَحَدَهُ لا شَريكَ لَهُ وَأشْهَدُ أنَّ مُحَمَّداً عَبْدُهُ وَرَسولُهُ، آمَنْتُ بِالله وَبِجَميعِ رُسُلِهِ وَبِجَميعِ ما أُنْزِلَ بِهِ عَلى جَميعِ الرُّسُلِ، وَأنَّ وَعْدَ الله حقٌ وَلِقاءهُ حَقٌ وَصَدَقَ الله وَبَلَّغَ المُرْسَلونَ وَالحَمْدُ لله ربِّ العالَمينَ وَسُبْحانَ الله كُلَّما سَبَّحَ الله شَيٌ وَكَما يُحِبُّ الله أنْ يُسَبِّحُ، وَالحَمْدُ لله كُلَّما حَمِدَ الله شَيٌ وَكَما يُحِبُّ الله أنْ يُحْمَدَ وَلا إلهَ إِلاّ الله كُلَّما هَلّلَ الله شَيٌ وَكَما يُحِبُّ الله أنْ يُهَلّلْ، والله أكْبَرُ كُلَّما كَبّرَ الله شَيٌ وَكَما يُحِبُّ الله أنْ يُكَبَّرَ.
اللّهُمَّ إِنِّي أَسْأَلُكَ مَفاتيحَ الخَيْرِ وَخَواتيمَهُ وَسَوابِغَهُ وفَوائِدَهُ وَبَرَكاتِهُ وَمابَلَغَ عِلْمَهُ عِلْمي وَماقَصُرَ عَنْ إحْصائِهِ حِفْظِي، اللّهُمَّ انْهَجْ لي أسْبابَ مَعْرِفَتِهِ وافْتَحْ لي أبْوابَهُ وَغَشِّني بَرَكاتِ رَحْمَتِكَ وَمُنَّ عَلَيَّ بِعِصْمَةٍ عَنْ الازالَةِ عَنْ دينِكَ وَطَهُرْ قَلْبي مِنَ الشَّكِ وَلا تَشْغِلْ قَلْبي بِدُنيايَ وَعاجِلِ مَعاشي عَنْ آجِلِ ثَوابِ آخِرَتي، وَاشْغِلْ قَلْبي بِحِفْظِ ما لا تَقْبَلْ مِنّي جَهْلَهُ وَذَلِّلْ لِكُلِّ خَيْرٍ لِساني وَطَهِّرْ قَلْبي مِنَ الرِّياءِ وَلا تُجْرِهِ في مَفاصِلي وَاجْعَلْ عَمَلي خالِصا لَكَ، اللّهُمَّ إِنِّي أعوذُ بِكَ مِنَ الشَرِّ وَأنْواعِ الفَواحِشِ كُلِّها ظاهِرِها وَباطِنِها وَغَفَلاتِها وَجَميعِ ما يُريدَني بِهِ الشَّيطانُ الرجيمُ وَما يُريدُني بِهِ السُّلطانُ العتيد مِمّا أحَطْتَ بِعِلْمِهِ وَأنْتَ القادِرُ عَلى صَرْفِهِ عَنّي، اللّهُمَّ إِنِّي أعوذُ بِكَ مِنْ طَوارِقِ الجِنِّ وَالانْسِ وَزَوابِعِهِمْ وَبَوائِقِهِم وَمَكايدِهِمْ وَمَشاهِدِ الفَسَقَةِ مِنَ الجِنِّ وَالانْسِ، وَأنْ أسْتَزِلَّ عَنْ ديني فَتَفْسُدُ عَلَيَّ آخِرَتي، وَأنْ يَكونَ ذلكَ مِنْهُمْ ضَرراً عَلَيَّ في مَعاشي أو يَعْرُضَ بَلاءٌ يُصيبُني مِنْهُمْ وَلا قوَّةَ لي بِهِ وَلا صَبْرَ لي عَلى احْتِمالِهِ، فَلا تَبْتَليني يا ألهي بِمُقاساتِهِ فَيَمْنَعُني ذلكَ عَنْ ذِكْرِكَ وَيَشْغَلُني عَنْ عِبادَتِكَ؛ أنْتَ العاصِمُ المانِعُ الدافِعُ الواقي مِنْ ذلكَ كُلِّهِ. أَسْأَلُكَ اللّهُمَّ الرَّفاهيَةَ في مَعيشَتي ما أبْقَيْتَني مَعيشَةً أقْوى بها عَلى طاعَتِكَ وَأبْلُغُ بِها رِضْوانَكَ وَأصيرُ بِها إِلى دارِ الحَيوانِ غَداً، وَلا تَرْزُقْني رِزْقاً يُطْغيني وَلا تَبْتَلِيَني بِفَقْرٍ أشْقى بِهِ مُضَيَّقا عَلَيَّ، أعْطِني حَظّا وَافراً في آخِرَتي وَمَعاشاً واسِعاً هَنيئاً مَريئاً في دُنْيايَ وَلا تَجْعَلْ الدُّنْيا عَلَيَّ سِجْناً وَلا تَجْعَلْ فِراقَها عَلَيَّ حُزْناً، أجِرْني مِنْ فِتْنَتِها وَاجْعَلْ عَمَلي فيها مَقْبولاً وَسَعْيي فيها مَشْكوراً، اللّهُمَّ وَمَنْ أرادَني بِسوءٍ فَأَرِدْهُ بِمِثْلِهِ وَمَنْ كادَني فيها فَكِدْهُ وَاصْرِفْ عَنّي هَمَّ مَنْ أَدْخَلَ عَلَيَّ هَمَّهُ وَامْكُرْ بِمَنْ مَكَرَ بي فَإنَّكَ خَيْرُ الماكِرينَ وَافْقاء عَنّي عُيونَ الكَفَرَةِ الظَّلَمَةِ الطُّغاةِ الحَسَدَةِ، اللّهُمَّ وَأنْزِلْ عَلَيَّ مِنْكَ السَّكينَةَ وألْبِسْني دِرْعَكَ ألحَصينَةَ وَاحْفِظْني بِسِرِّكَ الواقي وَجَلِّلْني عافيَتَكَ النَّافِعَةَ وَصَدِّقْ قَوْلي وَفِعالي وَبارِكْ لي في وَلَدي وَأَهْلي وَمالي، اللّهُمَّ ما قَدَّمْتُ وَما أَخَّرْتُ وَما أغْفَلْتُ وَما تَعَمَّدْتُ وَما تَوانَيْتُ وَما أعلنت وَما اسْرَرْتُ فَإغْفِرْ لي يا أرْحَمَ الرّاحِمينَ.''',
    ),
    Dua(
      title: 'دعاء جبرائيل عليه السلام',
      benefits: 'ومما قاله جبرائيل عليه السلام في فضل هذا الدعاء : يا محمد لو صارت أشجار الدنيا أقلاما والبحار مدادا والخلائق كتابا لم يقدروا على ثواب قارئ هذا الدعاء.',
      text: '''بسم الله الرحمن الرحيم

سبحان الله العظيم وبحمده سبحانه من إله ما اقدره سبحانه من قدير ما اعظمه وسبحانه من عظيم ما اجله وسبحانه من جليل ما امجده وسبحانه من ماجد ما ارأفه وسبحانه من رؤوف ما اعزه وسبحانه من عزيز ما اكبره وسبحانه من كبير ما اقدمه وسبحانه من قديم ما اعلاه وسبحانه من علي ما اسناه وسبحانه من سني ما ابهاه وسبحانه من بهي ما انوره وسبحانه من منير ما اظهره وسبحانه من ظاهر ما اخفاه وسبحانه من خفي ما اعلمه وسبحانه من خبير ما اكرمه وسبحانه من كريم ما الطفه وسبحانه من لطيف ما ابصره وسبحانه من بصير ما اسمعه وسبحانه من سميع ما احفظه وسبحانه من حافظ ما املاه وسبحانه من ملي ما اوفاه وسبحانه من وفي ما اغناه وسبحانه من غني ما اعطاه وسبحانه من معط ما اوسعه وسبحانه من واسع ما اجوده وسبحانه من جواد ما افضله وسبحانه من مفضل ما انعمه وسبحانه من منعم ما اسيده وسبحانه من سيد ما ارحمه وسبحانه من رحيم ما اشده وسبحانه من شديد ما اقواه وسبحانه من قوي ما احمده وسبحانه من حميد ما احكمه وسبحانه من حكيم ما ابطشه وسبحانه من باطش ما اقومه وسبحانه من قيوم ما ادومه وسبحانه من دائم ما ابقاه وسبحانه من باق ما افرده وسبحانه من فرد ما اوحده وسبحانه من واحد ما اصمده وسبحانه من صمد ما املكه وسبحانه من مالك ما اولاه وسبحانه من ولي ما اعظمه وسبحانه من عظيم ما اكمله وسبحانه من كامل ما اتمه وسبحانه من تام ما اعجبه وسبحانه من عجيب ما افخره وسبحانه من فاخر ما ابعده وسبحانه من بعيد ما اقربه وسبحانه من قريب ما امنعه وسبحانه من مانع ما اغلبه وسبحانه من غالب ما اعفاه وسبحان من عفو ما احسنه وسبحانه من محسن ما اجمله وسبحانه من مجمل ما اقبله وسبحانه من قابل ما اشكره وسبحانه من شكور ما اغفره وسبحانه من غفور ما اصبره وسبحانه من صبور ما اجبره وسبحانه من جبار ما ادينه وسبحانه من ديان ما اقضاه وسبحانه من قاض ما امضاه وسبحانه من ماض ما انفذه وسبحانه من نافذ ما احمله وسبحانه من حليم ما اخلقه وسبحانه من خالق ما ارزقه وسبحانه من رازق ما اقهره وسبحانه من قاهر ما انشأه وسبحانه من منشئ ما املكه وسبحانه من مالك ما اولاه وسبحانه من وال ما ارفعه وسبحانه من رفيع ما اشرفه وسبحانه من شريف ما ابسطه وسبحانه من باسط ما اقبضه وسبحانه من قابض ما ابده وسبحانه من باد ما اقدسه وسبحانه من قدوس ما اظهره وسبحانه من ظاهر ما ازكاه وسبحانه من زكي ما اهداه وسبحانه من هاد ما اصدقه وسبحانه من صادق ما اعوده وسبحانه من عواد ما افطره وسبحانه من فاطر ما ارعاه وسبحانه من راع ما اعونه وسبحانه من معين ما اوهبه وسبحانه من وهاب ما اتوبه وسبحانه من تواب ما اسخاه وسبحانه من سخي ما انصره وسبحانه من نصير ما اسلمه وسبحانه من سلام ما اشفاه وسبحانه من شاف ما انجاه وسبحانه من منج ما ابره وسبحانه من بار ما اطلبه وسبحانه من طالب ما ادركه وسبحانه من مدرك ما ارشده وسبحانه من رشيد ما اعطفه وسبحانه من معطف ما اعدله وسبحانه من عدل ما اتقنه وسبحانه من متقن ما احكمه وسبحانه من حكيم ما اكفله وسبحانه من كفيل ما اشهده وسبحانه من شهيد ما احمده وسبحانه هو الله العظيم وبحمده والحمد لله ولا اله الا الله والله اكبر ولله الحمد ولا حول ولا قوة الا بالله العلي العظيم دافع كل بلية وحسبنا الله ونعم الوكيل''',
    ),
    Dua(
      title: 'الدعاء عند السفر',
      benefits: 'دعاء الإمام علي عليه السلام في السفر',
      text: '''بسم الله الرحمن الرحيم

اَللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمُنْقَلَبِ وَسُوءِ الْمَنْظَرِ فِي النَّفْسِ وَالْأَهْلِ وَالْمَالِ وَالْوَلَدِ اَللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَأَنْتَ الْخَلِيفَةُ فِي الْأَهْلِ وَلَا يَجْمَعُهُمَا غَيْرُكَ لِأَنَّ الْمُسْتَخْلَفَ لَا يَكُونُ مُسْتَصْحَبًا وَالْمُسْتَصْحَبَ لَا يَكُونُ مُسْتَخْلَفًا دُعَاءُ الْإِمَامِ زَيْنِ الْعَابِدِينَ عَلَيْهِ السَّلَامُ فِي السَّفَرِ بِسْمِ اللَّهِ وَبِاللَّهِ وَمِنَ اللَّهِ وَإِلَى اللَّهِ وَفِي سَبِيلِ اللَّهِ اَللَّهُمَّ إِلَيْكَ أَسْلَمْتُ نَفْسِي وَإِلَيْكَ وَجَّهْتُ وَجْهِي وَإِلَيْكَ فَوَّضْتُ أَمْرِي فَاحْفَظْنِي بِحِفْظِ الْإِيمَانِ مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَمِنْ تَحْتِي وَادْفَعْ عَنِّي بِحَوْلِكَ وَقُوَّتِكَ فَإِنَّهُ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ وَكَانَ أَبُو عَبْدِ اللَّهِ الْإِمَامُ جَعْفَرُ بْنُ مُحَمَّدٍ الصَّادِقُ عَلَيْهِ السَّلَامُ يَقُولُ إِذَا خَرَجَ فِي سَفَرِهِ اَللَّهُمَّ احْفَظْنِي وَاحْفَظْ مَا مَعِي وَبَلِّغْنِي وَبَلِّغْ مَا مَعِي بِبَلَاغِكَ الْحَسَنِ بِاللَّهِ أَسْتَفْتِحُ وَبِاللَّهِ أَسْتَنْجِحُ وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ أَتَوَجَّهُ اَللَّهُمَّ سَهِّلْ لِي كُلَّ حُزُونَةٍ وَذَلِّلْ لِي كُلَّ صُعُوبَةٍ وَأَعْطِنِي مِنَ الْخَيْرِ كُلِّهِ أَكْثَرَ مِمَّا أَرْجُو وَاصْرِفْ عَنِّي مِنَ الشَّرِّ أَكْثَرَ مِمَّا أَحْذَرُ فِي عَافِيَةٍ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dua(
      title: 'دعاء أهل الثغور',
      benefits: 'دعاء للإمام السجاد (ع) لحفظ المجاهدين ودفع كيد الأعداء',
      text: '''بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ

اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ وَحَصِّنْ ثُغُورَ الْمُسْلِمِينَ بِعِزَّتِكَ وَأَيِّدْ حُمَاتَهَا بِقُوَّتِكَ وَأَسْبِغْ عَطَايَاهُمْ مِنْ جِدَتِكَ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ وَكَثِّرْ عِدَّتَهُمْ وَاشْحَذْ أَسْلِحَتَهُمْ وَاحْرُسْ حَوْزَتَهُمْ وَامْنَعْ حَوْمَتَهُمْ وَأَلِّفْ جَمْعَهُمْ وَدَبِّرْ أَمْرَهُمْ وَوَاتِرْ بَيْنَ مِيَرِهِمْ وَتَوَحَّدْ بِكِفَايَةِ مُؤَنِهِمْ وَاعْضُدْهُمْ بِالنَّصْرِ وَأَعِنْهُمْ بِالصَّبْرِ وَالْطُفْ لَهُمْ فِي الْمَكْرِ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ وَعَرِّفْهُمْ مَا يَجْهَلُونَ وَعَلِّمْهُمْ مَا لَا يَعْلَمُونَ وَبَصِّرْهُمْ مَا لَا يُبْصِرُونَ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ وَأَنْسِهِمْ عِنْدَ لِقَائِهِمُ الْعَدُوَّ ذِكْرَ دُنْيَاهُمُ الْخَدَّاعَةِ الْغَرُورِ وَامْحُ عَنْ قُلُوبِهِمْ خَطَرَاتِ الْمَالِ الْفَتُونِ وَاجْعَلِ الْجَنَّةَ نُصْبَ أَعْيُنِهِمْ وَلَوِّحْ مِنْهَا لِأَبْصَارِهِمْ مَا أَعْدَدْتَ فِيهَا مِنْ مَسَاكِنِ الْخُلْدِ وَمَنَازِلِ الْكَرَامَةِ وَالْحُورِ الْحِسَانِ وَالْأَنْهَارِ الْمُطَّرِدَةِ بِأَنْوَاعِ الْأَشْرِبَةِ وَالْأَشْجَارِ الْمُتَدَلِّيَةِ بِصُنُوفِ الثَّمَرِ حَتَّى لَا يَهُمَّ أَحَدٌ مِنْهُمْ بِالْإِدْبَارِ وَلَا يُحَدِّثَ نَفْسَهُ عَنْ قِرْنِهِ بِفِرَارٍ اَللَّهُمَّ افْلُلْ بِذَلِكَ عَدُوَّهُمْ وَاقْلِمْ عَنْهُمْ أَظْفَارَهُمْ وَفَرِّقْ بَيْنَهُمْ وَبَيْنَ أَسْلِحَتِهِمْ وَاخْلَعْ وَثَائِقَ أَفْئِدَتِهِمْ وَبَاعِدْ بَيْنَهُمْ وَبَيْنَ أَزْوِدَتِهِمْ وَحَيِّرْهُمْ فِي سُبُلِهِمْ وَضَلِّلْهُمْ عَنْ وَجْهِهِمْ وَاقْطَعْ عَنْهُمُ الْمَدَدَ وَانْقُصْ مِنْهُمُ الْعَدَدَ وَامْلَأْ أَفْئِدَتَهُمُ الرُّعْبَ وَاقْبِضْ أَيْدِيَهُمْ عَنِ الْبَسْطِ وَاخْزِمْ أَلْسِنَتَهُمْ عَنِ النُّطْقِ وَشَرِّدْ بِهِمْ مَنْ خَلْفَهُمْ وَنَكِّلْ بِهِمْ مَنْ وَرَاءَهُمْ وَاقْطَعْ بِخِزْيِهِمْ أَطْمَاعَ مَنْ بَعْدَهُمْ اَللَّهُمَّ عَقِّمْ أَرْحَامَ نِسَائِهِمْ وَيَبِّسْ أَصْلَابَ رِجَالِهِمْ وَاقْطَعْ نَسْلَ دَوَابِّهِمْ وَأَنْعَامِهِمْ لَا تَأْذَنْ لِسَمَائِهِمْ فِي قَطْرٍ وَلَا لِأَرْضِهِمْ فِي نَبَاتٍ اَللَّهُمَّ وَقَوِّ بِذَلِكَ مِحَالَ أَهْلِ الْإِسْلَامِ وَحَصِّنْ بِهِ دِيَارَهُمْ وَثَمِّرْ بِهِ أَمْوَالَهُمْ وَفَرِّغْهُمْ عَنْ مُحَارَبَتِهِمْ لِعِبَادَتِكَ وَعَنْ مُنَابَذَتِهِمْ لِلْخَلْوَةِ بِكَ حَتَّى لَا يُعْبَدَ فِي بِقَاعِ الْأَرْضِ غَيْرُكَ وَلَا تُعَفَّرَ لِأَحَدٍ مِنْهُمْ جَبْهَةٌ دُونَكَ اَللَّهُمَّ اغْزُ بِكُلِّ نَاحِيَةٍ مِنَ الْمُسْلِمِينَ عَلَى مَنْ بِإِزَائِهِمْ مِنَ الْمُشْرِكِينَ وَأَمْدِدْهُمْ بِمَلَائِكَةٍ مِنْ عِنْدِكَ مُرْدِفِينَ حَتَّى يَكْشِفُوهُمْ إِلَى مُنْقَطَعِ التُّرَابِ قَتْلًا فِي أَرْضِكَ وَأَسْرًا أَوْ يُقِرُّوا بِأَنَّكَ أَنْتَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ اَللَّهُمَّ وَاعْمُمْ بِذَلِكَ أَعْدَاءَكَ فِي أَقْطَارِ الْبِلَادِ مِنَ الْهِنْدِ وَالرُّومِ وَالتُّرْكِ وَالْخَزَرِ وَالْحَبَشِ وَالنُّوبَةِ وَالزَّنْجِ وَالسَّقَالِبَةِ وَالدَّيَالِمَةِ وَسَائِرِ أُمَمِ الشِّرْكِ الَّذِينَ تَخْفَى أَسْمَاؤُهُمْ وَصِفَاتُهُمْ وَقَدْ أَحْصَيْتَهُمْ بِمَعْرِفَتِكَ وَأَشْرَفْتَ عَلَيْهِمْ بِقُدْرَتِكَ اَللَّهُمَّ اشْغَلِ الْمُشْرِكِينَ بِالْمُشْرِكِينَ عَنْ تَنَاوُلِ أَطْرَافِ الْمُسْلِمِينَ وَخُذْهُمْ بِالنَّقْصِ عَنْ تَنَقُّصِهِمْ وَثَبِّطْهُمْ بِالْفُرْقَةِ عَنِ الِاحْتِشَادِ عَلَيْهِمْ اَللَّهُمَّ أَخْلِ قُلُوبَهُمْ مِنَ الْأَمَنَةِ وَأَبْدَانَهُمْ مِنَ الْقُوَّةِ وَأَذْهِلْ قُلُوبَهُمْ عَنِ الِاحْتِيَالِ وَأَوْهِنْ أَرْكَانَهُمْ عَنْ مُنَازَلَةِ الرِّجَالِ وَجَبِّنْهُمْ عَنْ مُقَارَعَةِ الْأَبْطَالِ وَابْعَثْ عَلَيْهِمْ جُنْدًا مِنْ مَلَائِكَتِكَ بِبَأْسٍ مِنْ بَأْسِكَ كَفِعْلِكَ يَوْمَ بَدْرٍ تَقْطَعُ بِهِ دَابِرَهُمْ وَتَحْصُدُ بِهِ شَوْكَتَهُمْ وَتُفَرِّقُ بِهِ عَدَدَهُمْ اَللَّهُمَّ وَامْزُجْ مِيَاهَهُمْ بِالْوَبَاءِ وَأَطْعِمَتَهُمْ بِالْأَدْوَاءِ وَارْمِ بِلَادَهُمْ بِالْخُسُوفِ وَأَلِحَّ عَلَيْهَا بِالْقُذُوفِ وَافْرَعْهَا بِالْمُحُولِ وَاجْعَلْ مِيَرَهُمْ فِي أَحَصِّ أَرْضِكَ وَأَبْعَدِهَا عَنْهُمْ وَامْنَعْ حُصُونَهَا مِنْهُمْ أَصِبْهُمْ بِالْجُوعِ الْمُقِيمِ وَالسُّقْمِ الْأَلِيمِ اَللَّهُمَّ وَأَيُّمَا غَازٍ غَزَاهُمْ مِنْ أَهْلِ مِلَّتِكَ أَوْ مُجَاهِدٍ جَاهَدَهُمْ مِنْ أَتْبَاعِ سُنَّتِكَ لِيَكُونَ دِينُكَ الْأَعْلَى وَحِزْبُكَ الْأَقْوَى وَحَظُّكَ الْأَوْفَى فَلَقِّهِ الْيُسْرَ وَهَيِّئْ لَهُ الْأَمْرَ وَتَوَلَّهُ بِالنُّجْحِ وَتَخَيَّرْ لَهُ الْأَصْحَابَ وَاسْتَقْوِ لَهُ الظَّهْرَ وَأَسْبِغْ عَلَيْهِ فِي النَّفَقَةِ وَمَتِّعْهُ بِالنَّشَاطِ وَأَطْفِ عَنْهُ حَرَارَةَ الشَّوْقِ وَأَجِرْهُ مِنْ غَمِّ الْوَحْشَةِ وَأَنْسِهِ ذِكْرَ الْأَهْلِ وَالْوَلَدِ وَآثِرْ لَهُ حُسْنَ النِّيَّةِ وَتَوَلَّهُ بِالْعَافِيَةِ وَأَصْحِبْهُ السَّلَامَةَ وَأَعْفِهِ مِنَ الْجُبْنِ وَأَلْهِمْهُ الْجُرْأَةَ وَارْزُقْهُ الشِّدَّةَ وَأَيِّدْهُ بِالنُّصْرَةِ وَعَلِّمْهُ السِّيَرَ وَالسُّنَنَ وَسَدِّدْهُ فِي الْحُكْمِ وَاعْزِلْ عَنْهُ الرِّيَاءَ وَخَلِّصْهُ مِنَ السُّمْعَةِ وَاجْعَلْ فِكْرَهُ وَذِكْرَهُ وَظَعْنَهُ وَإِقَامَتَهُ فِيكَ وَلَكَ فَإِذَا صَافَّ عَدُوَّكَ وَعَدُوَّهُ فَقَلِّلْهُمْ فِي عَيْنِهِ وَصَغِّرْ شَأْنَهُمْ فِي قَلْبِهِ وَأَدِلْ لَهُ مِنْهُمْ وَلَا تُدِلْهُمْ مِنْهُ فَإِنْ خَتَمْتَ لَهُ بِالسَّعَادَةِ وَقَضَيْتَ لَهُ بِالشَّهَادَةِ فَبَعْدَ أَنْ يَجْتَاحَ عَدُوَّكَ بِالْقَتْلِ وَبَعْدَ أَنْ يَجْهَدَ بِهِمُ الْأَسْرُ وَبَعْدَ أَنْ تَأْمَنَ أَطْرَافُ الْمُسْلِمِينَ وَبَعْدَ أَنْ يُوَلِّيَ عَدُوُّكَ مُدْبِرِينَ اَللَّهُمَّ وَأَيُّمَا مُسْلِمٍ خَلَفَ غَازِيًا أَوْ مُرَابِطًا فِي دَارِهِ أَوْ تَعَهَّدَ خَالِفِيهِ فِي غَيْبَتِهِ أَوْ أَعَانَهُ بِطَائِفَةٍ مِنْ مَالِهِ أَوْ أَمَدَّهُ بِعَتَادٍ أَوْ شَحَذَهُ عَلَى جِهَادٍ أَوْ أَتْبَعَهُ فِي وَجْهِهِ دَعْوَةً أَوْ رَعَى لَهُ مِنْ وَرَائِهِ حُرْمَةً فَآجِرْ لَهُ مِثْلَ أَجْرِهِ وَزْنًا بِوَزْنٍ وَمِثْلًا بِمِثْلٍ وَعَوِّضْهُ مِنْ فِعْلِهِ عِوَضًا حَاضِرًا يَتَعَجَّلُ بِهِ نَفْعَ مَا قَدَّمَ وَسُرُورَ مَا أَتَى بِهِ إِلَى أَنْ يَنْتَهِيَ بِهِ الْوَقْتُ إِلَى مَا أَجْرَيْتَ لَهُ مِنْ فَضْلِكَ وَأَعْدَدْتَ لَهُ مِنْ كَرَامَتِكَ اَللَّهُمَّ وَأَيُّمَا مُسْلِمٍ أَهَمَّهُ أَمْرُ الْإِسْلَامِ وَأَحْزَنَهُ تَحَزُّبُ أَهْلِ الشِّرْكِ عَلَيْهِمْ فَنَوَى غَزْوًا أَوْ هَمَّ بِجِهَادٍ فَقَعَدَ بِهِ ضَعْفٌ أَوْ أَبْطَأَتْ بِهِ فَاقَةٌ أَوْ أَخَّرَهُ عَنْهُ حَادِثٌ أَوْ عَرَضَ لَهُ دُونَ إِرَادَتِهِ مَانِعٌ فَاكْتُبِ اسْمَهُ فِي الْعَابِدِينَ وَأَوْجِبْ لَهُ ثَوَابَ الْمُجَاهِدِينَ وَاجْعَلْهُ فِي نِظَامِ الشُّهَدَاءِ وَالصَّالِحِينَ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ وَآلِ مُحَمَّدٍ صَلَاةً عَالِيَةً عَلَى الصَّلَوَاتِ مُشْرِفَةً فَوْقَ التَّحِيَّاتِ صَلَاةً لَا يَنْتَهِي أَمَدُهَا وَلَا يَنْقَطِعُ عَدَدُهَا كَأَتَمِّ مَا مَضَى مِنْ صَلَوَاتِكَ عَلَى أَحَدٍ مِنْ أَوْلِيَائِكَ إِنَّكَ الْمَنَّانُ الْحَمِيدُ الْمُبْدِئُ الْمُعِيدُ الْفَعَّالُ لِمَا تُرِيدُ''',
    ),
    Dua(
      title: 'دعاء البهاء',
      benefits: 'من أدعية السحر في شهر رمضان المبارك المروية عن الإمام الرضا (ع)',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ بَهَائِكَ بِأَبْهَاهُ وَكُلُّ بَهَائِكَ بَهِيٌّ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِبَهَائِكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ جَمَالِكَ بِأَجْمَلِهِ وَكُلُّ جَمَالِكَ جَمِيلٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِجَمَالِكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ جَلَالِكَ بِأَجَلِّهِ وَكُلُّ جَلَالِكَ جَلِيلٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِجَلَالِكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ عَظَمَتِكَ بِأَعْظَمِهَا وَكُلُّ عَظَمَتِكَ عَظِيمَةٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِعَظَمَتِكَ كُلِّهَا اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ نُورِكَ بِأَنْوَرِهِ وَكُلُّ نُورِكَ نَيِّرٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِنُورِكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ رَحْمَتِكَ بِأَوْسَعِهَا وَكُلُّ رَحْمَتِكَ وَاسِعَةٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ كُلِّهَا اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كَلِمَاتِكَ بِأَتَمِّهَا وَكُلُّ كَلِمَاتِكَ تَامَّةٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِكَلِمَاتِكَ كُلِّهَا اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كَمَالِكَ بِأَكْمَلِهِ وَكُلُّ كَمَالِكَ كَامِلٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِكَمَالِكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ أَسْمَائِكَ بِأَكْبَرِهَا وَكُلُّ أَسْمَائِكَ كَبِيرَةٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَسْمَائِكَ كُلِّهَا اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ عِزَّتِكَ بِأَعَزِّهَا وَكُلُّ عِزَّتِكَ عَزِيزَةٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِعِزَّتِكَ كُلِّهَا اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ مَشِيئَتِكَ بِأَمْضَاهَا وَكُلُّ مَشِيئَتِكَ مَاضِيَةٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِمَشِيئَتِكَ كُلِّهَا اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ قُدْرَتِكَ بِالْقُدْرَةِ الَّتِي اسْتَطَلْتَ بِهَا عَلَى كُلِّ شَيْءٍ وَكُلُّ قُدْرَتِكَ مُسْتَطِيلَةٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِقُدْرَتِكَ كُلِّهَا اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ عِلْمِكَ بِأَنْفَذِهِ وَكُلُّ عِلْمِكَ نَافِذٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِعِلْمِكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ قَوْلِكَ بِأَرْضَاهُ وَكُلُّ قَوْلِكَ رَضِيٌّ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِقَوْلِكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ مَسَائِلِكَ بِأَحَبِّهَا إِلَيْكَ وَكُلُّ مَسَائِلِكَ إِلَيْكَ حَبِيبَةٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِمَسَائِلِكَ كُلِّهَا اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ شَرَفِكَ بِأَشْرَفِهِ وَكُلُّ شَرَفِكَ شَرِيفٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِشَرَفِكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ سُلْطَانِكَ بِأَدْوَمِهِ وَكُلُّ سُلْطَانِكَ دَائِمٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِسُلْطَانِكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ مُلْكِكَ بِأَفْخَرِهِ وَكُلُّ مُلْكِكَ فَاخِرٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِمُلْكِكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ عُلُوِّكَ بِأَعْلَاهُ وَكُلُّ عُلُوِّكَ عَالٍ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِعُلُوِّكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ مَنِّكَ بِأَقْدَمِهِ وَكُلُّ مَنِّكَ قَدِيمٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِمَنِّكَ كُلِّهِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ آيَاتِكَ بِأَكْرَمِهَا وَكُلُّ آيَاتِكَ كَرِيمَةٌ اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِآيَاتِكَ كُلِّهَا اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِمَا أَنْتَ فِيهِ مِنَ الشَّأْنِ وَالْجَبَرُوتِ وَأَسْأَلُكَ بِكُلِّ شَأْنٍ وَحْدَهُ وَجَبَرُوتٍ وَحْدَهَا اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِمَا تُجِيبُنِي بِهِ حِينَ أَسْأَلُكَ فَأَجِبْنِي يَا اللَّهُ ثُمَّ سَلْ حَاجَتَكَ فَإِنَّهَا تُقْضَى الْبَتَّةَ''',
    ),
    Dua(
      title: 'دعاء الحزين',
      benefits: 'يُستحب قراءته بعد صلاة الليل وهو دعاء عظيم الشأن',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

اَللّـهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ: أُنَاجِيكَ يَا مَوْجُودُ فِي كُلِّ مَكَانٍ لَعَلَّكَ تَسْمَعُ نِدَائِي، فَقَدْ عَظُمَ جُرْمِي وَقَلَّ حَيَائِي، مَوْلَايَ يَا مَوْلَايَ، أَيَّ الْأَهْوَالِ أَتَذَكَّرُ وَأَيُّهَا أَنْسَىٰ؟ وَلَوْ لَمْ يَكُنْ إِلَّا الْمَوْتُ لَكَفَىٰ، كَيْفَ وَمَا بَعْدَ الْمَوْتِ أَعْظَمُ وَأَدْهَىٰ؟ مَوْلَايَ يَا مَوْلَايَ، حَتَّىٰ مَتَىٰ وَإِلَىٰ مَتَىٰ أَقُولُ لَكَ الْعُتْبَىٰ مَرَّةً بَعْدَ أُخْرَىٰ ثُمَّ لَا تَجِدُ عِنْدِي صِدْقًا وَلَا وَفَاءً، فَيَا غَوْثَاهُ ثُمَّ وَاغَوْثَاهُ بِكَ يَا اللَّهُ، مِنْ هَوًى قَدْ غَلَبَنِي، وَمِنْ عَدُوٍّ قَدِ اسْتَكْلَبَ عَلَيَّ، وَمِنْ دُنْيَا قَدْ تَزَيَّنَتْ لِي، وَمِنْ نَفْسٍ أَمَّارَةٍ بِالسُّوءِ إِلَّا مَا رَحِمَ رَبِّي، مَوْلَايَ يَا مَوْلَايَ، إِنْ كُنْتَ رَحِمْتَ مِثْلِي فَارْحَمْنِي، وَإِنْ كُنْتَ قَبِلْتَ مِثْلِي فَاقْبَلْنِي، يَا قَابِلَ السَّحَرَةِ، اقْبَلْنِي يَا مَنْ لَمْ أَزَلْ أَتَعَرَّفُ مِنْهُ الْحُسْنَىٰ، يَا مَنْ يُغَذِّينِي بِالنِّعَمِ صَبَاحًا وَمَسَاءً، ارْحَمْنِي يَوْمَ آتِيكَ فَرْدًا شَاخِصًا إِلَيْكَ بَصَرِي، مُقَلَّدًا عَمَلِي، قَدْ تَبَرَّأَ جَمِيعُ الْخَلْقِ مِنِّي، نَعَمْ وَأَبِي وَأُمِّي وَمَنْ كَانَ لَهُ كَدِّي وَسَعْيِي، فَإِنْ لَمْ تَرْحَمْنِي فَمَنْ يَرْحَمُنِي؟ وَمَنْ يُؤْنِسُ فِي الْقَبْرِ وَحْشَتِي؟ وَمَنْ يُنْطِقُ لِسَانِي إِذَا خَلَوْتُ بِعَمَلِي وَسَاءَلْتَنِي عَمَّا أَنْتَ أَعْلَمُ بِهِ مِنِّي؟ فَإِنْ قُلْتُ نَعَمْ، فَأَيْنَ الْمَهْرَبُ مِنْ عَدْلِكَ؟ وَإِنْ قُلْتُ لَمْ أَفْعَلْ، قُلْتَ: أَلَمْ أَكُنِ الشَّاهِدَ عَلَيْكَ؟ فَعَفْوُكَ عَفْوُكَ يَا مَوْلَايَ قَبْلَ سَرَابِيلِ الْقَطِرَانِ، عَفْوُكَ عَفْوُكَ يَا مَوْلَايَ قَبْلَ جَهَنَّمَ وَالنِّيرَانِ، عَفْوُكَ عَفْوُكَ يَا مَوْلَايَ قَبْلَ أَنْ تُغَلَّ الْأَيْدِي إِلَى الْأَعْنَاقِ، يَا أَرْحَمَ الرَّاحِمِينَ وَخَيْرَ الْغَافِرِينَ.''',
    ),
    Dua(
      title: 'دعاء أم داوود',
      benefits: 'دعاء عظيم يُقرأ في النصف من رجب لقضاء الحوائج وكشف الكروب',
      text: '''بسم الله الرحمن الرحيم

صَدَقَ اللهُ العَظيمُ الَّذي لا إلهَ إلاّ هُوَ الحَيُّ القَيّومُ ذو الجَلالِ وَالإكرامِ الرَّحمنُ الرَّحيمُ الحَليمُ الكَريمُ الَّذي لَيسَ كَمِثلِهِ شيءٌ وَهُوَ السَّميعُ العَليمُ البَصيرُ الخَبيرُ، شَهِدَ اللهُ أنَّهُ لا إلهَ إلاّ هُوَ وَالمَلائِكَةُ وَأولو العِلمِ قائِماً بِالقِسطِ لا إلهَ إلاّ هُوَ العَزيزُ الحَكيمُ وَبَلَّغَت رُسُلُهُ الكِرامُ وَأنا عَلى ذلِكَ مِنَ الشَّاهِدينَ، اللهُمَّ لَكَ الحَمدُ وَلَكَ المَجدُ وَلَكَ العِزُّ وَلَكَ الفَخرُ وَلَكَ القَهرُ وَلَكَ النِّعمَةُ وَلَكَ العَظَمَةُ وَلَكَ الرَّحمَةُ وَلَكَ المَهابَةُ وَلَكَ السُّلطانُ وَلَكَ البَهاءُ وَلَكَ الامتِنانُ وَلَكَ التَّسبيحُ وَلَكَ التَّقديسُ وَلَكَ التَّهليلُ وَلَكَ التَّكبيرُ وَلَكَ ما يُرى وَلَكَ ما لا يُرى وَلَكَ ما فَوقَ السَّماواتِ العُلى وَلَكَ ما تَحتَ الثَّرى وَلَكَ الأرضونَ السُّفلى وَلَكَ الآخرةُ وَالاُولى وَلَكَ ما تَرضى بِهِ مِنَ الثَّناءِ وَالحَمدِ وَالشُّكرِ وَالنَّعماءِ اللهُمَّ صَلِّ عَلى جَبرَائيلَ أمينِكَ عَلى وَحيِكَ وَالقَويِّ عَلى أمرِكَ وَالمُطاعِ في سَماواتِكَ وَمَحالِّ كَراماتِكَ المُتَحَمِّلِ لِكَلِماتِكَ النَّاصِرِ لأنبيائِكَ المُدَمِّرِ لأعدائِكَ، اللهُمَّ صَلِّ عَلى ميكائيل مَلَكِ رَحمَتِكَ وَالمَخلوقِ لِرَأفَتِكَ وَالمُستَغفِرِ المُعينِ لأهلِ طاعَتِكَ، اللهُمَّ صَلِّ عَلى إسرافيلَ حامِلِ عَرشِكَ وَصاحِبِ الصُورِ المُنتَظِرِ لأمرِكَ الوَجِلِ المُشفِقِ مِن خيفِتكَ، اللهُمَّ صَلِّ عَلى حَمَلَةِ العَرشِ الطَّاهِرينَ وَعَلى السَّفَرَةِ الكِرامِ البَرَرَةِ الطَّيِّبينَ وَعَلى مَلائِكَتِكَ الكِرامِ الكاتِبينَ وَعَلى مَلائِكَةِ الجِنانِ وَخَزَنَةِ النّيرانِ وَمَلَكِ المَوتِ وَالأعوانِ يا ذَا الجَلالِ وَالإكرامِ، اللهُمَّ صَلِّ عَلى أبينا آدَمَ بَديعِ فِطرَتِكَ الَّذي كَرَّمتَهُ بِسُجودِ مَلائِكَتِكَ وَأبَحتَهُ جَنَّتَكَ، اللهُمَّ صَلِّ عَلى اُمِّنا حَوَّاءَ المُطَهَّرَةِ مِنَ الرِّجسِ المُصَفَّاةِ مِنَ الدَّنَسِ المُفَضَّلَةِ مِنَ الإنسِ المُتَرَدِّدَةِ بَينَ مَحالِّ القُدسِ، اللهُمَّ صَلِّ عَلى هابيلَ وَشيثَ وَإدريسَ وَنوحٍ وَهودٍ وَصالِحٍ وَإبراهيمَ وَإسماعيلَ وَإسحاقَ وَيَعقوبَ وَيوسُفَ وَالأسباطِ وَلوطٍ وَشُعَيبٍ وَأيّوبَ وَموسى وَهارونَ وَيوشَعَ وَميشا وَالخِضرِ وَذي القَرنَينِ وَيونُسَ وَإلياسَ وَاليَسَعَ وَذي الكِفلِ وَطَالوتَ وَداودَ وَسُلَيمانَ وَزَكَريا وَشَعيا وَيَحيى وَتورَخَ وَمَتّى وَإرميا وَحَيقوقَ وَدانيا لَ وَعُزَيرٍ وَعَيسى وَشَمعونَ وَجِرجيسَ وَالحَواريّينَ وَالأتباعِ وَخالِدٍ وَحَنظَلَةَ وَلُقمانَ، اللهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَارحَم مُحَمَّداً وَآلَ مُحَمَّدٍ وَبارِك عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَما صَلَّيتَ وَرَحِمتَ وَبارَكتَ عَلى إبراهيمَ وَآلِ إبراهيمَ إنَّكَ حَميدٌ مَجيدٌ، اللهُمَّ صَلِّ عَلى الأوصياءِ وَالسُّعَداءِ وَالشُّهداءِ وَأئِمَّةِ الهُدى، اللهُمَّ صَلِّ عَلى الأبدالِ وَالأوتادِ وَالسُّياحِ وَالعُبّادِ وَالمُخلِصينَ وَالزُّهّادِ وَأهلِ الجِدِّ وَالاجتِهادِ، وَاخصُص مُحَمَّداً وَأهلَ بَيتِهِ بِأفضَلِ صَلَواتِكَ وَأجزَلِ كَراماتِكَ وَبَلِّغ روحَهُ وَجَسَدَهُ مِنّي تَحيَّةً وَسَلاماً وَزِدهُ فَضلاً وَشَرَفاً وَكَرَماً حَتّى تُبَلِّغَهُ أعلى دَرَجاتِ أهلِ الشَّرَفِ مِنَ النَّبيّينَ وَالمُرسَلينَ وَالأفاضِلِ المُقَرَّبينَ، اللهُمَّ صَلِّ عَلى مَن سَمَّيتُ وَمَن لَم اُسَمِّ مِن مَلائِكَتِكَ وَأنبيائِكَ ورُسُلِكَ وَأهلِ طاعَتِكَ وَأوصِل صَلَواتي إلَيهِم وَإلى أرواحِهِم وَاجعَلهُم إخواني فيكَ وَأعواني عَلى دُعائِكَ، اللهُمَّ إنّي أستَشفِعُ بِكَ إلَيكَ وَبِكَرَمِكَ إلى كَرَمِكَ وَبِجودِكَ إلى جودِكَ وَبِرَحمَتِكَ إلى رَحمَتِكَ وَبِأهلِ طاعَتِكَ إلَيكَ، وَأسألُكَ اللهُمَّ بِكُلِّ ما سألَكَ بِهِ أحَدٌ مِنهُم مِن مَسألَةٍ شَريفَةٍ غَيرِ مَردودَةٍ وَبِما دَعَوكَ بِهِ مِن دَعوةٍ مُجابَةٍ غَيرِ مُخَيَّبَةٍ ؛ يا اللهُ يا رَحمنُ يا رَحيمُ يا حَليمُ يا كَريمُ يا عَظيمُ يا جَليلُ يا مُنيلُ يا جَميلُ يا كَفيلُ يا وَكيلُ يا مُقيلُ يا مُجيرُ يا خَبيرُ يا مُنيرُ يا مُبيرُ يا مَنيعُ يا مُديلُ يا مُحيلُ يا كَبيرُ يا قَديرُ يا بَصيرُ يا شَكورُ يا بَرُّ يا طُهرُ يا طاهِرُ يا قاهِرُ يا ظاهِرُ يا باطِنُ يا ساتِرُ يا مُحيطُ يا مُقتَدِرُ يا حَفيظُ يا مُتَجَبِّرُ يا قَريبُ يا وَدودُ يا حَميدُ يا مَجيدُ يا مُبدئُ يا مُعيدُ يا شَهيدُ يا مُحسِنُ يا مُجمِلُ يا مُنعِمُ يا مُفضِلُ يا قابِضُ يا باسِطُ يا هادي يا مُرسِلُ يا مُرشِدُ يا مُسَدِّدُ يا مُعطي يا مانِعُ يا دافِعُ يا رافِعُ يا باقي يا واقي يا خَلاّقُ يا وَهَّابُ يا تَوَّابُ يا فَتَّاحُ يا نَفَّاحُ يا مُرتاحُ يا مَن بيَدِهِ كُلُّ مِفتاحٍ يا نَفَّاعُ يا رَؤُفُ يا عَطوفُ يا كافي يا شافي يا مُعافي يا مُكافي يا وَفيُّ يا مُهَيمِنُ يا عَزيزُ يا جَبَّارُ يا مُتَكَبِّرُ يا سَلامُ يا مُؤمِنُ يا أحَدُ يا صَمَدُ يا نورُ يا مُدَبِّرُ يا فَردُ يا وِترُ يا قُدّوسُ يا ناصِرُ يا مُؤنِسُ يا باعِثُ يا وارِثُ يا عالِمُ يا حاكِمُ يا بادي يا مُتَعالِى يا مُصَوِّرُ يا مُسلِّمُ يا مُتَحَبِّبُ يا قائِمُ يا دائِمُ يا عَليمُ يا حَكيمُ يا جَوادُ يا بارئُ يا بارُّ يا سارُّ يا عَدلُ يا فاصِلُ يا دَيانُ يا حَنَّاُن يا مَنَّانُ يا سَميعُ يا بَديعُ يا خَفيرُ يا مُعينُ يا ناشِرُ يا غافِرُ يا قَديمُ يا مُسَهِّلُ يا مُيَسِّرُ يا مُميتُ يا مُحيي يا نافِعُ يا رازِقُ يا مُقتَدِرُ يا مُسَبِّبُ يا مُغيثُ يا مُغني يا مُقني يا خالِقُ يا راصِدُ يا واحِدُ يا حاضِرُ يا جابِرُ يا حافِظُ يا شَديدُ يا غيا ثُ يا عائِدُ يا قابِضُ، يا مَن عَلا فَاستَعلى فَكانَ بِالمَنظَرِ الأعلى يا مَن قَرُبَ فَدَنا وَبَعُدَ فَنَأى وَعَلِمَ السِّرَّ وَأخفى يا مَن إلَيهِ التَّدبيرُ وَلَهُ المَقاديرُ وَيا مَن العَسيرُ عَلَيهِ سَهلٌ يَسيرٌ يا مَن هُوَ عَلى ما يَشاءُ قَديرٌ يا مُرسِلَ الرياحِ يا فالِقَ الإصباحِ يا باعِثَ الأرواحِ يا ذا الجودِ وَالسَّماحِ يا رادَّ ما قَد فاتَ يا ناشِرَ الأمواتِ يا جامِعَ الشَّتاتِ يا رَازِقَ مَن يَشاءُ بِغَيرِ حِسابٍ وَيا فاعِلَ ما يَشاءُ كَيفَ يَشاءُ وَيا ذا الجَلالِ وَالإكرامِ يا حَيُّ يا قَيّومُ يا حَيا حينَ لاحَيَّ يا حَيُّ يا مُحييَ المَوتَى يا حَيُّ لا إلهَ إلاّ أنتَ بَديعُ السَّماواتِ وَالأرضِ. يا إلهي وَسيِّدي صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَارحَم مُحَمَّداً وَآلَ مُحَمَّدٍ وَبارِك عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَما صَلَّيتَ وَبارَكتَ وَتَرحَمْتَ عَلى إبراهيمَ وَآلِ إبراهيمَ إنَّكَ حَميدٌ مَجيدٌ، وَارحَم ذُلّي وَفاقَتي وَفَقري وَانِفرادي وَوَحدَتي وَخُضوعي بَينَ يَدَيكَ وَاعتِمادي عَلَيكَ وَتَضَرُّعي إلَيكَ أدعوكَ دُعاءَ الخاضِعِ الذَّليلِ الخاشِعِ الخائِفِ المُشفِقِ البائِسِ المَهينِ الحَقيرِ الجائِعِ الفَقيرِ العائِذِ المُستَجيرِ المُقِرِّ بِذَنبِهِ المُستَغفِرِ مِنهُ المُستَكينِ لِرَبِّهِ دُعاءَ مَن أسلَمَتهُ ثِقَتُهُ وَرَفَضَتهُ أحِبَّتُهُ وَعظُمَت فَجيعَتُهُ، دُعاءَ حَرِقٍ حَزينٍ ضَعيفٍ مَهينٍ بائِسٍ مُستكينٍ بِكَ مُستَجيرٍ. اللهُمَّ وَأسألُكَ بأنَّكَ مَليكٌ وأنَّكَ ما تَشاءُ مِن أمرٍ يَكونُ وَأنَّكَ عَلى ما تَشاءُ قَديرٌ، وَأسألُكَ بِحُرمَةِ هذا الشَّهرِ الحَرامِ والبَيتِ الحَرامِ وَالبَلَدِ الحَرامِ وَالرُّكنِ وَالمَقامِ وَالمَشاعِرِ العِظامِ وَبِحَقِّ نِبيِّكَ مُحَمَّدٍ عَلَيهِ وَآلِهِ السَّلامُ، يا مَن وَهَبَ لآدَمَ شيثاً وَلإبراهيمَ إسماعيلَ وَإسحاقَ وَيا مَن رَدَّ يوسُفَ عَلى يَعقوبَ وَيا مَن كَشَفَ بَعدَ البَلاءِ ضُرَّ أيّوبَ يا رادَّ موسى عَلى اُمِّهِ وَزائِدَ الخِضرِ في عِلمِهِ وَيا مَن وَهَبَ لِداوُدَ سُلَيمانَ وَلِزَكَريا يَحيى وَلِمَريَمَ عيسى يا حافِظَ بِنتِ شُعَيبٍ وَيا كافِلَ وَلَدِ اُمِّ موسى، أسألُكَ أن تُصَلّيَ عَلى مُحَمَّدٍ وآلِ مُحَمَّدٍ وَأن تَغفِرَ لي ذُنوبي كُلَّها وَتُجيرَني مِن عَذابِكَ وَتُوجِبَ لي رِضوانَكَ وَأمانَكَ وَإحسانَكَ وَغُفرانَكَ وَجِنانَكَ. وَأسألُكَ أن تَفُكَّ عَنّي كُلَّ حَلَقَةٍ بَيني وَبَينَ مَن يُؤذيني وَتَفتَحَ لي كُلَّ بابٍ وَتُلَيِّنَ لي كُلَّ صَعبٍ وَتُسَهِّلَ لي كُلَّ عَسيرٍ وَتُخرِسَ عَنّي كُلَّ ناطِقٍ بِشَرٍّ وَتَكُفَّ عَنّي كُلَّ باغٍ وَتَكبِتَ عَنّي كُلَّ عَدوٍّ لي وَحاسِدٍ وَتَمنَعَ مِنّي كُلَّ ظالِمٍ وَتَكفيَني كُلَّ عائِقٍ يَحولُ بَيني وَبَينَ حاجَتي وَيُحاوِلُ أن يُفَرِّقَ بَيني وَبَينَ طاعَتِكَ وَيُثَبِّطَني عَن عِبادَتِكَ، يا مَن ألجَمَ الجِنَّ المُتَمَرِّدينَ وَقَهَرَ عُتاةَ الشَّياطينِ وَأذَلَّ رِقابَ المُتَجَبِّرينَ وَرَدَّ كَيدَ المُتَسَلِّطينَ عَنِ المُستَضعَفينَ، أسألُكَ بِقُدرَتِكَ عَلى ما تَشاءُ وَتَسهيلِكَ لِما تَشاءُ كَيفَ تَشاءُ أن تَجعَلَ قَضاء حاجَتي فيما تَشاءُ. ثمّ اسجد على الأرض وعفّر خدّيك وقل: اللهُمَّ لَكَ سَجَدتُ وَبِكَ آمَنتُ فارحَم ذُلّي وَفاقَتي وَاجتِهادي وَتَضَرُّعي وَمَسكَنَتي وَفَقري إلَيكَ يا رَبِّ. 

واجتهد ان تسحّ عيناك ولو بقدر رأس الذبابة دموعاً، فإنّ ذلك من علامة الإجابة.''',
    ),
    Dua(
      title: 'دعاء يا مفزعي عند كربتي',
      benefits: 'دعاء مروي عن الإمام الصادق (ع) لطلب الفرج ودفع الشدائد',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

يَا مَفْزَعِي عِنْدَ كُرْبَتِي وَيَا غَوْثِي عِنْدَ شِدَّتِي إِلَيْكَ فَزِعْتُ وَبِكَ اسْتَغَثْتُ وَبِكَ لُذْتُ لَا أَلُوذُ بِسِوَاكَ وَلَا أَطْلُبُ الْفَرَجَ إِلَّا مِنْكَ فَأَغِثْنِي وَفَرِّجْ عَنِّي يَا مَنْ يَقْبَلُ الْيَسِيرَ وَيَعْفُو عَنِ الْكَثِيرِ اقْبَلْ مِنِّي الْيَسِيرَ وَاعْفُ عَنِّي الْكَثِيرَ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ اَللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا تُبَاشِرُ بِهِ قَلْبِي وَيَقِينًا حَتَّى أَعْلَمَ أَنَّهُ لَنْ يُصِيبَنِي إِلَّا مَا كَتَبْتَ لِي وَرَضِّنِي مِنَ الْعَيْشِ بِمَا قَسَمْتَ لِي يَا أَرْحَمَ الرَّاحِمِينَ يَا عُدَّتِي فِي كُرْبَتِي وَيَا صَاحِبِي فِي شِدَّتِي وَيَا وَلِيِّي فِي نِعْمَتِي وَيَا غَايَتِي فِي رَغْبَتِي أَنْتَ السَّاتِرُ عَوْرَتِي وَالْآمِنُ رَوْعَتِي وَالْمُقِيلُ عَثْرَتِي فَاغْفِرْ لِي خَطِيئَتِي يَا أَرْحَمَ الرَّاحِمِينَ

وتسبح أيضًا بهذه التسبيحات المروية في الإقبال

سُبْحَانَ مَنْ يَعْلَمُ جَوَارِحَ الْقُلُوبِ
سُبْحَانَ مَنْ يُحْصِي عَدَدَ الذُّنُوبِ
سُبْحَانَ مَنْ لَا يَخْفَى عَلَيْهِ خَافِيَةٌ فِي السَّمَاوَاتِ وَالْأَرْضِينَ
سُبْحَانَ الرَّبِّ الْوَدُودِ
سُبْحَانَ الْفَرْدِ الْوِتْرِ
سُبْحَانَ الْعَظِيمِ الْأَعْظَمِ
سُبْحَانَ مَنْ لَا يَعْتَدِي عَلَى أَهْلِ مَمْلَكَتِهِ
سُبْحَانَ مَنْ لَا يُؤَاخِذُ أَهْلَ الْأَرْضِ بِأَلْوَانِ الْعَذَابِ
سُبْحَانَ الْحَنَّانِ الْمَنَّانِ
سُبْحَانَ الرَّؤُوفِ الرَّحِيمِ
سُبْحَانَ الْجَبَّارِ الْجَوَادِ
سُبْحَانَ الْكَرِيمِ الْحَلِيمِ
سُبْحَانَ الْبَصِيرِ الْعَلِيمِ
سُبْحَانَ الْبَصِيرِ الْوَاسِعِ
سُبْحَانَ اللَّهِ عَلَى إِقْبَالِ النَّهَارِ
سُبْحَانَ اللَّهِ عَلَى إِدْبَارِ النَّهَارِ
سُبْحَانَ اللَّهِ عَلَى إِدْبَارِ اللَّيْلِ وَإِقْبَالِ النَّهَارِ
وَلَهُ الْحَمْدُ وَالْمَجْدُ وَالْعَظَمَةُ وَالْكِبْرِيَاءُ مَعَ كُلِّ نَفَسٍ وَكُلِّ طَرْفَةِ عَيْنٍ وَكُلِّ لَمْحَةٍ سَبَقَ فِي عِلْمِهِ
سُبْحَانَكَ مِلْءَ مَا أَحْصَى كِتَابُكَ
سُبْحَانَكَ زِنَةَ عَرْشِكَ
سُبْحَانَكَ سُبْحَانَكَ سُبْحَانَكَ''',
    ),
    Dua(
      title: 'دعاء القاموس',
      benefits: 'ويُعرف أيضاً بدعاء السيفي الصغير، لقضاء الحوائج ودفع البلاء',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

رَبِّ أَدْخِلْنِي فِي لُجَّةِ بَحْرِ أَحَدِيَّتِكَ وَطَمْطَامِ يَمِّ وَحْدَانِيَّتِكَ وَقَوِّنِي بِقُوَّةِ سَطْوَةِ سُلْطَانِ فَرْدَانِيَّتِكَ حَتَّى أَخْرُجَ إِلَى فَضَاءِ سَعَةِ رَحْمَتِكَ وَفِي وَجْهِي لَمَعَاتُ بَرْقِ الْقُرْبِ مِنْ آثَارِ حِمَايَتِكَ مَهِيبًا بِهَيْبَتِكَ عَزِيزًا بِعِنَايَتِكَ مُتَجَلِّلًا مُكَرَّمًا بِتَعْلِيمِكَ وَتَزْكِيَتِكَ وَأَلْبِسْنِي خِلَعَ الْعِزَّةِ وَالْقَبُولِ وَسَهِّلْ لِي مَنَاهِجَ الْوُصْلَةِ وَالْوُصُولِ وَتَوِّجْنِي بِتَاجِ الْكَرَامَةِ وَالْوَقَارِ وَأَلِّفْ بَيْنِي وَبَيْنَ أَحِبَّائِكَ فِي دَارِ الدُّنْيَا وَدَارِ الْقَرَارِ وَارْزُقْنِي مِنْ نُورِ اسْمِكَ هَيْبَةً وَسَطْوَةً تَنْقَادُ لِيَ الْقُلُوبُ وَالْأَرْوَاحُ وَتَخْضَعُ لَدَيَّ النُّفُوسُ وَالْأَشْبَاحُ يَا مَنْ ذَلَّتْ لَهُ رِقَابُ الْجَبَابِرَةِ وَخَضَعَتْ لَدَيْهِ أَعْنَاقُ الْأَكَاسِرَةِ لَا مَلْجَأَ وَلَا مَنْجَى مِنْكَ إِلَّا إِلَيْكَ وَلَا إِعَانَةَ إِلَّا بِكَ وَلَا اتِّكَاءَ إِلَّا عَلَيْكَ ادْفَعْ عَنِّي كَيْدَ الْحَاسِدِينَ وَظُلُمَاتِ شَرِّ الْمُعَانِدِينَ وَارْحَمْنِي تَحْتَ سُرَادِقَاتِ عَرْشِكَ يَا أَكْرَمَ الْأَكْرَمِينَ أَيِّدْ ظَاهِرِي فِي تَحْصِيلِ مَرَاضِيكَ وَنَوِّرْ قَلْبِي وَسِرِّي بِالِاطِّلَاعِ عَلَى مَنَاهِجِ مَسَاعِيكَ إِلَهِي كَيْفَ أَصْدُرُ عَنْ بَابِكَ بِخَيْبَةٍ مِنْكَ وَقَدْ وَرَدْتُهُ عَلَى ثِقَةٍ بِكَ وَكَيْفَ تُؤْيِسُنِي مِنْ عَطَائِكَ وَقَدْ أَمَرْتَنِي بِدُعَائِكَ وَهَا أَنَا مُقْبِلٌ عَلَيْكَ مُلْتَجِئٌ إِلَيْكَ بَاعِدْ بَيْنِي وَبَيْنَ أَعْدَائِي كَمَا بَاعَدْتَ بَيْنَ أَعْدَائِي اخْتَطِفْ أَبْصَارَهُمْ عَنِّي بِنُورِ قُدْسِكَ وَجَلَالِ مَجْدِكَ إِنَّكَ أَنْتَ اللَّهُ الْمُعْطِي جَلَائِلَ النِّعَمِ الْمُكَرَّمَةِ لِمَنْ نَاجَاكَ بِلَطَائِفِ رَحْمَتِكَ يَا حَيُّ يَا قَيُّومُ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ وَصَلَّى اللَّهُ عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ وَآلِهِ أَجْمَعِينَ الطَّيِّبِينَ الطَّاهِرِينَ''',
    ),

    Dua(
      title: 'دعاء كميل بن زياد',
      benefits: 'من أعظم الأدعية، يُقرأ ليلة الجمعة ولغفران الذنوب وكفاية شر الأعداء',
      text: '''بسم الله الرحمن الرحيم 

اللّهُمَّ إِنِّي أَسأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ وَبِقُوَّتِكَ الَّتِي قَهَرْتَ بِها كُلَّ شَيْءٍ وَخضَعَ لَها كُلُّ شَيْءٍ وَذَلَّ لَها كُلُّ شَيْءٍ وَبِجَبَرُوتِكَ الَّتِي غَلَبْتَ بِها كُلَّ شَيْءٍ وَبعَزَّتِكَ الَّتِي لا يَقُومُ لَها شَيْءٌ وَبِعَظَمَتِكَ الَّتِي مَلَأَتْ كُلَّ شَيْءٍ وَبِسُلْطانِكَ الَّذِي عَلَا كُلَّ شَيْءٍ وَبِوَجْهِكَ الباقِي بَعْدَ فَناءِ كُلِّ شَيْءٍ وَبِأَسْمائِكَ الَّتِي مَلَأَتْ أَرْكانَ كُلِّ شَيْءٍ وَبِعِلْمِكَ الَّذِي أَحاطَ بِكُلِّ شَيْءٍ وَبِنُورِ وَجْهِكَ الَّذِي أَضاءَ لَهُ كُلُّ شَيْءٍ يا نوُرُ يا قُدُّوسُ يا أَوَّلَ الأَوَّلِينَ وَيا آخِرَ الآخرينَ اللّهُمَّ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تَهْتِكُ العِصَمَ اللّهُمَّ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُنْزِلُ النِّقَمَ اللّهُمَّ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُغَيِّرُ النِّعَمَ اللّهُمَّ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تَحْبِسُ الدُّعاءَ اللّهُمَّ اغْفِرْ لِيَ الّذنُوبَ الّتي تُنْزِلُ البَلَاء اللّهُمَّ اغْفِرْ لِي كُلَّ ذَنْبٍ أذْنَبْتُهُ وَكُلَّ خَطِيئَةٍ أَخْطَأْتُها اللّهُمَّ إِنِّي أَتَقَرَّبُ إِلَيْكَ بِذِكْرِكَ وَأَسْتَشفِعُ بِكَ إِلى نَفْسِكَ وَأَسْأَلُكَ بِجوُدِكَ أَنْ تُدْنِيَنِي مِنْ قُرْبِكَ وَأَنْ تُوزِعَنِي شُكْرَكَ وأَنْ تُلْهِمَنِي ذِكْرَكَ اللّهُمَّ إِنِّي أَسأَلُكَ سُؤالَ خاضِعٍ مُتَذَلِّلٍ خاشِعٍ أَنْ تُسامِحَنِي وَتَرْحَمَنِي وَتَجْعَلَنِي بِقِسْمِكَ راضِياً قانِعاً وَفِي جَمِيعِ الأَحْوالِ مُتَواضِعاً اللّهُمَّ وَأَسأَلُكَ سُؤالَ مَنِ اِشْتَدَّتْ فاقَتُهُ وَأَنْزَلَ بِكَ عِنْدَ الشَّدائِدِ حاجَتَهُ وَعَظُمَ فِيما عِنْدَكَ رَغْبَتُهُ اللّهُمَّ عَظُمَ سُلْطانُكَ وَعَلَا مَكانُكَ وَخَفِيَ مَكْرُكَ وَظَهَرَ أَمْرُكَ وَغَلَبَ قَهْرُكَ وَجَرَتْ قُدْرَتُكَ وَلا يُمْكِنُ الفِرارُ مِنْ حُكُومَتِكَ اللّهُمَّ لا أَجِدُ لِذُنُوبِي غافِراً وَلا لِقَبائِحِي سَاتِراً وَلا لِشَيْءٍ مِنْ عَمَلِيَ القَبِيحِ بِالحَسَنِ مُبَدِّلاً غَيْرَكَ لا إِلهَ إِلَّا أَنْتَ سُبْحانَكَ وَبِحَمْدِكَ ظَلَمْتُ نَفْسِي وَتَجَرَّأْتُ بِجَهْلِي وَسَكَنْتُ إِلى قَدِيمِ ذِكْرِكَ لِي وَمَنِّكَ عَلَيَّ اللّهُمَّ مَوْلايَ كَمْ مِنْ قَبيحٍ سَتَرْتَهُ وَكَمْ مِنْ فادِحٍ مِنَ البَلاءِ أَقَلْتَهُ وَكَمْ مِنْ عِثارٍ وَقَيْتَهُ وَكَمْ مِنْ مَكْروُهٍ دَفَعْتَهُ وَكَمْ مِنْ ثَناءٍ جَمِيلٍ لَسْتُ أَهْلاً لَهُ نَشَرْتَهُ اللّهُمَّ عَظُمَ بَلائِي وَأَفْرَطَ بِي سُوءُ حَالِي وَقَصُرَتْ بِي أَعْمالِي وَقَعَدَتْ بِي أَغْلالِي وَحَبَسَنِي عَنْ نَفْعِي بُعْدُ أَمَلِي وَخَدَعَتْنِي الدُّنْيا بِغُرُورِها وَنَفْسِي بِخِيانَتِها وَمِطالِي يا سَيِّدِي فَأَسْأَلُكَ بِعِزَّتِكَ أَنْ لا يَحْجُبَ عَنْكَ دُعائِي سُوءُ عَمَلِي وَفِعالِي وَلا تَفْضَحَنِي بِخَفِيِّ ما اطَّلَعْتَ عَلَيْهِ مِنْ سِرِّي وَلا تُعاجِلْنِي بِالعُقُوبَةِ عَلى مَا عَمِلْتُهُ فِي خَلَواتِي مِنْ سُوءِ فِعْلِي وَإِساءَتِي وَدَوامِ تَفْرِيطِي وَجَهالَتِي وَكَثْرَةِ شَهَواتِي وَغَفْلَتِي وَكُنِ اللّهُمَّ بِعِزَّتِكَ لِي فِي كُلِّ الأَحْوالِ رَؤُوفاً وَعَلَيَّ فِي جَمِيعِ الأُمُورِ عَطُوفاً إِلهِي وَرَبِّي مَنْ لِي غَيْرُكَ أَسأَلُهُ كَشْفَ ضُرِّي وَالنَّظَرَ فِي أَمْرِي إِلهِي وَمَوْلايَ أَجْرَيْتَ عَلَيَّ حُكْماً اتَّبَعْتُ فِيهِ هَوى نَفْسِي وَلَمْ أَحْتَرِسْ فِيهِ مِنْ تَزْيينِ عَدُوِّي فَغَرَّنِي بِما أَهْوى وَأَسْعَدَهُ عَلى ذلِكَ القَضاءُ فَتَجاوَزْتُ بِما جَرى عَلَيَّ مِنْ ذلِكَ بَعْضَ حُدُودِكَ وَخالَفْتُ بَعْضَ أَوامِرِكَ فَلَكَ الحَمْدُ عَلَيَّ فِي جَمِيعِ ذلِكَ وَلا حُجَّةَ لِي فِيما جَرى عَلَيَّ فِيهِ قَضاؤُكَ وَأَلْزَمَنِي حُكْمُكَ وَبَلاؤُكَ وَقَدْ أَتَيْتُكَ يا إِلهِي بَعْدَ تَقْصِيرِي وَإِسْرافِي عَلَى نَفْسِي مُعْتَذِراً نادِماً مُنْكَسِراً مُسْتَقِيلاً مُسْتَغْفِراً مُنِيباً مُقِرّاً مُذْعِناً مُعْتَرِفاً لا أَجِدُ مَفَرّاً مِمّا كانَ مِنِّي وَلا مَفْزَعاً أَتَوَجَّهُ إِلَيْهِ فِي أَمْرِي غَيْرَ قَبُوُلِكَ عُذْرِي وَإِدْخالِكَ إِيّايَ فِي سَعَةٍ مِنْ رَحْمَتِكَ اللّهُمَّ فَاقْبَلْ عُذْرِي وَارْحَمْ شِدَّةَ ضُرِّي وَفُكَّنِي مِنْ شَدِّ وَثاقِي يا رَبِّ ارْحَمْ ضَعْفَ بَدَنِي وَرِقَّةَ جِلْدِي وَدِقَّةَ عَظْمِي يامَنْ بَدَأَ خَلْقِي وَذِكْرِي وَتَرْبِيَتِي وَبِرِّي وَتَغْذِيَتِي هَبْنِي لابْتِداءِ كَرَمِكَ وَسالِفِ بِرِّكَ بِي يا إِلهِي وَسَيِّدِي وَرَبِّي أَتُراكَ مُعَذِّبِي بِنارِكَ بَعْدَ تَوْحِيدِكَ وَبَعْدَما انْطَوى عَلَيْهِ قَلْبِي مِنْ مَعْرِفَتِكَ وَلَهِجَ بِهِ لِسانِي مِنْ ذِكْرِكَ وَاعْتَقَدَهُ ضَمِيرِي مِنْ حُبِّكَ وَبَعْدَ صِدْقِ اعْتِرافِي وَدُعائِي خَاضِعَاً لِرُبُوبِيَّتِكَ هَيْهاتَ أَنْتَ أَكْرَمُ مِنْ أَنْ تُضَيِّعَ مَنْ رَبَّيْتَهُ أَوْ تُبَعِّدَ مَنْ أَدْنَيْتَهُ أَوْ تُشَرِّدَ مَنْ آوَيْتَهُ أَوْ تُسَلِّمَ إِلى البَلاءِ مَنْ كَفَيْتَهُ وَرَحِمْتَهُ وَلَيْتَ شِعْرِي يا سَيِّدِي وَإِلهِي وَمَوْلايَ أَتُسَلِّطُ النّارَ عَلى وُجُوهٍ خَرَّتْ لِعَظَمَتِكَ ساجِدَةً وَعَلى أَلْسُنٍ نَطَقَتْ بِتَوْحِيدِكَ صادِقَةً وَبُشُكْرِكَ مادِحَةً وَعَلى قُلُوبٍ اعْتَرَفَتْ بِإِلهِيَّتِكَ مُحَقِّقَةً وَعَلَى ضَمائِرَ حَوَتْ مِنَ العِلْمِ بِكَ حَتّى صارَتْ خاشِعَةً وَعَلى جَوارِحَ سَعَتْ إِلى أَوْطانِ تَعَبُّدِكَ طائِعَةً وَأَشارَتْ بِاسْتِغْفارِكَ مُذْعِنَةً ما هكَذا الظَنُّ بِكَ وَلا أُخْبِرْنا بِفَضْلِكَ عَنْكَ يا كَرِيمُ يا رَبِّ وَأَنْتَ تَعْلَمُ ضَعْفِي عَنْ قَلِيلٍ مِنْ بَلاءِ الدُّنْيا وَعُقُوباتِها وَما يَجْرِي فِيها مِنَ المَكارِهِ عَلَى أَهْلِها عَلَى أَنَّ ذلِكَ بَلاءٌ وَمَكْرُوهٌ قَلِيلٌ مَكْثُهُ يَسِيرٌ بَقاؤهُ قَصِيٌر مُدَّتُهُ فَكَيْفَ احْتِمالِي لِبَلاءِ الآخِرَةِ وَجَلِيلِ وُقُوعِ المَكارِهِ فِيها وَهُوَ بَلاءٌ تَطُولُ مُدَّتُهُ وَيَدُومُ مَقامُهُ وَلا يُخَفَّفُ عَنْ أَهْلِهِ لأَنَّهُ لا يَكُونُ إِلَّا عَنْ غَضَبِكَ وَانْتِقامِكَ وَسَخَطِكَ وَهذا ما لا تَقُومُ لَهُ السَّماواتُ وَالأَرْضُ يا سَيِّدِي فَكَيْفَ بِي وَأَنَاْ عَبْدُكَ الضَّعِيفُ الذَّلِيلُ الحَقِيرُ المِسْكِينُ المُسْتَكِينُ يا إِلهِي وَرَبِّي وَسَيِّدِي وَمَوْلايَ لِأَيِّ الأُمُورِ إِلَيْكَ أَشْكُو وَلِما مِنها أَضِجُّ وَأَبْكِي لِأَلِيمِ العَذابِ وَشِدَّتِهِ أَمْ لِطُولِ البَلاءِ وَمُدَّتِهِ فَلَئِنْ صَيَّرْتَنِي لِلْعُقُوباتِ مَعَ أَعْدائِكَ وَجَمَعْتَ بَيْنِي وَبَيْنَ أَهْلِ بَلائِكَ وَفَرَّقْتَ بَيْنِي وَبَيْنَ أَحِبّائِكَ وَأَوْلِيائِكَ فَهَبْنِي يا إِلهِي وَسَيِّدِي وَمَوْلايَ وَرَبِّي صَبَرْتُ عَلَى عَذابِكَ فَكَيْفَ أَصْبِرُ عَلَى فِراقِكَ وَهَبْنِي صَبَرْتُ عَلى حَرِّ نارِكَ فَكَيْفَ أَصْبِرُ عَنِ النَّظَرِ إِلى كَرامَتِكَ أَمْ كَيْفَ أَسْكُنُ فِي النّارِ وَرَجَائِي عَفْوُكَ فَبِعِزَّتِكَ يا سَيِّدِي وَمَوْلايَ أُقْسِمُ صادِقاً لَئِنْ تَرَكْتَنِي نَاطِقاً لَأَضِجَّنَّ إِلَيْكَ بَيْنَ أَهْلِها ضَجِيجَ الآمِلِينَ وَلَأَصْرُخَنَّ إِلَيْكَ صُراخَ المُسْتَصْرِخِينَ وَلَأَبْكِيَنَّ عَلَيْكَ بُكاءَ الفاقِدِينَ وَلَأُنادِيَنَّكَ أَيْنَ أَنْتَ يا وَلِيَّ المُؤْمِنِينَ يا غايَةَ آمالِ العارِفِينَ يا غِياثَ المُسْتَغِيثِينَ يا حَبِيبَ قُلوُبِ الصّادِقِينَ وَيا إِلهَ العالَمينَ أَفَتُراكَ سُبْحانَكَ يا إِلهي وَبِحَمْدِكَ تَسْمَعُ فِيها صَوْتَ عَبْدٍ مُسْلِمٍ سُجِنَ فِيها بِمُخالَفَتِهِ وَذاقَ طَعْمَ عَذابِها بِمَعْصِيَتِهِ وَحُبِسَ بَيْنَ أَطْباقِها بِجُرْمِهِ وَجَرِيرَتِهِ وَهُوَ يَضِجُّ إِلَيْكَ ضَجِيجَ مُؤَمِّلٍ لِرَحْمَتِكَ وَيُنادِيكَ بِلِسانِ أَهْلِ تَوْحِيدِكَ وَيَتَوَسَّلُ إِلَيْكَ بِرُبُوبِيَّتِكَ يا مَوْلايَ فَكَيْفَ يَبْقَى فِي العَذابِ وَهُوَ يَرْجوُ ما سَلَفَ مِنْ حِلْمِكَ أَمْ كَيْفَ تُؤْلِمُهُ النَّارُ وَهُوَ يَأْمُلُ فَضْلَكَ وَرَحْمَتَكَ أَمْ كَيْفَ يُحْرِقُهُ لَهِيبُها وَأَنْتَ تَسْمَعُ صَوْتَهُ وَتَرى مَكانَهُ أَمْ كَيْفَ يَشْتَمِلُ عَلَيْهِ زَفِيرُها وَأَنْتَ تَعْلَمُ ضَعْفَهُ أَمْ كَيْفَ يَتَقَلْقَلُ بَيْنَ أَطْباقِها وَأَنْتَ تَعْلَمُ صِدْقَهُ أَمْ كَيْفَ تَزْجُرُهُ زَبانِيَتُها وَهُوَ يُنادِيكَ يا رَبَّاه أَمْ كَيْفَ يَرْجُو فَضْلَكَ فِي عِتْقِهِ مِنْها فَتَتْرُكَهُ فِيها هَيْهاتَ ما ذَلِكَ الظَّنُّ بِكَ وَلا المُعْروفُ مِنْ فَضْلِكَ وَلا مُشْبِهٌ لِما عامَلْتَ بِهِ المُوَحِّدِينَ مِنْ بِرِّكَ وَإِحْسانِكَ فَبِالْيَقِينِ أَقَطَعُ لَولا ما حَكَمْتَ بِهِ مِنْ تَعْذِيبِ جاحِدِيكَ وَقَضَيْتَ بِهِ مِنْ إِخْلادِ مُعانِدِيكَ لَجَعْلْتَ النَّارَ كُلَّها بَرْداً وَسَلاماً وَما كَانَ لِأَحَدٍ فِيها مَقَرّاً وَلا مُقاماً لكِنَّكَ تَقَدَّسَتْ أَسْماؤُكَ أَقْسَمْتَ أَنْ تَمْلَأَها مِنَ الكَافِرِينَ مِنَ الجِنَّةِ وَالنَّاسِ أَجْمَعِينَ وَأَنْ تُخَلِّدَ فِيها المُعانِدِينَ وَأَنْتَ جَلَّ ثَناؤُكَ قُلْتَ مُبْتَدِئاً وَتَطَوَّلْتَ بِالإِنْعامِ مُتَكَرِّماً أَفَمَنْ كَانَ مُؤْمِناً كَمَنْ كَانَ فَاسِقاً لَا يَسْتَوُونَ إِلهِي وَسَيِّدِي فَأَسْأَلُكَ بِالقُدْرَةِ الَّتِي قَدَّرْتَها وَبِالقَضِيَّةِ الَّتِي حَتَمْتَها وَحَكَمْتَها وَغَلَبْتَ مَنْ عَلَيْهِ أَجْرَيْتَها أَنْ تَهَبَ لِي فِي هذِهِ اللّيْلَةِ وَفِي هذِهِ السَّاعَةِ كُلَّ جُرْمٍ أَجْرَمْتُهُ وَكُلَّ ذَنْبٍ أَذْنَبْتُهُ وَكُلَّ قَبِيحٍ أَسْرَرْتُهُ وَكُلَّ جَهْلٍ عَمِلْتُهُ كَتَمْتُهُ أَوْ أَعْلَنْتُهُ أَخْفَيْتُهُ أَوْ أَظْهَرْتُهُ وَكُلَّ سَيِّئَةٍ أَمَرْتَ بِإِثْباتِها الكِرامَ الكاتِبِينَ الَّذِينَ وَكَّلْتَهُمْ بِحِفْظِ ما يَكُونُ مِنِّي وَجَعَلْتَهُمْ شُهُوداً عَلَيّ مَعَ جَوارِحِي وَكُنْتَ أَنْتَ الرَّقِيبَ عَلَيَّ مِنْ وَرائِهِمْ وَالشَّاهِدَ لِمَا خَفِي عَنْهُمْ وَبِرَحْمَتِكَ أَخْفَيْتَهُ وَبِفَضْلِكَ سَتَرْتَهُ وَأَنْ تُوَفِّرَ حَظِّي مِنْ كُلِّ خَيْرٍ أَنْزَلْتَهُ أَوْ إِحْسانٍ فَضَّلْتَهُ أَوْ بِرٍّ نَشَرْتَهُ أَوْ رِزْقٍ بَسَطْتَهُ أَوْ ذَنْبٍ تَغْفِرُهُ أَوْ خَطَأٍ تَسْتُرُهُ يا رَبِّ يا رَبِّ يا رَبِّ يا إِلهِي وَسَيِّدِي وَمَوْلايَ وَمالِكَ رِقِّي يامَنْ بِيَدِهِ ناصِيَتِي يا عَلِيماً بِضُرِّي وَمَسْكَنَتِي يا خَبِيراً بَفَقْرِي وَفاقَتِي يا رَبِّ يا رَبِّ يا رَبِّ أَسأَلُكَ بِحَقِكَ وَقُدْسِكَ وَأَعْظَمِ صِفاتِكَ وَأَسْمائِكَ أَنْ تَجْعَلَ أَوْقاتِي فِي اللّيْلِ وَالنَّهارِ بَذِكْرِكَ مَعْمُورَةً وَبِخِدْمَتِكَ مَوْصُولَةً وَأَعْمالِي عِنْدَكَ مَقْبُولَةً حَتَّى تَكُونَ أَعْمالِي وأوْرَادِي كُلُّها وِرْداً وَاحِداً وَحَالِي فِي خِدْمَتِكَ سَرْمَداً يا سَيِّدِي يامَنْ عَلَيْهِ مُعَوَّلِي يامَنْ إِلَيْهِ شَكَوْتُ أَحْوالِي يا رَبِّ يا رَبِّ يا رَبِّ قَوِّ عَلى خِدْمَتِكَ جَوارِحِي وَاشْدُدْ عَلى العَزِيمَةِ جَوانِحِي وَهَبْ لِيَ الجِدَّ فِي خَشْيَتِكَ وَالدَّوامَ فِي الاِتِّصالِ بِخِدْمَتِكَ حَتَّى أَسْرَحَ إِلَيْكَ فِي مَيادِينِ السابِقِينَ وأُسْرِعَ إِلَيْكَ فِي البَارِزِينَ وَأَشْتاقَ إِلى قُرْبِكَ فِي المُشْتاقِينَ وَأَدْنُوَ مِنْكَ دُنُوَّ المُخْلِصِينَ وَأَخافَكَ مَخافَةَ المُوقِنِينَ وَأَجْتَمِعَ فِي جِوارِكَ مَعَ المُؤْمِنِينَ اللّهُمَّ وَمَنْ أَرادَنِي بِسوءٍ فَأَرِدْهُ وَمَنْ كادَنِي فَكِدْهُ وَاجْعَلْنِي مِنْ أَحْسَنِ عَبِيدِكَ نَصِيباً عِنْدَكَ وَأَقْرَبِهِمْ مَنْزِلَةً مِنْكَ وَأَخَصِّهِمْ زُلْفَةً لَدَيْكَ فَإِنَّهُ لا يُنالُ ذلِكَ إِلَّا بِفَضْلِكَ وَجُدْ لِي بِجُودِكَ وَاعْطِفْ عَلَيَّ بَمَجْدِكَ وَاحْفَظْنِي بِرَحْمَتِكَ وَاجْعَلْ لِسانِي بِذِكْرِكَ لَهِجاً وَقَلْبِي بِحُبِّكَ مُتَيَّماً وَمُنَّ عَلَيَّ بِحُسْنِ إِجابَتِكَ وَأَقِلْنِي عَثْرَتِي وَاغْفِرْ زَلَّتِي فَإِنَّكَ قَضَيْتَ عَلَى عِبادِكَ بِعِبادَتِكَ وَأَمَرْتَهُمْ بِدُعائِكَ وَضَمِنْتَ لَهُمُ الْإِجابَةَ فَإِلَيْكَ يا رَبِّ نَصَبْتُ وَجْهِي وَإِلَيْكَ يا رَبِّ مَدَدْتُ يَدِي فَبِعِزَّتِكَ اسْتَجِبْ لِي دُعائِي وَبَلِّغْنِي مُنَايَ وَلا تَقْطَعْ مِنْ فَضْلِكَ رَجَائِي وَاكْفِنِي شَرَّ الجِنِّ وَالإِنْسِ مِنْ أعْدائِي يا سَرِيعَ الرِّضَا اغْفِرْ لِمَنْ لا يَمْلِكُ إِلَّا الدُّعاءَ فَإِنَّكَ فَعَّالٌ لِما تَشاءُ يامَنِ اسْمُهُ دَواءٌ وَذِكْرُهُ شِفاءٌ وَطاعَتُهُ غِنىً إِرْحَمْ مَنْ رَأسُ مالِهِ الرَّجاءُ وَسِلاحُهُ البُكاءُ يا سَابِغَ النِّعَمِ يا دافِعَ النِّقَمِ يا نُورَ المُسْتَوْحِشِينَ فِي الظُّلَمِ يا عالِماً لا يُعَلَّمُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَافْعَلْ بِي ما أَنْتَ أَهْلُهُ وَصَلَّى اللهُ عَلَى رَسُولِهِ وَالأَئِمَّةِ المَيامِينَ مِنْ آلِهِ وَسَلَّمَ تَسْلِيْمَاً كَثِيْرَاً''',
    ),
    Dua(
      title: 'دعاء المشلول',
      benefits: 'دعاء علمه أمير المؤمنين (ع) لشاب مشلول فشفاه الله ببركته، يُقرأ لغفران الذنوب وقضاء الحوائج',
      text: '''بسم الله الرحمن الرحيم

اَللَّهُمَّ إِنِّي أَسأَلُكَ بِاسْمِكَ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ يَا ذَا الْجَلالِ وَالإِكْرَامِ يَا حَيُّ يَا قَيُّومُ يَا حَيُّ لا إِلَهَ إِلَّا أَنْتَ يَا هُوَ يَا مَنْ لا يَعْلَمُ مَا هُوَ وَلا كَيْفَ هُوَ وَلا أَيْنَ هُوَ وَلا حَيْثُ هُوَ إِلَّا هُوَ يَا ذَا الْمُلْكِ وَالْمَلَكُوتِ يَا ذَا العِزَّةِ وَالْجَبَرُوتِ يَا مَلِكُ يَا قُدُّوسُ يَا سَلامُ يَا مُؤْمِنُ يَا مُهَيْمِنُ يَا عَزِيزُ يَا جَبَّارُ يَا مُتَكَبِّرُ يَا خَالِقُ يَا بَارِئُ يَا مُصَوِّرُ يَا مُفِيدُ يَا مُدَبِّرُ يَا شَدِيدُ يَا مُبْدِئُ يَا مُعِيدُ يَا مُبِيدُ يَا وَدُودُ يَا مَحْمُودُ يَا مَعْبُودُ يَا بَعِيدُ يَا قَرِيبُ يَا مُجِيبُ يَا رَقِيبُ يَا حَسِيبُ يَا بَدِيعُ يَا رَفِيعُ يَا مَنِيعُ يَا سَمِيعُ يَا عَلِيمُ يَا حَلِيمُ يَا كَرِيمُ يَا قَدِيمُ يَا عَلِيُّ يَا عَظِيمُ يَا حَنَّانُ يَا مَنَّانُ يَا دَيَّانُ يَا مُسْتَعَانُ يَا جَلِيلُ يَا جَمِيلُ يَا وَكِيلُ يَا كَفِيلُ يَا مُقِيلُ يَا مُنِيلُ يَا نَبِيلُ يَا دَلِيلُ يَا هَادِي يَا بَادِي يَا أَوَّلُ يَا آخِرُ يَا ظَاهِرُ يَا بَاطِنُ يَا قَائِمُ يَا دَائِمُ يَا عَالِمُ يَا حَاكِمُ يَا قَاضِي يَا عَادِلُ يَا فَاصِلُ يَا وَاصِلُ يَا طَاهِرُ يَا مُطَهِّرُ يَا قَادِرُ يَا مُقْتَدِرُ يَا كَبِيرُ يَا مُتَكَبِّرُ يَا وَاحِدُ يَا أَحَدُ يَا صَمَدُ يَا مَنْ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ وَلَمْ يَكُنْ لَهُ صَاحِبَةٌ وَلا كَانَ مَعَهُ وَزِيرٌ وَلا اتَّخَذَ مَعَهُ مُشِيراً وَلا احْتَاجَ إِلَى ظَهِيرٍ وَلا كَانَ مَعَهُ مِنْ إِلهٍ غَيْرُهُ لا إِلَهَ إِلَّا أَنْتَ فَتَعالَيْتَ عَمَّا يَقُولُ الظَّالِمُونَ عُلُوّاً كَبِيراً يَا عَلِيُّ يَا شَامِخُ يَا بَاذِخُ يَا فَتَّاحُ يَا نَفَّاحُ يَا مُرْتاحُ يَا مُفَرِّجُ يَا نَاصِرُ يَا مُنْتَصِرُ يَا مُدْرِكُ يَا مُهْلِكُ يَا مُنْتَقِمُ يَا بَاعِثُ يَا وَارِثُ يَا طالِبُ يَا غالِبُ يَا مَنْ لا يَفُوتُهُ هَارِبٌ يَا تَوّابُ يَا أَوَّابُ يَا وَهَّابُ يَا مُسَبِّبَ الأَسْبَابِ يَا مُفَتِّحَ الأَبْوَابِ يَا مَنْ حَيْثُمَا دُعِيَ أَجَابَ يَا طَهُورُ يَا شَكُورُ يَا عَفُوُّ يَا غَفُورُ يَا نُورَ النُّورِ يَا مُدَبِّرَ الأُمُورِ يَا لَطِيفُ يَا خَبِيرُ يَا مُجِيرُ يَا مُنِيرُ يَا بَصِيرُ يَا ظَهِيرُ يَا كَبِيرُ يَا وِتْرُ يَا فَرْدُ يَا أَبَدُ يَا سَنَدُ يَا صَمَدُ يَا كَافِي يَا شَافِي يَا وَافِي يَا مُعَافِي يَا مُحْسِنُ يَا مُجْمِلُ يَا مُنْعِمُ يَا مُفْضِلُ يَا مُتَكَرِّمُ يَا مُتَفَرِّدُ يَا مَنْ عَلَا فَقَهَرَ يَا مَنْ مَلَكَ فَقَدَرَ يَا مَنْ بَطَنَ فخَبَرَ يَا مَنْ عُبِدَ فَشَكَرَ يَا مَنْ عُصِيَ فَغَفَرَ يَا مَنْ لا تَحْوِيهِ الْفِكَرُ وَلا يُدْرِكُهُ بَصَرٌ وَلا يَخْفَى عَلَيْهِ أَثَرٌ يَا رَازِقَ الْبَشَرِ يَا مُقَدِّرَ كُلِّ قَدَرٍ يَا عَالِيَ الْمَكانِ يَا شَدِيدَ الأَرْكَانِ يَا مُبَدِّلَ الزَّمَانِ يَا قَابِلَ الْقُرْبَانِ يَا ذَا الْمَنِّ وَالإِحْسَانِ يَا ذَا الْعِزَّةِ وَالسُّلْطَانِ يَا رَحِيمُ يَا رَحْمَنُ يَا مَنْ هُوَ كُلَّ يَوْمٍ فِي شَأْنٍ يَا مَنْ لا يَشْغَلُهُ شَأْنٌ عَنْ شَأْنٍ يَا عَظِيمَ الشَّأْنِ يَا مَنْ هُوَ بِكُلِّ مَكانٍ يَا سَامِعَ الأَصْوَاتِ يَا مُجِيبَ الدَّعَوَاتِ يَا مُنْجِحَ الطَّلِبَاتِ يَا قاضِيَ الْحَاجَاتِ يَا مُنْزِلَ الْبَرَكاتِ يَا راحِمَ الْعَبَراتِ يَا مُقِيلَ الْعَثَرَاتِ يَا كَاشِفَ الكُرُبَاتِ يَا وَلِيَّ الْحَسَناتِ يَا رَافِعَ الدَّرَجَاتِ يَا مُؤْتِيَ السُّؤُلاتِ يَا مُحْيِيَ الأَمْوَاتِ يَا جَامِعَ الشَّتَاتِ يَا مُطَّلِعاً عَلَى النِّيَّاتِ يَا رَادَّ مَا قَدْ فَاتَ يَا مَنْ لا تَشْتَبِهُ عَلَيْهِ الأَصْوَاتُ يَا مَنْ لا تُضْجِرُهُ المَسْأَلاتُ وَلا تَغْشَاهُ الظُّلُمَاتُ يَا نُورَ الأَرْضِ وَالسَّمَاوَاتِ يَا سَابِغَ النِّعَمِ يَا دَافِعَ النِّقَمِ يَا بَارِئَ النَّسَمِ يَا جَامِعَ الأُمَُمِ يَا شَافِيَ السَّقَمِ يَا خَالِقَ النُّورِ وَالظُّلَمِ يَا ذَا الْجُودِ وَالْكَرَمِ يَا مَنْ لا يَطَأُ عَرْشَهُ قَدَمٌ يَا أَجْوَدَ الأَجْوَدِينَ يَا أَكْرَمَ الأَكْرَمِينَ يَا أَسْمَعَ السَّامِعِينَ يَا أَبْصَرَ النَّاظِرِينَ يَا جَارَ الْمُسْتَجِيرِينَ يَا أَمَانَ الْخائِفِينَ يَا ظَهْرَ اللَّاجِينَ اللَّاجِئِينَ يَا وَلِيَّ الْمُؤْمِنِينَ يَا غِيَاثَ المُسْتَغِيثِينَ يَا غايَةَ الطَّالِبِينَ يَا صَاحِبَ كُلِّ غَرِيبٍ يَا مُؤْنِسَ كُلِّ وَحِيدٍ يَا مَلْجَأَ كُلِّ طَرِيدٍ يَا مَأْوَى كُلِّ شَرِيدٍ يَا حَافِظَ كُلِّ ضَالَّةٍ يَا رَاحِمَ الشَّيْخِ الْكَبِيرِ يَا رَازِقَ الطِّفْلِ الصَّغِيرِ يَا جَابِرَ الْعَظْمِ الْكَسِيرِ يَا فَاكَّ كُلِّ أَسِيرِ يَا مُغْنِيَ الْبَائِسِ الْفَقِيرِ يَا عِصْمَةَ الْخَائِفِ الْمُسْتَجِيرِ يَا مَنْ لَهُ التَّدْبِيرُ وَالتَّقْدِيرُ يَا مَنِ الْعَسِيرُ عَلَيْهِ سَهْلٌ يَسِيرٌ يَا مَنْ لا يَحْتَاجُ إِلَى تَفْسِيرٍ يَا مَنْ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ يَا مَنْ هُوَ بِكُلِّ شَيْءٍ خَبِيرٌ يَا مَنْ هُوَ بِكُلِّ شَيْءٍ بَصِيرٌ يَا مُرْسِلَ الرِّيَاحِ يَا فَالِقَ الإِصْبَاحِ يَا بَاعِثَ الأَرْوَاحِ يَا ذَا الْجُودِ وَالسَّمَاحِ يَا مَنْ بِيَدِهِ كُلُّ مِفْتَاحٍ يَا سَامِعَ كُلِّ صَوْتٍ يَا سَابِقَ كُلِّ فَوْتٍ يَا مُحْيِيَ كُلِّ نَفْسٍ بَعْدَ الْمَوْتِ يَا عُدَّتِي فِي شِدَّتِي يَا حَافِظِي فِي غُرْبَتِي يَا مُؤْنِسِي فِي وَحْدَتِي يَا وَلِيِّي فِي نِعْمَتِي يَا كَهْفِي حِينَ تُعْيِينِي الْمَذاهِبُ وَتُسَلِّمُنِي الأَقَارِبُ وَيَخْذُلُنِي كُلُّ صَاحِبٍ يَا عِمَادَ مَنْ لا عِمَادَ لَهُ يَا سَنَدَ مَنْ لا سَنَدَ لَهُ يَا ذُخْرَ مَنْ لا ذُخْرَ لَهُ يَا حِرْزَ مَنْ لا حِرْزَ لَهُ يَا كَهْفَ مَنْ لا كَهْفَ لَهُ يَا كَنْزَ مَنْ لا كَنْزَ لَهُ يَا رُكْنَ مَنْ لا رُكْنَ لَهُ يَا غِيَاثَ مَنْ لا غِيَاثَ لَهُ يَا جَارَ مَنْ لا جَارَ لَهُ يَا جَارِيَ اللَّصِيقَ يَا رُكْنِيَ الْوَثِيقَ يَا إِلَهِي بِالتَّحْقِيقِ يَا رَبَّ الْبَيْتِ الْعَتِيقِ يَا شَفِيقُ يَا رَفِيقُ فُكَّنِي مِنْ حَلَقِ الْمَضِيقِ وَاصْرِفْ عَنِّي كُلَّ هَمٍّ وَغَمٍّ وَضِيقٍ وَاكْفِنِي شَرَّ ما لا أُطِيقُ وَأَعِنِّي عَلى مَا أُطِيقُ يَا رادَّ يُوسُفَ عَلى يَعْقُوبَ يَا كَاشِفَ ضُرِّ أَيُّوبَ يَا غَافِرَ ذَنْبِ دَاوُدَ يَا رَافِعَ عِيْسَى بْنِ مَرْيَمَ وَمُنْجِيَهُ مِنْ أَيْدِي الْيَهُودِ يَا مُجِيبَ نِداءِ يُونُسَ فِي الظُّلُمَاتِ يَا مُصْطَفِيَ مُوسَى بِالْكَلِمَاتِ يَا مَنْ غَفَرَ لآدَمَ خطِيئَتَهُ وَرَفَعَ إِدْرِيسَ مَكَاناً عَلِيَّاً بِرَحْمَتِهِ يَا مَنْ نَجَّى نُوحاً مِنَ الْغَرَقِ يَا مَنْ أَهْلَكَ عَاداً الأُوْلَى وَثَمُودَ فَمَا أَبْقَى وَقَوْمَ نُوْحٍ مِنْ قَبْلُ إِنَّهُمْ كَانُوا هُمْ أَظْلَمَ وَأَطْغَى وَالْمُؤْتَفِكَةَ أَهْوَى يَامَنْ دَمَّرَ عَلَى قَوْمِ لُوطٍ وَدَمْدَمَ عَلَى قَوْمِ شُعَيْبٍ يَا مَنِ اتَّخَذَ إِبْرَاهِيمَ خَلِيلاً يَا مَنِ اتَّخَذَ مُوسَى كَلِيماً وَاتَّخَذَ مُحَمَّداً صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَعَلَيْهِمْ أَجْمَعِينَ حَبِيباً يَا مُؤْتِيَ لُقْمَانَ الْحِكْمَةِ وَالْواهِبَ لِسُلَيْمَانَ مُلْكاً لا يَنْبَغِي لأَحَدٍ مِنْ بَعْدِهِ يَا مَنْ نَصَرَ ذَا الْقَرْنَيْنِ عَلَى المُلُوكِ الْجَبَابِرَةِ يَا مَنْ أَعْطَى الْخِضْرَ الحَيَاةَ وَرَدَّ لِيُوشَعَ بْنِ نُونٍ الشَّمْسَ بَعْدَ غُرُوبِهَا يَا مَن رَبَطَ عَلى قَلْبِ أُمِّ مُوسَى وَأَحْصَنَ فَرْجَ مَرْيَمَ ابْنَةِ عِمْرَانَ يَا مَنْ حَصَّنَ يَحْيَى بْنَ زَكَرِيَّا مِنَ الذَّنْبِ وَسَكَّنَ عَنْ مُوسَى الْغَضَبَ يَا مَنْ بَشَّرَ زَكَرِيَّا بِيَحْيَى يَا مَنْ فَدَى إِسْمَاعِيلَ مِنَ الذَّبْحِ بِذِبْحٍ عَظِيمٍ يَا مَنْ قَبِلَ قُرْبانَ هَابِيلَ وَجَعَلَ اللَّعْنَةَ عَلَى قابِيلَ يَا هَازِمَ الأَحْزابِ لِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَعَلَى جَمِيعِ الْمُرْسَلِينَ وَمَلائِكَتِكَ الْمُقَرَّبِينَ وَأَهْلِ طَاعَتِكَ أَجْمَعِينَ وَأَسْأَلُكَ بِكُلِّ مَسْأَلَةٍ سَأَلَكَ بِها أَحَدٌ مِمّن رََضِيتَ عَنْهُ فَحَتَمْتَ لَهُ عَلَى الإِجَابَةِ يَا أللهُ يَا أللهُ يَا أللهُ يَا رَحْمَنُ يَا رَحْمَنُ يَا رَحْمَنُ يَا رَحِيمُ يَا رَحِيمُ يَا رَحِيمُ يَا ذَا الْجَلالِ وَالإِكْرَامِ يَا ذَا الْجَلالِ وَالإِكْرَامِ يَا ذَا الْجَلالِ وَالإِكْرَامِ بِهِ بِهِ بِهِ بِهِ بِهِ بِهِ بِهِ أَسْأَلُكَ بِكُلِّ اسْمٍ سَمَّيْتَ بِهِ نَفْسَكَ أَوْ أَنْزَلْتَهُ فِي شَيْءٍ مِنْ كُتُبِكَ أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ وَبِمَعاقِدِ الْعِزِّ مِنْ عَرْشِكَ وَبِمُنْتَهَى الرَّحْمَةِ مِنْ كِتَابِكَ وَبِما لَوْ أَنَّ مَا فِي الأَرْضِ مِنْ شَجَرٍ أَقْلامٌ وَالْبَحْرُ يَمُدُّهُ مِنْ بَعْدِهِ سَبْعَةُ أَبْحُرٍ مَا نَفِدَتْ كَلِمَاتُ اللهِ إِنَّ اللهَ عَزِيزٌ حَكِيمٌ وَأَسْأَلُكَ بِأَسْمَائِكَ الْحُسْنَى الَّتِي نَعَتَّهَا فِي كِتَابِكَ فَقُلْتَ وَللهِ الأَسْمَاءُ الْحُسْنَى فَادْعُوهُ بِهَا وَقُلْتَ اُدْعُونِي أَسْتَجِبْ لَكُمْ وَقُلْتَ وَإِذَا سَأَلَكَ عِبادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ وَقُلْتَ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللهِ إِنَّ اللهَ يَغْفِرُ الذُّنُوبَ جَمِيعاً إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ''',
    ),
    Dua(
      title: 'دعاء العديلة',
      benefits: 'دعاء عظيم لتثبيت الإيمان والعقيدة عند سكرات الموت وحفظها من الشيطان',
      text: '''بسم الله الرحمن الرحيم 

شَهِدَ اللهُ أَنَّهُ لا إِلَهَ إِلَّا هُوَ وَالْمَلائِكَةُ وأُولُو الْعِلْمِ قائِماً بِالْقِسْطِ لا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ إِنَّ الدِّينَ عِنْدَ اللهِ الإِسْلامُ وَأَنَا الْعَبْدُ الضَّعِيفُ الْمُذْنِبُ الْعَاصِي الْمُحْتاجُ الْحَقِيرُ أَشْهَدُ لِمُنْعِمِي وَخَالِقِي وَرَازِقِي وَمُكْرِمِي كَمَا شَهِدَ لِذَاتِهِ وَشَهِدَتْ لَهُ الْمَلائِكَةُ وَأُولُو الْعِلْمِ مِنْ عِبَادِهِ بِأَنَّهُ لا إِلَهَ إِلَّا هُوَ ذُو النِّعَمِ وَالإِحْسانِ وَالْكَرَمِ وَالِامْتِنَانِ قادِرٌ أَزَلِيٌّ عَالِمٌ أَبَدِيٌّ حَيٌّ أَحَدِيٌّ مَوْجُودٌ سَرْمَدِيٌّ سَمِيعٌ بَصِيرٌ مُرِيدٌ كَارِهٌ مُدْرِكٌ صَمَدِيُّ يَسْتَحِقُّ هَذِهِ الصِّفَاتِ وَهُوَ عَلَى مَا هُوَ عَلَيْهِ فِي عِزِّ صِفَاتِهِ كَانَ قَوِيّاً قَبْلَ وُجُودِ الْقُدْرَةِ وَالْقُوَّةِ وَكَانَ عَلِيماً قَبْلَ إِيْجَادِ الْعِلْمِ وَالْعِلَّةِ لَمْ يَزَلْ سُلْطَاناً إِذْ لا مَمْلَكَةَ وَلا مَالَ وَلَمْ يَزَلْ سُبْحَاناً عَلَى جَمِيعِ الأَحْوالِ وُجُودُهُ قَبْلَ الْقَبْلِ فِي أَزَلِ الآزَالِ وَبَقَاؤُهُ بَعْدَ الْبَعْدِ مِنْ غَيْرِ انْتِقَالٍ وَلا زَوَالِ غَنِيٌّ فِي الأَوَّلِ وَالآخِرِ مُسْتَغْنٍ فِي الْبَاطِنِ وَالظَّاهِرِ لا جَوْرَ فِي قَضِيَّتِهِ وَلَا مَيْلَ فِي مَشِيئَتِهِ وَلَا ظُلْمَ فِي تَقْدِيرِهِ وَلَا مَهْرَبَ مِنْ حُكُوَمَتِهِ وَلَا مَلْجَأَ مِنْ سَطْوَتِهِ وَلَا مَنْجَى مِنْ نَقِمَاتِهِ سَبَقَتْ رَحْمَتُهُ غَضَبَهُ وَلا يَفُوتُهُ أَحَدٌ إِذَا طَلَبَهُ أَزَاحَ الْعِلَلِ فِي التَّكْلِيفِ وَسَوَّى التَّوْفِيقَ بَيْنَ الضَّعِيفِ وَالشَّرِيفِ مَكَّنَ أَدَاءَ الْمَأْمُورِ وَسَهَّلَ سَبِيلَ اجْتِنَابِ الْمَحْظُورِ لَمْ يُكَلِّفِ الطَّاعَةَ إِلَّا دُونَ الْوُسْعِ وَالطّاقَةِ سُبْحانَهُ مَا أَبْيَنَ كَرَمَهُ وَأَعْلى شَأْنَهُ سُبْحانَهُ مَا أَجَلَّ نَيْلَهُ وَأَعْظَمَ إِحْسَانَهُ بَعَثَ الأَنْبِيَاءَ لِيُبَيِّنَ عَدْلَهُ وَنَصَبَ الأَوْصِيَاء لِيُظْهِرَ طَوْلَهُ وَفَضْلَهُ وَجَعَلَنَا مِنْ أُمَّةِ سَيِّدِ الأَنْبِيَاءِ وَخَيْرِ الأَوْلِيَاء وَأَفْضَلِ الأَصْفِيَاء وَأَعْلَى الأَزْكِيَاءِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ آمَنَّا بِهِ وَبِمَا دَعَانَا إِلَيْهِ وَبِالْقُرْآنِ الَّذِي أَنْزَلَهُ عَلَيْهِ وَبِوَصِيِّهِ الَّذِي نَصَبَهُ يَوْمَ الْغَدِيرِ وَأَشارَ بِقَوْلِهِ هَذَا عَلِيٌّ إِلَيْهِ وَأَشْهَدُ أَنَّ الأَئِمَّةَ الأَبْرَارَ وَالْخُلَفَاءَ الأَخْيَارَ بَعْدَ الرَّسُولِ المُخْتَارِ عَلِيٌّ قامِعُ الَكُفَّارِ وَمِنْ بَعْدِهِ سَيِّدُ أَوْلادِهِ الحَسَنُ بْنُ عَلِيٍّ ثُمَّ أَخُوهُ السِّبْطُ التَّابِعُ لِمَرْضَاةِ اللهِ الْحُسَيْنُ ثُمَّ الْعَابِدُ عَلِيٌّ ثُمَّ الْبَاقِرُ مُحَمَّدٌ ثُمَّ الصَّادِقُ جَعْفَرٌ ثُمَّ الْكَاظِمُ مُوسَى ثُمَّ الرِّضَا عَلِيٌّ ثُمَّ التَّقِيُّ مُحَمَّدٌ ثُمَّ النَّقِيُّ عَلِيٌ ثُمَّ الزَّكِيُّ الْعَسْكَرِيُّ الْحَسَنُ ثُمَّ الْحُجَّةُ الْخَلَفُ الْقَائِمُ الْمُنْتَظَرُ الْمَهْدِيُّ المُرْجَى الَّذِي بِبَقائِهِ بَقِيَتْ الدُّنْيَا وَبِيُمْنِهِ رُزِقَ الْوَرَى وَبِوُجُودِهِ ثَبَتَتِ الأَرْضُ وَالسَّمَاءُ وَبِهِ يَمْلَأُ اللهُ الأَرْضَ قِسْطاً وَعَدْلاً بَعْدَ مَا مُلِئَتْ ظُلْماً وَجَوْراً وَأَشْهَدُ أَنَّ أَقْوَالَهُمْ حُجَّةٌ وَامْتِثَالَهُمْ فَرِيضَةٌ وَطَاعَتَهُمْ مَفْرُوضَةٌ وَمَوَدَّتَهُمْ لَازِمَةٌ مَقْضِيَّةٌ وَالاِقْتِدَاءَ بِهِمْ مُنْجِيَةٌ وَمُخالَفَتَهُمْ مُرْدِيَةٌ وَهُمْ سَادَاتُ أَهْلِ الْجَنَّةِ أَجْمَعِينَ وَشُفَعَاءُ يَوْمِ الدِّينِ وَأَئِمَّةُ أَهْلِ الأَرْضِ عَلَى الْيَقِينِ وَأَفْضَلُ الأَوْصِيَاءِ المَرْضِيِّينَ وَأَشْهَدُ أَنَّ الْمَوْتَ حَقٌّ وَمُساءَلَةَ الْقَبْرِ حَقٌّ وَالْبَعْثَ حَقٌّ وَالنُّشُورَ حَقٌّ وَالصِّرَاطَ حَقٌّ وَالْمِيزَانَ حَقٌّ وَالْحِسَابَ حَقٌّ وَالْكِتَابَ حَقٌّ وَالْجَنَّةَ حَقٌّ وَالنَّارَ حَقٌّ وَأَنَّ السَّاعَةَ آتِيَةٌ لا رَيْبَ فِيهَا وَأَنَّ اللهَ يَبْعَثُ مَنْ فِي الْقُبُورِ اَللَّهُمَّ فَضْلُكَ رَجَائِي وَكَرَمُكَ وَرَحْمَتُكَ أَمَلِي لا عَمَلَ لِي أَسْتَحِقُّ بِهِ الْجَنَّةَ وَلا طَاعَةَ لِي أَسْتَوْجِبُ بِهَا الرِّضْوانَ إِلَّا أَنِّي اعْتَقَدْتُ تَوْحِيدَكَ وَعَدْلَكَ وَارْتَجَيْتُ إِحْسَانَكَ وَفَضْلَكَ وَتَشَفَّعْتُ إِلَيْكَ بِالنَّبِيِّ وَآلِهِ مِنْ أَحِبَّتِكَ وَأَنْتَ أَكْرَمُ الأَكْرَمِينَ وَأَرْحَمُ الرَّاحِمِينَ وَصَلّى اللهُ عَلَى نَبِيِّنَا مُحَمَّدٍ وَآلِهِ أَجْمَعِينَ الطَّيِّبِينَ الطَّاهِرِينَ وَسَلَّمَ تَسْلِيماً كَثِيراً كَثِيراً وَلا حَوْلَ وَلا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ اَللَّهُمَّ يَا أَرْحَمَ الرَّاحِمِينَ إِنِّي أَوْدَعْتُكَ يَقِينِي هَذَا وَثَبَاتَ دِينِي وَأَنْتَ خَيْرُ مُسْتَوْدَعٍ وَقَدْ أَمَرْتَنَا بِحِفْظِ الْوَدائِعِ فَرُدَّهُ عَلَيَّ وَقْتَ حُضُورِ مَوْتِي بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dua(
      title: 'الدعاء في زمن الغيبة',
      benefits: 'دعاء يُقرأ في زمن غيبة الإمام المهدي (عج) لتثبيت العقيدة ودفع الشبهات',
      text: '''بسم الله الرحمن الرحيم

اَللَّهمَّ عرِّفْنِي نَفْسَكَ فَإِنَّكَ إِن لَّمْ تُعَرِّفْنِي نَفْسَكَ لَمْ أَعْرِفْ رَسُولَكَ اَللَّهمَّ عَرِّفْنِي رَسُولَكَ فَإِنَّكَ إِن لَّمْ تُعَرِّفْنِي رَسُولَكَ لَمْ أَعْرِفْ حُجَّتَكَ اَللَّهمَّ عَرِّفْنِي حُجَّتَكَ فَإِنَّكَ إِن لَّمْ تُعَرِّفْنِي حُجَّتَكَ ضَلَلْتُ عَنْ دِينِي اَللَّهمَّ لَا تُمِتْنِي مِيتَةً جَاهِلِيَّةً وَلَا تُزِغْ قَلْبِي بَعْدَ إِذْ هَدَيْتَنِي اَللَّهمَّ فَكَمَا هَدَيْتَنِي لِوَلَايَةِ مَنْ فَرَضْتَ عَلَيَّ طَاعَتَهُ مِن وُّلَاةِ أَمْرِكَ بَعْدَ رَسُولِكَ صَلَوَاتُكَ عَلَيْهِ وَآلِهِ حَتَّىٰ وَالَيْتُ وُلَاةَ أَمْرِكَ أَمِيرَ الْمُؤْمِنِينَ عَلِيَّ بْنَ أَبِي طَالِبٍ وَالْحَسَنَ وَالْحُسَيْنَ وَعَلِيًّا وَمُحَمَّداً وَجَعْفَراً وَمُوسَىٰ وَعَلِيًّا وَمُحَمَّداً وَعَلِيًّا وَالْحَسَنَ وَالْحُجَّةَ الْقَائِمَ الْمَهْدِيَّ صَلَوَاتُكَ عَلَيْهِمْ أَجْمَعِينَ''',
    ),
    Dua(
      title: 'دعاء علقمة',
      benefits: 'دعاء يُقرأ بعد زيارة عاشوراء لقضاء الحوائج ودفع شر الأعداء',
      text: '''بسم الله الرحمن الرحيم

يَا أَللهُ يَا أَللهُ يَا أَللهُ يَا مُجِيبَ دَعْوَةِ الْمُضْطَرِّينَ يَا كَاشِفَ كُرَبِ الْمَكْرُوبِينَ يَا غِيَاثَ الْمُسْتَغِيثِينَ يَا صَرِيخَ الْمُسْتَصْرِخِينَ وَيَا مَنْ هُوَ أَقْرَبُ إِلَيَّ مِنْ حَبْلِ الْوَرِيدِ وَيَا مَن يَّحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ وَيَا مَنْ هُوَ بِالْمَنْظَرِ الأَعْلَى وَ بِالأُفُقِ الْمُبِينِ وَيَا مَنْ هُوَ الرَّحْمَنُ الرَّحِيمُ عَلَى الْعَرْشِ اسْتَوَى وَيَا مَن يَّعْلَمُ خَائِنَةَ الأَعْيُنِ وَمَا تُخْفِي الصُّدُورُ وَيَا مَن لَّا تَخْفَى عَلَيْهِ خافِيَهٌ يَّا مَن لَّا تَشْتَبِهُ عَلَيْهِ الأَصْواتُ وَيَا مَن لَّا تُغَلِّطُهُ الْحَاجَاتُ وَيَا مَن لّا يُبْرِمُهُ إِلْحَاحُ الْمُلِحِّينَ يَا مُدْرِكَ كُلِّ فَوْتٍ وَيَا جَامِعَ كُلِّ شَمْلٍ وَيَا بَارِئَ النُّفُوسِ بَعْدَ الْمَوْتِ يَا مَنْ هُوَ كُلَّ يَوْمٍ فِي شَأْنٍ يَا قَاضِىَ الْحَاجَاتِ يَا مُنَفِّسَ الْكُرُبَاتِ يَا مُعْطِيَ السُّؤُلاتِ يَا وَلِيَّ الرَّغَبَاتِ يَا كَافِىَ الْمُهِمَّاتِ يَا مَن يَّكْفِي مِنْ كُلِّ شَيْءٍ وَّلا يَكْفِي مِنْهُ شَيْءٌ فِي السَّمَاوَاتِ وَالأَرْضِ أَسْاَلُكَ بِحَقِّ مُحَمَّدٍ خَاتَمِ النَّبِيِّينَ وَعَلِيِّ أَمِيرِ الْمُؤْمِنِينَ وَبِحَقِّ فَاطِمَةَ بِنْتِ نَبِيِّكَ وَبِحَقِّ الْحَسَنِ وَالْحُسَيْنِ فَإِنِّي بِهِمْ أَتَوَجَّهُ إِلَيْكَ فِي مَقَامِي هَذَا وَبِهِمْ أَتَوَسَّلُ وَبِهِمْ أَتَشَفَّعُ إِلَيْكَ وَبِحَقِّهِمْ أَسْأَلُكَ وَأُقْسِمُ وَأَعْزِمُ عَلَيْكَ وَبِالشَّأْنِ الَّذِي لَهُمْ عِنْدَكَ وَبِالْقَدْرِ الَّذِي لَهُمْ عِنْدَكَ وَبِالَّذِي فَضَّلْتَهُمْ عَلَى الْعَالَمِينَ وَبِاسْمِكَ الَّذِي جَعَلْتَهُ عِنْدَهُمْ وَبِهِ خَصَصْتَهُمْ دُونَ الْعَالَمِينَ وَبِهِ أَبَنْتَهُمْ وَأَبَنْتَ فَضْلَهُمْ مِنْ فَضْلِ الْعَالَمِينَ حَتَّى فَاقَ فَضْلُهُمْ فَضْلَ الْعَالَمِينَ جَمِيعاً أَسْاَلُكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَنْ تَكْشِفَ عَنِّي غَمِّي وَهَمِّي وَكَرْبِي وَتَكْفِيَنِى الْمُهِمَّ مِنْ أُمُورِي وَتَقْضِيَ عَنِّي دَيْنِي وَ تُجِيرَنِي مِنَ الْفَقْرِ وَتُجِيرَنِي مِنَ الْفَاقَةِ وَتُغْنِيَنِي عَنِ الْمَسْأَلَةِ إِلَى الَمَخْلُوقِينَ وَتَكْفِيَنِي هَمَّ مَنْ أَخافُ هَمَّهُ وَعُسْرَ مَنْ أَخَافُ عُسْرَهُ وَحُزُونَةَ مَنْ أَخَافُ حُزُونَتَهُ وَشَرَّ مَنْ أَخَافُ شَرَّهُ وَمَكْرَ مَنْ أَخَافُ مَكْرَهُ وَبَغْيَ مَنْ أَخَافُ بَغْيَهُ وَ جَوْرَ مَنْ أَخَافُ جَوْرَهُ وَسُلْطَانَ مَنْ أَخَافُ سُلْطَانَهُ وَكَيْدَ مَنْ أَخَافُ كَيْدَهُ وَمَقْدُِرَةَ مَنْ أَخَافُ مَقْدُِرَتَهُ عَلَيَّ وَتَرُدَّ عَنِّي كَيْدَ الْكَيَدَةِ وَمَكْرَ الْمَكَرَةِ اَللَّهُمَّ مَنْ أَرَادَنِي فَأَرِدْهُ وَمَنْ كَادَنِي فَكِدْهُ وَاصْرِفْ عَنِّي كَيْدَهُ وَمَكْرَهُ وَبَأْسَهُ وَأَمانِيَّهُ وَامْنَعْهُ عَنِّي كَيْفَ شِئْتَ وَأَنّى شِئْتَ اَللَّهُمَّ اشْغَلْهُ عَنِّي بِفَقْرٍ لَّا تَجْبُرُهُ وَبِبَلاءٍ لَّا تَسْتُرُهُ وَبِفَاقَةٍ لَّا تَسُدُّهَا وَبِسُقْمٍ لَّا تُعَافِيهِ وَذُلٍّ لَّا تُعِزُّهُ وَبِمَسْكَنَةٍ لَّا تَجْبُرُهَا اَللَّهُمَّ اضْرِب بِّالذُّلِّ نَصْبَ عَيْنَيْهِ وَأَدْخِلْ عَلَيْهِ الْفَقْرَ فِي مَنْزِلِهِ وَالْعِلَّةَ وَالسُّقْمَ فِي بَدَنِهِ حَتَّى تَشْغَلَهُ عَنِّي بِشُغْلٍ شَاغِلٍ لَّا فَرَاغَ لَهُ وَأَنْسِهِ ذِكْرِي كَمَا أَنْسَيْتَهُ ذِكْرَكَ وَخُذْ عَنِّي بِسَمْعِهِ وَبَصَرِهِ وَلِسَانِهِ وَيَدِهِ وَرِجْلِهِ وَقَلْبِهِ وَجَمِيعِ جَوَارِحِهِ وَأَدْخِلْ عَلَيْهِ فِي جَمِيعِ ذَلِكَ الْسُّقْمَ وَلَّا تَشْفِهِ حَتَّى تَجْعَلَ ذَلِكَ لَهُ شُغْلاً شَاغِلاً بِهِ عَنِّي وَعَنْ ذِكْرِي وَاكْفِنِي يَا كَافِيَ مَا لا يَكْفِي سِوَاكَ فَإِنَّكَ الْكَافِي لا كَافِىَ سِوَاكَ وَمُفَرِّجٌ لَّا مُفَرِّجَ سِوَاكَ وَمُغِيثٌ لَّا مُغِيثَ سِوَاكَ وَجَارٌ لَّا جَارَ سِوَاكَ خابَ مَنْ كَانَ جَارُهُ سِوَاكَ وَمُغِيثُهُ سِوَاكَ وَمَفْزَعُهُ إِلَى سِوَاكَ وَمَهْرَبُهُ إِلَى سِوَاكَ وَمَلْجَأُهُ إِلَى غَيْرِكَ وَمَنْجَاهُ مِن مَّخْلُوقٍ غَيْرِكَ فَأَنْتَ ثِقَتِي وَرَجَائِي وَمَفْزَعِي وَمَهْرَبِي وَمَلْجَئِي وَمَنْجَاىَ فَبِكَ أَسْتَفْتِحُ وَبِكَ أَسْتَنْجِحُ وَبِمُحَمَّدٍ وَّآلِ مُحَمَّدٍ أَتَوَجَّهُ إِلَيْكَ وَأَتَوَسَّلُ وَأَتَشَفَّعُ فَأَسْاَلُكَ يَا أَللهُ يَا أَللهُ يَا أَللهُ فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ وَإِلَيْكَ الْمُشْتَكَى وَأَنْتَ الْمُسْتَعَانُ فَأَسْاَلُكَ يَا أَللهُ يَا أَللهُ يَا أَللهُ بِحَقِّ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَّآلِ مُحَمَّدٍ وَأَنْ تَكْشِفَ عَنِّي غَمِّي وَهَمِّي وَكَرْبِي فِي مَقَامِي هَذَا كَمَا كَشَفْتَ عَن نَّبِيِّكَ هَمَّهُ وَغَمَّهُ وَكَرْبَهُ وَكَفَيْتَهُ هَوْلَ عَدُوِّهِ فَاكْشِفْ عَنِّي كَمَا كَشَفْتَ عَنْهُ وَفَرِّجْ عَنِّي كَمَا فَرَّجْتَ عَنْهُ وَاكْفِنِي كَمَا كَفَيْتَهُ وَاصْرِفْ عَنِّي هَوْلَ مَا أَخَافُ هَوْلَهُ وَمَؤُونَةَ مَا أَخَافُ مَؤُونَتَهُ وَهَمَّ مَا أَخَافُ هَمَّهُ بِلا مَؤُونَةٍ عَلَى نَفْسِي مِنْ ذَلِكَ وَاصْرِفْنِي بِقَضَاءِ حَوَائِجِي وَكِفَايَةِ مَا أَهَمَّنِي هَمُّهُ مِنْ أَمْرِ آخِرَتِي وَدُنْيَاىَ يَا أَمِيرَ الْمُؤْمِنِينَ وَيَا أَبَا عَبْدِ اللهِ عَلَيْكُما مِنِّي سَلامُ اللهِ أَبَداً مَّا بَقِيتُ وَبَقِيَ اللَّيْلُ وَالنَّهَارُ وَلا جَعَلَهُ اللهُ آخِرَ الْعَهْدِ مِنْ زِيَارَتِكُمَا وَلا فَرَّقَ اللهُ بَيْنِي وَبَيْنَكُمَا اَللَّهُمَّ أَحْيِنِي حَيَاةَ مُحَمَّدٍ وَّذُرِّيَّتِهِ وَأَمِتْنِي مَمَاتَهُمْ وَتَوَفَّنِي عَلَى مِلَّتِهِمْ وَاحْشُرْنِي فِي زُمْرَتِهِمْ وَلا تُفَرِّقْ بَيْنِي وَبَيْنَهُمْ طَرْفَةَ عَيْنٍ أَبَداً فِي الدُّنْيَا وَالآخِرَةِ يَا أمِيرَ الْمُؤْمِنِينَ وَيَا أَبَا عَبْدِ اللهِ أَتَيْتُكُمَا زَائِراً وَّمُتَوَسِّلاً إِلَى اللهِ رَبِّي وَرَبِّكُمَا وَمُتَوَجِّهاً إِلَيْهِ بِكُمَا وَمُسْتَشْفِعاً بِكُمَا إِلَى اللهِ تَعَالَى فِي حَاجَتِي هَذِهِ فَاشْفَعَا لِي فَإِنَّ لَكُمَا عِنْدَ اللهِ الْمَقَامَ الَمَحْمُودَ وَالْجَاهَ الْوَجِيهَ وَالْمَنْزِلَ الرَّفِيعَ وَالْوَسِيلَةَ إِنِّي أَنْقَلِبُ عَنْكُمَا مُنْتَظِراً لِّتَنَجُّزِ الْحَاجَةِ وَقَضَائِهَا وَنَجَاحِهَا مِنَ اللهِ بِشَفَاعَتِكُمَا لِي إِلَى اللهِ فِي ذَلِكَ فَلا أَخِيبُ وَلا يَكُونُ مُنْقَلَبِي مُنْقَلَباً خَائِباً خَاسِراً بَلْ يَكُونُ مُنْقَلَبِي مُنْقَلَباً رَاجِحاً رَّاجِياً مُّفْلِحاً مُّنْجِحاً مُّسْتَجَاباً بِقَضَاءِ جَمِيعِ حَوَائِجي وَتَشَفَّعَا لِي إِلَى اللهِ اِنْقَلَبْتُ عَلَى مَا شَاءَ اللهُ وَلا حَوْلَ وَلا قُوَّةَ إِلَّا بِاللهِ مُفَوِّضاً أَمْرِي إِلَى اللهِ مُلْجِأً ظَهْرِي إِلَى اللهِ مُتَوَكِّلاً عَلَى اللهِ وَأَقُولُ حَسْبِيَ اللهُ وَكَفَى سَمِعَ اللهُ لِمَنْ دَعَا لَيْسَ لِي وَرَاءَ اللهِ وَوَراءَكُمْ يَا سَادَتِي مُنْتَهًى مَّا شَاءَ رَبِّي كَانَ وَمَا لَمْ يَشَأْ لَمْ يَكُن وَّلا حَوْلَ وَلا قُوَّةَ إِلّا بِاللهِ أَسْتَوْدِعُكُمَا اللهَ وَلا جَعَلَهُ اللهُ آخِرَ الْعَهْدِ مِنِّي إِلَيْكُمَا اِنْصَرَفْتُ يَا سَيِّدِي يَا أَمِيرَ الْمُؤْمِنِينَ وَمَوْلايَ وَأَنْتَ يَا أَبَا عَبْدِ اللهِ يَا سَيِّدِي وَسَلامِي عَلَيْكُمَا مُتَّصِلٌ مَّا اتَّصَلَ اللَّيْلُ وَالنَّهَارُ وَاصِلٌ ذَلِكَ إِلَيْكُمَا غَيْرُ مَحْجُوبٍ عَنْكُمَا سَلامِي إِنْ شاءَ اللهُ وَأَسْأَلُهُ بِحَقِّكُمَا أَن يَّشَاءَ ذَلِكَ وَيَفْعَلَ فَإِنَّهُ حَمِيدٌ مَّجيدٌ اِنْقَلَبْتُ يَا سَيِّدَىَّ عَنْكُمَا تَائِباً حَامِداً للهِ شَاكِراً رَّاجِياً لِّلإِجَابَةِ غَيْرَ آيِسٍ وَلا قَانِطٍ تَائِباً عَائِداً رّاجِعاً إِلَى زِيَارَتِكُمَا غَيْرَ رَاغِب عَنْكُمَا وَلا مِنْ زِيَارَتِكُمَا بَل رَّاجِعٌ عَائِدٌ إِنْ شَاءَ اللهُ وَلا حَوْلَ وَلا قُوَّةَ إِلَّا بِاللهِ يَا سَادَتِي رَغِبْتُ إِلَيْكُمَا وَإِلَى زِِيَارَتِكُمَا بَعْدَ أَنْ زَهِدَ فِيكُمَا وَفِي زِيَارَتِكُمَا أَهْلُ الدُّنْيَا فَلا خَيَّبَنِيَ اللهُ مَا رَجَوْتُ وَمَا أَمَّلْتُ فِي زِيَارَتِكُمَا إِنَّهُ قَرِيبٌ مُّجيبٌ''',
    ),
    Dua(
      title: 'دعاء العشرات',
      benefits: 'دعاء عظيم الشأن يُستحب قراءته غدوة وعشية، وأفضل أوقاته بعد العصر من يوم الجمعة',
      text: '''بسم الله الرحمن الرحيم 

سُبْحَانَ اللهِ وَالْحَمْدُ للهِ وَلا إِلَهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ وَلا حَوْلَ وَلا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ العَظِيمِ سُبْحَانَ اللهِ آنَاءَ اللَّيْلِ وَأَطْرافَ النَّهارِ سُبْحَانَ اللهِ بِالْغُدُوِّ وَالآصَالِ سُبْحَانَ اللهِ بِالْعَشِيِّ وَالإبْكَارِ سُبْحَانَ اللهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ وَلَهُ الْحَمْدُ فِي السَّماوَاتِ وَالأَرْضِ وَعَشِيّاً وَحِينَ تُظْهِرُونَ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَيُحْيِي الأَرْضَ بَعْدَ مَوْتِها وَكَذَلِكَ تُخْرَجُونَ سُبْحانَ رَبِّكَ رَبِّ العِزَّةِ عَمّا يَصِفُونَ وَسَلامٌ عَلَى الْمُرْسَلِينَ وَالْحَمْدُ للهِ رَبِّ العالَمِينَ سُبْحانَ ذِي الْمُلْكِ وَالْمَلَكُوتِ سُبْحَانَ ذِي الْعِزَّةِ وَالْجَبَرُوتِ سُبْحانَ ذِي الْكِبْرِيَاءِ وَالْعَظَمَةِ الْمَلِكِ الْحَقِّ الْمُهَيْمِنِ القُدُّوسِ سُبْحَانَ اللهِ المَلِكِ الحَيِّ الَّذِي لا يَمُوتُ سُبْحَانَ اللهِ الْمَلِكِ الْحَيِّ الْقُدُّوسِ سُبْحانَ الْقَائِمِ الدَّائِمِ سُبْحانَ الدَّائِمِ القائِمِ سُبْحانَ رَبِّيَ الْعَظِيمِ سُبْحَانَ رَبِّيَ الأَعْلَى سُبْحَانَ الْحَيِّ الْقَيُّومِ سُبْحَانَ الْعَلِيِّ الأَعْلَى سُبْحَانَهُ وَتَعَالَى سُبُّوحٌ قُدُّوسٌ رَبُّنا وَرَبُّ الْمَلائِكَةِ وَالرُّوحِ سُبْحَانَ الدَّائِمِ غَيْرِ الْغافِلِ سُبْحَانَ الْعَالِمِ بِغَيْرِ تَعْلِيمٍ سُبْحَانَ خَالِقِ مَا يُرَى وَمَا لا يُرَى سُبْحَانَ الَّذِي يُدْرِكُ الأَبْصارَ وَلا تُدْرِكُهُ الأَبْصَارُ وَهُوَ اللَّطِيفُ الخَبِيرُ اَللَّهُمَّ إِنِّي أَصْبَحْتُ مِنْكَ فِي نِعْمَةٍ وَخَيْرٍ وَبَرَكَةٍ وَعَافِيَةٍ فَصَلِّ عَلَى مُحَمَّدٍ وَآلِهِ وَأَتْمِمْ عَلَيَّ نِعْمَتَكَ وَخَيْرَكَ وَبَرَكَاتِكَ وَعَافِيَتَكَ بِنَجاةٍ مِنَ النَّارِ وَارْزُقْنِي شُكْرَكَ وَعَافِيَتَكَ وَفَضْلَكَ وَكَرَامَتَكَ أَبَداً مَا أَبْقَيْتَنِي اَللَّهُمَّ بِنُورِكَ اهْتَدَيْتُ وَبِفَضْلِكَ اسْتَغْنَيْتُ وَبِنِعْمَتِكَ أَصْبَحْتُ وَأَمْسَيْتُ اَللَّهُمَّ إِنِّي أُشْهِدُكَ وَكَفَى بِكَ شِهِيداً وَأُشْهِدُ مَلائِكَتَكَ وَأَنْبِياءَكَ وَرُسُلَكَ وَحَمَلَةَ عَرْشِكَ وَسُكَّانَ سَمَاوَاتِكَ وَأَرْضِكَ وَجَمِيعَ خَلْقِكَ بِأَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لا شَرِيكَ لَكَ وَأَنَّ مُحَمَّداً صَلّى اللهُ عَلَيْهِ وَآلِهِ عَبْدُكَ وَرَسُولُكَ وَأَنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ تُحْيِي وَتُمِيتُ وَتُمِيتُ وَتُحْيِي وَأَشْهَدُ أَنَّ الْجَنَّةَ حَقٌ وَأَنَّ النَّارَ حَقٌ وَالنُّشُورَ حَقٌّ وَالسّاعَةَ آتِيَةٌ لارَيْبَ فِيهَا وَأَنَّ اللهَ يَبْعَثُ مَنْ فِي القُبُورِ وَأَشْهَدُ أَنَّ عَلِيَّ بْنَ أَبِي طالِبٍ أَمِيرُ الْمُؤْمِنِينَ حَقّاً حَقّاً وَأَنَّ الْأَئِمَّةَ مِنْ وُلْدِهِ هُمُ الْأَئِمَّةُ الْهُدَاةُ الْمَهْدِيُّونَ غَيْرُ الضَّالِّينَ وَلَا الْمُضِلِّينَ وَأَنَّهُمْ أَوْلِيَاؤُكَ الْمُصْطَفَونَ وَحِزْبُكَ الْغَالِبُونَ وَصَفْوَتُكَ وَخِيَرَتُكَ مِنْ خَلْقِكَ وَنُجَبَاؤُكَ الَّذِينَ انْتَجَبْتَهُمْ لِدِينِكَ وَاخْتَصَصْتَهُمْ مِنْ خَلْقِكَ وَاصْطَفَيْتَهُمْ عَلَى عِبادِكَ وَجَعَلْتَهُمْ حُجَّةً عَلَى الْعَالَمِينَ صَلَوَاتُكَ عَلَيْهِمْ وَالسَّلامُ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ اَللَّهُمَّ اكْتُبْ لِي هَذِهِ الشَّهَادَةَ عِنْدَكَ حَتَّى تُلَقِّنَنِيهَا يَوْمَ القِيامَةِ وَأَنْتَ عَنِّي رَاضٍ إِنَّكَ عَلى مَا تَشاءُ قَدِيرٌ اللَّهُمَّ لَكَ الْحَمْدُ حَمْداً يَصْعَدُ أَوَّلُهُ وَلا يَنْفَدُ آخِرُهُ اَللَّهُمَّ لَكَ الْحَمْدُ حَمْداً تَضَعُ لَكَ السَّمَاءُ كَنَفَيْها وَتُسَبِّحُ لَكَ الأَرْضُ وَمَنْ عَلَيْها اَللَّهُمَّ لَكَ الحَمْدُ حَمْداً سَرْمَداً أَبَداً لا انْقِطَاعَ لَهُ وَلا نَفَادَ وَلَكَ يَنْبَغِي وإِلَيْكَ يَنْتَهِي فِيَّ وَعَلَيَّ وَلَدَيَّ وَمَعِيَ وَقَبْلِي وَبَعْدِي وَأَمامِي وَفَوْقِي وَتَحْتِي وَإِذَا مِتُّ وَبَقِيْتُ فَرْداً وَحِيداً ثُمَّ فَنِيتُ وَلَكَ الْحَمْدُ إذَا نُشِرْتُ وَبُعِثْتُ يَا مَوْلايَ اَللَّهُمَّ وَلَكَ الحَمْدُ وَلَكَ الشُّكْرُ بِجَمِيعِ مَحَامِدِكَ كُلِّهَا عَلَى جَمِيعِ نَعْمَائِكَ كُلِّها حَتَّى يَنْتَهِيَ الْحَمْدُ إِلَى مَا تُحِبُّ رَبَّنَا وَتَرْضَى اَللَّهُمَّ لَكَ الْحَمْدُ عَلَى كُلِّ أَكْلَةٍ وَشَرْبَةٍ وَبَطْشَةٍ وَقَبْضَةٍ وبَسْطَةٍ وَفِي كُلِّ مَوْضِعِ شَعْرَةٍ اَللَّهُمَّ لَكَ الْحَمْدُ حَمْداً خالِداً مَعَ خُلُودِكَ وَلَكَ الْحَمْدُ حَمْداً لا مُنْتَهَى لَهُ دُونَ عِلْمِكَ وَلَكَ الْحَمْدُ حَمْداً لا أَمَدَ لَهُ دُونَ مَشِيئَتِكَ وَلَكَ الْحَمْدُ حَمْداً لا أَجْرَ لِقائِلِهِ إِلَّا رِضَاكَ وَلَكَ الْحَمْدُ عَلى حِلْمِكَ بَعْدَ عِلْمِكَ وَلَكَ الْحَمْدُ عَلَى عَفْوِكَ بَعْدَ قُدْرَتِكَ وَلَكَ الْحَمْدُ باعِثَ الْحَمْدِ وَلَكَ الْحَمْدُ وَارِثَ الْحَمْدِ وَلَكَ الْحَمْدُ بَدِيعَ الْحَمْدِ وَلَكَ الْحَمْدُ مُنْتَهَى الْحَمْدِ وَلَكَ الْحَمْدُ مُبْتَدِعَ الْحَمْدِ وَلَكَ الْحَمْدُ مُشْتَرِيَ الْحَمْدِ وَلَكَ الْحَمْدُ وَلِيَّ الْحَمْدِ وَلَكَ الْحَمْدُ قَدِيمَ الْحَمْدِ وَلَكَ الْحَمْدُ صَادِقَ الْوَعْدِ وَفِيَّ الْعَهْدِ عَزِيزَ الْجُنْدِ قَائِمَ الْمَجْدِ وَلَكَ الْحَمْدُ رَفِيعَ الدَّرَجَاتِ مُجِيبَ الدَّعَوَاتِ مُنْزِلَ الآيَاتِ مِنْ فَوْقِ سَبْعِ سَمَاواتٍ عَظِيمَ الْبَرَكَاتِ مُخْرِجَ النُّورِ مِنَ الظُُّّلُمَاتِ وَمُخْرِجَ مَنْ فِي الظـُّلُماتِ إِلَى النُّورِ مُبَدِّلَ السَّيِّئَاتِ حَسَنَاتٍ وَجَاعِلَ الْحَسَناتِ دَرَجَاتٍ اَللَّهُمَّ لَكَ الْحَمْدُ غَافِرَ الذَّنْبِ وَقابِلَ التَّوْبِ شَدِيدَ الْعِقابِ ذا الطَّوْلِ لا إِلَهَ إِلَّا أَنْتَ إِلَيْكَ الْمَصِيرُ اَللَّهُمَّ لَكَ الْحَمْدُ فِي اللَّيْلِ إِذا يَغْشَى وَلَكَ الْحَمْدُ فِي الآخِرَةِ وَالْأُولَى وَلَكَ الْحَمْدُ عَدَدَ كُلِّ نَجْمٍ وَمَلَكٍ فِي السَّمَاءِ وَلَكَ الْحَمْدُ عَدَدَ الثَّرَى وَالْحَصَى وَالنَّوَى وَلَكَ الْحَمْدُ عَدَدَ مَا فِي جَوِّ السَّمَاءِ وَلَكَ الْحَمْدُ عَدَدَ مَا فِي جَوْفِ الأَرْضِ وَلَكَ الْحَمْدُ عَدَدَ أَوْزَانِ مِيَاهِ الْبِحَارِ وَلَكَ الْحَمْدُ عَدَدَ أَوْرَاقِ الأَشْجَارِ وَلَكَ الْحَمْدُ عَدَدَ مَا عَلَى وَجْهِ الأَرْضِ وَلَكَ الْحَمْدُ عَدَدَ ما أَحْصَى كِتابُكَ وَلَكَ الْحَمْدُ عَدَدَ مَا أَحَاطَ بِهِ عِلْمُكَ وَلَكَ الحَمْدُ عَدَدَ الإِنْسِ وَالْجِنِّ وَالْهَوامِّ وَالطَّيْرِ وَالْبَهائِمِ والسِّباعِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ كَمَا تُحِبُّ رَبَّنا وَتَرْضَى وَكَما يَنْبَغِي لِكَرَمِ وَجْهِكَ وَعِزِّ جَلالِكَ ثمّ تقول عشراً لا إِلَهَ إِلَّا اللهُ وَحْدَهُ لا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ اللَّطِيفُ الْخَبِيرُ وتقول عشراً لا إِلَهَ إِلَّا اللهُ وَحْدَهُ لا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَيُمِيتُ وَيُحْيِي وَهُوَ حَيٌّ لا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وتقول عشراً أَسْتَغْفِرُ اللهَ الَّذِي لا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ وعشراً يَا أللهُ يَا أللهُ وعشراً يَا رَحْمَنُ يَا رَحْمنُ وعشراً يَا رَحِيمُ يا رَحِيمُ وعشراً يَا بَدِيعَ السَّمَاواتِ وَالأَرْضِ وعشراً يَا ذا الْجَلالِ وَالإِكْرَامِ وعشراً يَا حَنَّانُ يَا مَنَّانُ وعشراً يَا حَيُّ يَا قَيُّومُ وعشراً يَا حَيُّ لا إِلَهَ إِلَّا أَنْتَ وعشراً يَا اللهُ يَا لا إِلَهَ إِلَّا أَنْتَ وعشراً بسم الله الرحمن الرحيم وعشراً اَللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وعشراً اَللَّهُمَّ افْعَلْ بِي مَا أَنْتَ أَهْلُهُ وعشراً آمِينَ آمِينَ وعشراً قُلْ هُوَ اللهُ أَحَدٌ ثم تقول اَللَّهُمَّ اصْنَعْ بِي مَا أَنْتَ أَهْلُهُ وَلا تَصْنَعْ بِي مَا أَنَا أَهْلُهُ فَإِنَّكَ أَهْلُ التَّقْوى وَأَهْلُ الْمَغْفِرَةِ وَأَنَا أَهْلُ الذُّنُوبِ وَالْخَطَايَا فَارْحَمْنِي يَا مَوْلايَ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ وأيضاً تقول عشراً لاحَوْلَ وَلا قُوَّةَ إِلَّا بِاللهِ تَوَكَّلْتُ عَلى الْحَيّ الَّذِي لا يَمُوتُ وَالْحَمْدُ للهِ الَّذِي لَمْ يَتَّخِذْ وَلَداً وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِي المُلْكِ وَلَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبِيراً''',
    ),
    Dua(
      title: 'دعاء يستشير',
      benefits: 'دعاء علمه رسول الله (ص) لأمير المؤمنين (ع) لقضاء الحوائج وغفران الذنوب',
      text: '''بسم الله الرحمن الرحيم 

اَلحَمْدُ للهِ الَّذِي لا إِلَهَ إِلّا هُوَ الْمَلِكُ الْحَقُّ الْمُبِينُ الْمُدَبِّرُ بِلا وَزِيرٍ وَلا خَلْقٍ مِنْ عِبَادِهِ يَسْتَشِيرُ الأَوَّلُ غَيْرُ مَوْصُوفٍ وَالْبَاقِي بَعْدَ فَنَاءِ الْخَلْقِ الْعَظِيمُ الرُّبُوبِيَّةِ نُورُ السَّمَاوَاتِ وَالأَرَضِينَ وَفَاطِرُهُمَا وَمُبْتَدِعُهُمَا بِغَيْرِ عَمَدٍ خَلَقَهُمَا وَفَتَقَهُمَا فَتْقاً فَقَامَتِ السَّمَاوَاتِ طَائِعَاتٍ بِأَمْرِهِ وَاسْتَقَرَّتِ الأَرَضُونَ بِأَوْتَادِها فَوْقَ الْمَاءِ ثُمَّ عَلا رَبُّنَا فِي السَّمَاوَاتِ العُلى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوَى لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ وَما بَيْنَهُمَا وَمَا تَحْتَ الثَّرَى فَأَنَا أَشْهَدُ بِأَنَّكَ أَنْتَ اللهُ لا رَافِعَ لِمَا وَضَعْتَ وَلا وَاضِعَ لِمَا رَفَعْتَ وَلا مُعِزَّ لِمَنْ أَذْلَلْتَ وَلا مُذِلَّ لِمَنْ أَعْزَزْتَ وَلا مَانِعَ لِمَا أَعْطَيْتَ وَلا مُعْطِيَ لِمَا مَنَعْتَ وَأَنْتَ اللهُ لا إِلَهَ إِلَّا أَنْتَ كُنْتَ إِذْ لَمْ تَكُنْ سَمَاءٌ مَبْنِيَّةٌ وَلا أَرْضٌ مَدْحِيَّةٌ وَلا شَمْسٌ مُضِيئَةٌ وَلا لَيْلٌ مُظْلِمٌ وَلا نَهَارٌ مُضِيءٌ وَلا بَحْرٌ لُجِّيٌّ وَلا جَبَلٌ راسٍ وَلا نَجْمٌ سَارٍ وَلا قَمَرٌ مُنِيرٌ وَلا رِيحٌ تَهُبُّ وَلا سَحَابٌ يَسْكُبُ وَلا بَرْقٌ يَلْمَعُ وَلا رَعْدٌ يَسْبَحُ وَلا رُوحٌ تَنَفَّسُ وَلا طائِرٌ يَطِيرُ وَلا نارٌ تَتَوَقَّدُ وَلا ماءٌ يَطَّرِدُ كُنْتَ قَبْلَ كُلِّ شَيْءٍ وَكَوَّنْتَ كُلَّ شَيْءٍ وَقَدَرْتَ عَلَى كُلِّ شَيْءٍ وَابْتَدَعْتَ كُلِّ شَيْءٍ وَأَغْنَيْتَ وَأَفْقَرْتَ وَأَمَتَّ وَأَحْيَيْتَ وَأَضْحَكْتَ وَأَبْكَيْتَ وَعَلَى الْعَرْشِ اسْتَوَيْتَ فَتَبارَكْتَ يا أَللهُ وَتَعالَيْتَ أَنْتَ اللهُ الَّذِي لا إِلَهَ إِلَّا أَنْتَ الْخَلَّاقُ الْعَلِيمُ أَمْرُكَ غَالِبٌ وَعِلْمُكَ نَافِذٌ وَكَيْدُكَ غَرِيبٌ وَوَعْدُكَ صَادِقٌ وَقَوْلُكَ حَقٌّ وَحُكْمُكَ عَدْلٌ وَكَلَامُكَ هُدًى وَوَحْيُكَ نُورٌ وَرَحْمَتُكَ وَاسِعَةٌ وَعَفْوُكَ عَظِيمٌ وَفَضْلُكَ كَثِيرٌ وَعَطاؤُكَ جَزِيلٌ وَحَبْلُكَ مَتِينٌ وإِمْكانُكَ عَتِيدٌ وَجَارُكَ عَزِيزٌ وَبَأْسُكَ شَدِيدٌ وَمَكْرُكَ مَكِيدٌ أَنْتَ يا رَبِّ مَوْضِعُ كُلِّ شَكْوَى وحَاضِرُ كُلِّ مَلإٍ وَشاهِدُ كُلِّ نَجْوى مُنْتَهَى كُلِّ حَاجَةٍ مُفَرِّجُ كُلِّ حُزْنٍ غِنَى كُلِّ مِسْكِينٍ حِصْنُ كُلِّ هَارِبٍ أَمَانُ كُلِّ خَائِفٍ حِرْزُ الْضُّعَفَاءِ كَنْزُ الْفُقَرَاءِ مُفَرِّجُ الْغَمَّاءِ مُعِينُ الصَّالِحِينَ ذَلِكَ اللهُ رَبُّنَا لا إِلَهَ إِلَّا هُوَ تَكْفِي مِنْ عِبَادِكَ مَنْ تَوَكَّلَ عَلَيْكَ وأَنْتَ جارُ مَنْ لَاذَ بِكَ وَتَضَرَّعَ إِلَيْكَ عِصْمَةُ مَنِ اعْتَصَمَ بِكَ ناصِرُ مَنِ انْتَصَرَ بِكَ تَغْفِرُ الذُّنُوبَ لِمَنِ اسْتَغْفَرَكَ جَبَّارُ الْجَبَابِرَةِ عَظِيمُ الْعُظَمَاءِ كَبِيرُ الْكُبَرَاءِ سَيِّدُ السَّادَاتِ مَوْلَى الْمَوْالِي صَرِيخُ الْمُسْتَصْرِخِينَ مُنَفِّسٌ عَنِ الْمَكْرُوبِينَ مُجِيبُ دَعْوَةِ الْمُضْطَرِّينَ أَسْمَعُ السَّامِعِينَ أَبْصَرُ النَّاظِرِينَ أَحْكَمُ الْحَاكِمِينَ أَسْرَعُ الْحَاسِبِينَ أَرْحَمُ الرَّاحِمِينَ خَيْرُ الْغَافِرِينَ قَاضِي حَوائِجِ الْمُؤْمِنِينَ مُغِيثُ الصَّالِحِينَ أَنْتَ اللهُ لا إِلَهَ إِلَّا أَنْتَ رَبُّ الْعَالَمِينَ أَنْتَ الْخَالِقُ وَأَنا الْمَخْلُوقُ وَأَنْتَ الْمَالِكُ وَأَنَا الْمَمْلُوكُ وَأَنْتَ الرَّبُّ وَأَنَا الْعَبْدُ وَأَنْتَ الرَّازِقُ وَأَنَا الْمَرْزُوقُ وَأَنْتَ الْمُعْطِي وَأَنَا السَّائِلُ وَأَنْتَ الْجَوادُ وَأَنَا الْبَخِيلُ وَأَنْتَ الْقَوِيُّ وَأَنَا الضَّعِيفُ وَأَنْتَ الْعَزِيزُ وَأَنَا الذَّلِيلُ وَأَنْتَ الْغَنِيُّ وَأَنَا الْفَقِيرُ وَأَنْتَ السَّيِّدُ وَأَنا الْعَبْدُ وَأَنْتَ الْغَافِرُ وَأَنَا الْمُسِيءُ وأَنْتَ الْعَالِمُ وَأَنَا الْجَاهِلُ وَأَنْتَ الْحَلِيمُ وَأَنَا الْعَجُولُ وَأَنْتَ الرَّحْمَنُ وَأَنَا الْمَرْحُومُ وَأَنْتَ الْمُعافِي وَأَنَا الْمُبْتَلَى وَأَنْتَ الْمُجِيبُ وَأَنَا الْمُضْطَرُّ وَأَنَا أَشْهَدُ بِأَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلَّا أَنْتَ الْمُعْطِي عِبَادَكَ بِلا سُؤَالٍ وَأَشْهَدُ بِأَنَّكَ أَنْتَ اللهُ الْوَاحِدُ الأَحَدُ الْمُتَفَرِّدُ الصَّمّدُ الفَرْدُ وَإِلَيْكَ الْمَصِيرُ وَصَلّى اللهُ عَلَى مُحَمَّدٍ وَأَهْلِ بَيْتِهِ الطَّيِّبِينَ الطَّاهِرِينَ وَاغْفِرْ لِي ذُنُوبِي وَاسْتُرْ عَلَيَّ عُيُوبِي وَافْتَحْ لِي مِنْ لَدُنْكَ رَحْمَةً وَرِزْقاً وَاسِعاً يا أَرْحَمَ الرَّاحِمِينَ وَالْحَمْدُ للهِ رَبِّ الْعالَمِينَ وَحَسْبُنا اللهُ وَنِعْمَ الْوَكِيلُ وَلا حَوْلَ وَلا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ''',
    ),
    Dua(
      title: 'دعاء الجوشن الكبير',
      benefits: 'دعاء عظيم مروي عن النبي (ص)، فيه مائة فصل، يُقرأ لدفع البلاء في ليالي القدر وغيرها',
      text: '''بسم الله الرحمن الرحيم 

(1) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا اللهُ، يا رَحمنُ، يا رَحيمُ، يا كَريمُ، يا مُقيمُ، يا عَظيمُ، يا قَديمُ، يا عَليمُ، يا حَليمُ، يا حَكيمُ، سُبحانَكَ، يا لا إلهَ إلاّ أنتَ، الغَوثَ الغَوثَ الغَوثَ، خَلِّصنا مِنَ النّارِ، يا رَبِّ.

(2) يا سَيِّدَ السّاداتِ، يا مُجيبَ الدَّعَواتِ، يا رافعَ الدَّرَجاتِ، يا وَليَّ الحَسَناتِ، يا غافِرَ الخَطيئاتِ، يا مُعطيَ المَسألاتِ، يا قابِلَ التَّوباتِ، يا سامعَ الأصواتِ، يا عالِمَ الخَفياتِ، يا دافعَ البَلياتِ.

(3) يا خَيرَ الغافِرينَ، يا خَيرَ الفاتِحينَ، يا خَيرَ النّاصِرينَ، يا خَيرَ الحاكِمينَ، يا خَيرَ الرّازِقينَ، يا خَيرَ الوارِثينَ، يا خَيرَ الحامِدينَ، يا خَيرَ الذَّاكِرينَ، يا خَيرَ المُنزِلينَ، يا خَيرَ المُحسِنينَ.

(4) يا مَن لَهُ العِزَّةُ وَالجَمالُ، يا مَن لَهُ القُدرَةُ وَالكَمالُ، يا مَن لَهُ المُلكُ وَالجَلالُ، يا مَن هُوَ الكَبيرُ المُتَعالِ، يا مُنشئَ السَّحابِ الثِّقالِ، يا مَن هُوَ شَديدُ المِحالِ، يا مَن هُوَ سَريعُ الحِسابِ، يا مَن هُوَ شَديدُ العِقابِ، يا مَن عِندَهُ حُسنُ الثَّوابِ، يا مَن عِندَهُ اُمُّ الكِتابِ.

(5) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا حَنَّانُ، يا مَنَّانُ، يا دَيانُ، يا بُرهانُ، يا سُلطانُ، يا رِضوانُ، يا غُفرانُ، يا سُبحانُ، يا مُستَعانُ، يا ذا المَنِّ وَالبَيا نِ.

(6) يا مَن تَواضَعَ كُلُّ شيءٍ لِعَظَمَتِهِ، يا مَن استسلّم كُلُّ شيءٍ لِقُدرَتِهِ، يا مَن ذَلَّ كُلُّ شيءٍ لِعِزَّتِهِ، يا مَن خَضَعَ كُلُّ شيءٍ لِهَيبَتِهِ، يا مَن انقادَ كُلُّ شيءٍ مِن خَشيَتِهِ، يا مَن تَشَقَّقَتِ الجِبالُ مِن مَخافَتِهِ، يا مَن قامَتِ السَّماواتُ بِأمرِهِ، يا مَن استَقَرَّتِ الأرَضونَ بِإذنِهِ، يا مَن يُسَبِّحُ الرَّعدُ بِحَمدِهِ، يا مَن لا يَعتَدي عَلى أهلِ مَملَكَتِهِ.

(7) يا غافِرَ الخطايا، يا كاشِفَ البَلايا، يا مُنتَهى الرَّجايا، يا مُجزِلَ العَطايا، يا واهِبَ الهَدايا، يا رازِقَ البَرايا، يا قاضيَ المَنايا، يا سامِعَ الشَّكايا، يا باعِثَ البَرايا، يا مُطلِقَ الاُسارى.

(8) يا ذا الحَمدِ وَالثَّناءِ، يا ذا الفَخرِ وَالبَهاءِ، يا ذا المَجدِ وَالسَّناءِ، يا ذا العَهدِ وَالوَفاءِ، يا ذا العَفوِ وَالرِّضاءِ، يا ذا المَنِّ وَالعَطاءِ، يا ذا الفَصلِ وَالقَضاءِ، يا ذا العِزِّ وَالبَقاءِ، يا ذا الجودِ وَالسَّخاءِ، يا ذا الآلاء وَالنَّعماءِ.

(9) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا مانِعُ، يا دافِعُ، يا رافِعُ، يا صانِعُ، يا نافِعُ، يا سامِعُ، يا جامِعُ، يا شافِعُ، يا واسِعُ، يا موسِعُ.

(10) يا صانِعَ كُلِّ مَصنوعٍ، يا خالِقَ كُلِّ مَخلوقٍ، يا رازِقَ كُلِّ مَرزوقٍ، يا مالِكَ كُلِّ مَملوكٍ، يا كاشِفَ كُلِّ مَكروبٍ، يا فارِجَ كُلِّ مَهمومٍ، يا راحِمَ كُلِّ مَرحومٍ، يا ناصِرَ كُلِّ مَخذولٍ، يا ساتِرَ كُلِّ مَعيوبٍ، يا مَلجَأَ كُلِّ مَطرودٍ.

(11) يا عُدَّتي عِندَ شِدَّتي، يا رَجائي عِندَ مُصيبَتي، يا مؤنِسي عِندَ وَحشَتي، يا صاحِبي عِندَ غُربَتي، يا وَليّي عِندَ نِعمَتي، يا غياثي عِندَ كُربَتي، يا دَليلي عِندَ حَيرَتي، يا غَنائي عِندَ افتِقاري، يا مَلجَأي عِندَ اضطِراري، يا مُعيني عِندَ مَفزَعي.

(12) يا عَلّا مَ الغُيوبِ، يا غَفَّارَ الذُّنوبِ، يا سَتَّارَ العُيوبِ، يا كاشِفَ الكُروبِ، يا مُقَلِّبَ القُلوبِ، يا طَبيبَ القُلوبِ، يا مُنَوِّرَ القُلوبِ، يا أنيسَ القُلوبِ، يا مُفَرِّجَ الهُمومِ، يا مُنَفِّسَ الغُمومِ.

(13) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا جَليلُ، يا جَميلُ، يا وَكيلُ، يا كَفيلُ، يا دَليلُ، يا قَبيلُ ، يا مُديلُ، يا مُنيلُ، يا مُقيلُ، يا مُحيلُ.

(14) يا دَليلَ المُتَحَيِّرينَ، يا غيا ثَ المُستَغيثينَ، يا صَريخَ المُستَصرِخينَ، يا جارَ المُستَجيرينَ، يا أمانَ الخائِفينَ، يا عَونَ المُؤمِنينَ، يا راحِمَ المَساكينَ، يا مَلجأ العاصينَ، يا غافِرَ المُذنِبينَ، يا مُجيبَ دَعوَةِ المُضطَرّينَ.

(15) يا ذا الجودِ وَالإحسانِ، يا ذا الفَضلِ وَالامتِنانِ، يا ذا الأمنِ وَالأمانِ، يا ذا القُدسِ وَالسُّبحانِ، يا ذا الحِكمَةِ وَالبَيا نِ، يا ذا الرَّحمَةِ وَالرِّضوانِ، يا ذا الحُجَّةِ وَالبُرهانِ، يا ذا العَظَمَةِ وَالسُّلطانِ، يا ذا الرَأفَةِ وَالمُستَعانِ، يا ذا العَفوِ وَالغُفرانِ.

(16) يا مَن هُوَ رَبُّ كُلِّ شيءٍ، يا مَن هُوَ إلهُ كُلِّ شيءٍ، يا مَن هُوَ خالِقُ كُلِّ شيءٍ، يا مَن هُوَ صانِعُ كُلِّ شيءٍ، يا مَن هُوَ قَبلَ كُلِّ شيءٍ، يا مَن هُوَ بَعدَ كُلِّ شيءٍ، يا مَن هُوَ فَوقَ كُلِّ شيءٍ، يا مَن هُوَ عالِمٌ بكُلِّ شيءٍ، يا مَن هُوَ قادِرٌ عَلى كُلِّ شيءٍ، يا مَن هُوَ يَبقى وَيَفنى كُلُّ شيءٍ.

(17) اللهُمَّ إنّي أسألُكَ، يا مُؤمِنُ، يا مُهَيمِنُ، يا مُكَوِّنُ، يا مُلَقِّنُ، يا مُبيّنُ، يا مُهَوِّنُ، يا مُمَكِّنُ، يا مُزَيِّنُ، يا مُعلِنُ، يا مُقَسِّمُ.

(18) يا مَن هُوَ في مُلكِهِ مُقيمٌ، يا مَن هُوَ في سُلطانِهِ قَديمٌ، يا مَن هُوَ في جَلالِهِ عَظيمٌ، يا مَن هُوَ عَلى عِبادِهِ رَحيمٌ، يا مَن هُوَ بكُلِّ شيءٍ عَليمٌ، يا مَن هُوَ بِمَن عَصاهُ حَليمٌ، يا مَن هُوَ بِمَن رَجاهُ كَريمٌ، يا مَن هُوَ في صُنعِهِ حَكيمٌ، يا مَن هُوَ في حِكمَتِهِ لَطيفٌ، يا مَن هُوَ في لُطفِهِ قَديمٌ.

(19) يا مَن لايُرجى إلاّ فَضلُهُ، يا مَن لايُسألُ إلاّ عَفوُهُ، يا مَن لايُنظَرُ إلاّ بِرُّهُ، يا مَن لا يُخافُ إلاّ عَدلُهُ، يا مَن لا يَدومُ إلاّ مُلكُهُ، يا مَن لاسُلطانَ إلاّ سُلطانُهُ، يا مَن وَسِعَت كُلَّ شيءٍ رَحمَتُهُ، يا مَن سَبَقَت رَحمَتُهُ غَضَبَهُ، يا مَن أحاطَ بِكُلِّ شيءٍ عِلمُهُ، يا مَن لَيسَ أحَدٌ مِثلَهُ.

(20) يا فارِجَ الهَمِّ، يا كاشِفَ الغَمِّ، يا غافِرَ الذَّنبِ، يا قابِلَ التَّوبِ، يا خالِقَ الخَلقِ، يا صادِقَ الوَعدِ، يا موفي العَهدِ، يا عالِمَ السِّرِّ، يا فالِقَ الحَبِّ، يا رازِقَ الأنامِ.

(21) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا عَليُّ، يا وَفيُّ، يا غَنيُّ، يا مَليُّ، يا حَفيُّ، يا رَضيُّ، يا زَكيُّ ، يا بَديُّ، يا قَويُّ، يا وَليُّ.

(22) يا مَن أظهَرَ الجَميلَ، يا مَن سَتَرَ القَبيحَ، يا مَن لَم يُؤاخِذ بِالجَريرَةِ، يا مَن لَم يَهتِكِ السِّترَ، يا عَظيمَ العَفوِ، يا حَسَنَ التَّجاوُزِ، يا واسِعَ المَغفِرَةِ، يا باسِطَ اليَّدَينِ بِالرَّحمَةِ، يا صاحِبَ كُلِّ نَجوى، يا مُنتَهى كُلِّ شَكوى.

(23) يا ذا النِّعمَةِ السَّابِغَةِ، يا ذا الرَّحمَةِ الواسِعَةِ، يا ذا المِنَّةِ السَّابِقَةِ، يا ذا الحِكمَةِ البالِغَةِ، يا ذا القُدرَةِ الكامِلَةِ، يا ذا الحُجَّةِ القاطِعَةِ، يا ذا الكَرامَةِ الظاهِرَةِ، يا ذا العِزَّةِ الدَّائِمَةِ، يا ذا القوَّةِ المَتينَةِ، يا ذا العَظَمَةِ المَنيعَةِ.

(24) يا بَديعَ السَّماواتِ، يا جاعِلَ الظُّلُماتِ، يا راحِم العَبَراتِ، يا مُقيلَ العَثَراتِ، يا ساتِرَ العَوراتِ، يا مُحييَ الأمواتِ، يا مُنزِلَ الآيات، يا مُضَعِّفَ الحَسَناتِ، يا ماحي السَّيِّئاتِ، يا شَديدَ النَّقَماتِ.

(25) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا مُصَوِّرُ، يا مُقَدِّرُ، يا مُدَبِّرُ، يا مُطَهِّرُ، يا مُنَوِّرُ، يا مُيَسِّرُ، يا مُبَشِّرُ، يا مُنذِرُ، يا مُقَدِّمُ، يا مُؤَخِّرُ.

(26) يا رَبَّ البَيتِ الحَرامِ، يا رَبَّ الشَّهرِ الحَرامِ، يا رَبَّ البَلَدِ الحَرامِ، يا رَبَّ الرُّكنِ وَالمَقامِ، يا رَبَّ المَشعَرِ الحَرامِ، يا رَبَّ المَسجِدِ الحَرامِ، يا رَبَّ الحِلِّ وَالحَرامِ، يا رَبَّ النّورِ وَالظَّلامِ، يا رَبَّ التَّحيَّةِ وَالسَّلامِ، يا رَبَّ القُدرَةِ في الأنامِ.

(27) يا أحكَمَ الحاكِمينَ، يا أعدَلَ العادِلينَ، يا أصدَقَ الصَّادِقينَ، يا أطهَرَ الطَّاهِرِينَ، يا أحسَنَ الخالِقينَ، يا أسرَعَ الحاسِبينَ، يا أسمَعَ السَّامِعينَ، يا أبصَرَ النَّاظِرينَ، يا أشفَعَ الشَّافِعينَ، يا أكرَمَ الأكرَمينَ.

(28) يا عِمادَ مَن لا عِمادَ لَهُ، يا سَنَدَ مَن لا سَنَدَ لَهُ، يا ذُخرَ مَن لا ذُخرَ لَهُ، يا حِرزَ مَن لا حِرزَ لَهُ، يا غيا ثَ مَن لا غيا ثَ لَهُ، يا فَخرَ مَن لا فَخرَ لَهُ، يا عِزَّ مَن لا عِزَّ لَهُ، يا مُعينَ مَن لا مُعينَ لَهُ ، يا أنيسَ مَن لا أنيسَ لَهُ، يا أمانَ مَن لا أمانَ لَهُ.

(29) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا عاصِمُ، يا قائِمُ، يا دائِمُ، يا راحِمُ، يا سالِمُ، يا حاكِمُ، يا عالِمُ، يا قاسِمُ، يا قابِضُ، يا باسِطُ.

(30) يا عاصِمَ مَنِ استَعصَمَهُ ، يا راحِمَ مَن استَرحَمَهُ، يا غافِرَ مَنِ استَغفَرَهُ، يا ناصِرَ مَنِ استَنصَرَهُ، يا حافِظَ مَنِ استَحفَظَهُ، يا مُكرِمَ مَنِ استَكرَمَهُ، يا مُرشِدَ مَنِ استَرشَدَهُ، يا صِريخَ مَنِ استَصرَخَهُ، يا مُعينَ مَنِ استَعانَهُ، يا مُغيثَ مَنِ استَغاثَهُ.

(31) يا عَزيزاً لا يُضامُ، يا لَطيفاً لا يُرامُ، يا قَيّوماً لا يَنامُ، يا دائِماً لا يَفوتُ، يا حَيا لا يَموتُ ، يا مَلِكاً لا يَزولُ، يا باقياً لا يَفنى، يا عالِماً لا يَجهَلُ، يا صَمَداً لا يُطعَمُ، يا قَويا لا يَضعُفُ.

(32) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا أحَدُ، يا واحِدُ، يا شاهِدُ، يا ماجِدُ، يا حامِدُ، يا راشِدُ، يا باعِثُ، يا وارِثُ، يا ضارُّ، يا نافِعُ.

(33) يا أعظَمَ مِن كُلِّ عَظيمٍ، يا أكرَمَ مِن كُلِّ كَريمٍ، يا أرحَمَ مِن كُلِّ رَحيمٍ، يا أعلَمَ مِن كُلِّ عَليمٍ، يا أحكَمَ مِن كُلِّ حَكيمٍ، يا أقدَمَ مِن كُلِّ قَديمٍ، يا أكبَرَ مِن كُلِّ كَبيرٍ، يا ألطَفَ مِن كُلِّ لَطيفٍ، يا أجَلَّ مِن كُلِّ جَليلٍ، يا أعَزَّ مِن كُلِّ عَزيزٍ.

(34) يا كَريمَ الصَّفحِ، يا عَظيمَ المَنِّ، يا كَثيرَ الخَيرِ، يا قَديمَ الفَضلِ، يا دائِمَ اللُّطفِ، يا لَطيفَ الصُّنعِ، يا مُنَفِّسَ الكَربِ، يا كاشِفَ الضُّرِّ، يا مالِكَ المُلكِ، يا قاضيَ الحَقِّ.

(35) يا مَن هُوَ في عَهدِهِ وَفيُّ، يا مَن هُوَ في وَفائِهِ قَويُّ، يا مَن هُوَ في قوَّتِهِ عَليُّ، يا مَن هُوَ في عُلوِّهِ قَريبٌ، يا مَن هُوَ في قُربِهِ لَطيفٌ، يا مَن هُوَ في لُطفِهِ شَريفٌ، يا مَن هُوَ في شَرَفِهِ عَزيزٌ ، يا مَن هُوَ في عِزِّهِ عَظيمٌ، يا مَن هُوَ في عَظَمَتِهِ مَجيدٌ، يا مَن هُوَ في مَجدِهِ حَميدٌ.

(36) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا كافي، يا شافي، يا وافي، يا مُعافي، يا هادي، يا داعي، يا قاضي، يا راضي، يا عالي، يا باقي.

(37) يا مَن كُلُّ شيءٍ خاضِعٌ لَهُ، يا مَن كُلُّ شيءٍ خاشِعٌ لَهُ، يا مَن كُلُّ شيءٍ كائِنٌ لَهُ، يا مَن كُلُّ شيءٍ مَوجودٌ بِهِ، يا مَن كُلُّ شيءٍ مُنيبٌ إلَيهِ، يا مَن كُلُّ شيءٍ خائِفٌ مِنهُ، يا مَن كُلُّ شيءٍ قائِمٌ بِهِ ، يا مَن كُلُّ شيءٍ صائِرٌ إلَيهِ، يا مَن كُلُّ شيءٍ يُسَبِّح بِحَمدِهِ يا مَن كُلُّ شيءٍ هالِكٌ إلاّ وَجهَهُ.

(38) يا مَن لامَفَرَّ إلاّ إلَيهِ، يا مَن لا مَقصَدَ إلاّ إلَيهِ، يا مَن لا مَنجى مِنهُ إلاّ إلَيهِ، يا مَن لايُرغَبُ إلاّ إلَيهِ، يا مَن لاحَولَ وَلا قوَّةَ إلاّ بِهِ، يا مَن لا يُستَعانُ إلاّ بِهِ، يا مَن لايُتَوَكَّلُ إلاّ عَلَيهِ، يا مَن لايُرجى إلاّ هوَ، يا مَن لا يُعبَدُ إلاّ هوَ.

(39) يا خَيرَ المَرهوبينَ، يا خَيرَ المَرغوبينَ، يا خَيرَ المَطلوبينَ، يا خَيرَ المَسؤولينَ، يا خَيرَ المَقصودينَ، يا خَيرَ المَذكورينَ، يا خَيرَ المَشكورينَ، يا خَيرَ المَحبوبينَ، يا خَيرَ المَدعوّينَ، يا خَيرَ المُستَأنِسينَ.

(40) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا غافِرُ، يا ساتِرُ، يا قادِرُ، يا قاهِرُ، يا فاطِرُ، يا كاسِرُ، يا جابِرُ، يا ذاكِرُ، يا ناظِرُ، يا ناصِرُ.

(41) يا مَن خَلَقَ فَسَوَّى، يا مَن قَدَّرَ فَهَدى، يا مَن يَكشِفُ البَلوى، يا مَن يَسمَعُ النَّجوى، يا مَن يُنقِذُ الغَرقى، يا مَن يُنجي الهَلكى، يا مَن يَشفي المَرضى، يا مَن أضحَكَ وَأبكى، يا مَن أماتَ وَأحيى، يا مَن خَلَقَ الزَّوجَينِ الذَّكَرَ وَالاُنثى.

(42) يا مَن في البَرِّ وَالبَحرِ سَبيلُهُ، يا مَن في الآفاقِ آياتُهُ، يا مَن في الآيات بُرهانُهُ، يا مَن في المَماتِ قُدرَتُهُ، يا مَن في القُبورِ عِبرَتُهُ، يا مَن في القيامة مُلكُهُ، يا مَن في الحِسابِ هَيبَتُهُ، يا مَن في الميزانِ قَضاؤُهُ، يا مَن في الجَنَّةِ ثَوابُهُ، يا مَن في النّارِ عِقابُهُ.

(43) يا مَن إلَيهِ يَهرَبُ الخائِفونَ، يا مَن إلَيهِ يَفزَعُ المُذنِبونَ، يا مَن إلَيهِ يَقصِدُ المُنيبونَ، يا مَن إلَيهِ يَرغَبُ الزَّاهِدونَ، يا مَن إلَيهِ يَلجَأُ المُتَحَيِّرونَ، يا مَن بِهِ يَستَأنِسُ المُريدونَ، يا مَن بِهِ يَفتَخِرُ المُحِبّونَ، يا مَن في عَفوِهِ يَطمَعُ الخاطِئونَ، يا مَن إلَيهِ يَسكُنُ الموقِنونَ، يا مَن عَلَيهِ يَتَوَكَّلُ المُتَوَكِّلونَ.

(44) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا حَبيبُ، يا طَبيبُ، يا قَريبُ، يا رَقيبُ، يا حَسيبُ، يا مَهِيبُ، يا مُثيبُ، يا مُجيبُ، يا خَبيرُ، يا بَصيرُ.

(45) يا أقرَبَ مِن كُلِّ قَريبٍ، يا أحَبَّ مِن كُلِّ حَبيبٍ، يا أبصَرَ مِن كُلِّ بَصيرٍ، يا أخبَرَ مِن كُلِّ خَبيرٍ، يا أشرَفَ مِن كُلِّ شَريفٍ، يا أرفَعَ مِن كُلِّ رَفيعٍ، يا أقوى مِن كُلِّ قَويٍّ، يا أغنى مِن كُلِّ غَنيٍّ، يا أجوَدَ مِن كُلِّ جَوادٍ، يا أرأفَ مِن كُلِّ رَؤوفٍ.

(46) يا غالِباً غَيرَ مَغلوبٍ، يا صانِعاً غَيرَ مَصنوعٍ، يا خالِقاً غَيرَ مَخلوقٍ، يا مالِكاً غَيرَ مَملوكٍ، يا قاهِراً غَيرَ مَقهورٍ، يا رافِعاً غَيرَ مَرفوعٍ، يا حافِظاً غَيرَ مَحفوظٍ، يا ناصِراً غَيرَ مَنصورٍ، يا شاهِداً غَيرَ غائِبٍ، يا قَريباً غَيرَ بَعيدٍ.

(47) يا نورَ النّورِ، يا مُنَوِّرَ النّورِ، يا خالِقَ النّورِ، يا مُدَبِّرَ النّورِ، يا مُقَدِّرَ النّورِ، يا نورَ كُلِّ نورٍ، يا نوراً قَبلَ كُلِّ نورٍ، يا نوراً بَعدَ كُلِّ نورٍ، يا نوراً فَوقَ كُلِّ نورٍ، يا نوراً لَيسَ كَمَثلِهِ نورٌ.

(48) يا مَن عَطاؤُهُ شَريفٌ ، يا مَن فِعلُهُ لَطيفٌ، يا مَن لُطفُهُ مُقيمٌ، يا مَن إحسانُهُ قَديمٌ، يا مَن قَولُهُ حَقُّ، يا مَن وَعدُهُ صِدقٌ، يا مَن عَفوُهُ فَضلٌ، يا مَن عَذابُهُ عَدلٌ، يا مَن ذِكرُهُ حُلوٌ، يا مَن فَضلُهُ عَميمٌ.

(49) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا مُسَهِّلُ، يا مُفَصِّلُ، يا مُبَدِّلُ، يا مُذَلِّلُ، يا مُنَزِّلُ، يا مُنَوِّلُ، يا مُفضِلُ، يا مُجزِلُ، يا مُمهِلُ، يا مُجمِلُ.

(50) يا مَن يَرى وَلا يُرى، يا مَن يَخلُقُ وَلايُخلَقُ، يا مَن يَهدي وَلايُهدى، يا مَن يُحيي وَلا يُحيى، يا مَن يَسألُ وَلايُسألُ، يا مَن يُطعِمُ وَلايُطعَمُ، يا مَن يُجيرُ وَلا يُجارُ عَلَيهِ، يا مَن يَقضي وَلا يُقضى عَلَيهِ، يا مَن يَحكُمُ وَلا يُحكَمُ عَلَيهِ، يا مَن لَم يَلِد وَلَم يولَد وَلَم يَكُن لَهُ كُفُواً أحَدٌ.

(51) يا نِعمَ الحَسيبُ، يا نِعمَ الطَّبيبُ، يا نِعمَ الرَّقيبُ، يا نِعمَ القَريبُ، يا نِعمَ المُجيبُ، يا نِعمَ الحَبيبُ، يا نِعمَ الكَفيلُ، يا نِعمَ الوَكيلُ، يا نِعمَ المَولى، يا نِعمَ النَّصيرُ.

(52) يا سُرورَ العارِفينَ، يا مُنى المُحِبّينَ، يا أنيسَ المُريدينَ، يا حَبيبَ التَّوَّابينَ، يا رازِقَ المُقِلّينَ، يا رَجاءَ المُذنِبينَ، يا قُرَّةَ عَينِ العابِدينَ، يا مُنَفِّسَ عَنِ المَكروبينَ، يا مُفَرِّجَ عَنِ المَغمومينَ، يا إلهَ الأوَّلينَ وَالآخِرينَ.

(53) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا رَبَّنا، يا إلهَنا، يا سَيِّدِنا، يا مَولانا، يا ناصِرَنا، يا حافِظَنا، يا دَليلَنا، يا مُعينَنا، يا حَبيبَنا، يا طَبيبَن.

(54) يا رَبَّ النَّبيّينَ وَالأبرارِ، يا رَبَّ الصِّدّيقينَ وَالأخيارِ، يا رَبَّ الجَنَّةِ وَالنّارِ، يا رَبَّ الصِّغارِ وَالكِبارِ، يا رَبَّ الحُبُوبِ وَالثِّمارِ، يا رَبَّ الأنهارِ وَالأشجارِ، يا رَبَّ الصَّحاري وَالقِفارِ، يا رَبَّ البَراري وَالبِحارِ، يا رَبَّ اللَّيلِ وَالنَّهارِ، يا رَبَّ الإعلانِ وَالاَسرارِ.

(55) يا مَن نَفَذَ في كُلِّ شيءٍ أمرُهُ، يا مَن لَحِقَ بِكُلِّ شيءٍ عِلمُهُ، يا مَن بَلَغَت إلى كُلِّ شيءٍ قُدرَتُهُ، يا مَن لا تُحصي العِبادُ نِعَمَهُ، يا مَن لاتَبلُغُ الخَلائِقُ شُكرَهُ، يا مَن لاتُدرِكُ الأفهامُ جَلالَهُ، يا مَن لاتَنالُ الأوهامُ كُنهَهُ، يا مَن العَظَمَةُ وَالكِبرياءُ رِداؤُهُ، يا مَن لا تَرُدُّ العِبادُ قَضاءَهُ، يا مَن لا مُلكَ إلاّ مُلكُهُ، يا مَن لا عَطاءَ إلاّ عَطاؤُهُ.

(56) يا مَن لَهُ المَثَلُ الأعلى، يا مَن لَهُ الصِّفاتُ العُليا، يا مَن لَهُ الآخرةُ وَالاُولى، يا مَن لَهُ الجَنَّةُ المَأوى، يا مَن لَهُ الآيات الكُبرى، يا مَن لَهُ الأسماءُ الحُسنى، يا مَن لَهُ الحُكمُ وَالقَضاءُ، يا مَن لَهُ الهَواءُ وَالفَضاءُ، يا مَن لَهُ العَرشُ وَالثَّرى، يا مَن لَهُ السَّماواتُ العُلى.

(57) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا عَفوُّ، يا غَفورُ، يا صَبورُ، يا شَكورُ، يا رَؤوفُ، يا عَطوفُ، يا مَسؤولُ، يا وَدودُ، يا سُبّوحُ، يا قُدّوسُ.

(58) يا مَن في السَّماءِ عَظَمَتُهُ، يا مَن في الأرضِ آياتُهُ، يا مَن في كُلِّ شيءٍ دَلائِلُهُ، يا مَن في البِحارِ عَجائِبُهُ، يا مَن في الجِبالِ خَزائِنُهُ، يا مَن يُبدِئُ الخَلقَ ثمّ يُعيدُهُ، يا مَن إلَيهِ يَرجِعُ الأمرُ كُلُّهُ، يا مَن أظهَرَ في كُلِّ شيءٍ لُطفَهُ، يا مَن أحسَنَ كُلَّ شيءٍ خَلقَهُ، يا مَن تَصَرَّفَ في الخَلائِقِ قُدرَتُهُ.

(59) يا حَبيبَ مَن لاحَبيبَ لَهُ، يا طَبيبَ مَن لا طَبيبَ لَهُ، يا مُجيبَ مَن لا مُجيبَ لَهُ، يا شَفيقَ مَن لا شَفيقَ لَهُ، يا رَفيقَ مَن لا رَفيقَ لَهُ، يا مُغيثَ مَن لا مُغيثَ لَهُ، يا دَليلَ مَن لا دَليلَ لَهُ، يا أنيسَ مَن لا أنيسَ لَهُ، يا راحِمَ مَن لا راحِمَ لَهُ، يا صاحِبَ مَن لا صاحِبَ لَهُ.

(60) يا كافيَ مَن استَكفاهُ، يا هاديَ مَن استَهداهُ، يا كالئ مَن استَكلّاهُ، يا راعيَ مَنِ استَرعاهُ، يا شافيَ مَن استَشفاهُ، يا قاضيَ مَنِ استَقضاهُ، يا مُغنيَ مَنِ استَغناهُ، يا موفيَ مَنِ استَوفاهُ، يا مُقَوّيَ مَنِ استَقواهُ، يا وَليَّ مَنِ استَولاهُ.

(61) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا خالِقُ، يا رازِقُ، يا ناطِقُ، يا صادِقُ، يا فالِقُ، يا فارِقُ، يا فاتِقُ، يا راتِقُ، يا سابِقُ، يا سامِقُ.

(62) يا مَن يُقَلِّبُ اللَّيلَ وَالنَّهارَ، يا مَن جَعَلَ الظُّلُماتِ وَالأنوارَ، يا مَن خَلَقَ الظِّلَّ وَالحَرورَ، يا مَن سَخَّرَ الشَّمسَ وَالقَمَرَ، يا مَن قَدَّرَ الخَيرَ وَالشَّرَّ، يا مَن خَلَقَ المَوتَ وَالحياةَ، يا مَن لَهُ الخَلقُ وَالأمرُ، يا مَن لَم يَتَّخِذ صاحِبَةً وَلا وَلَداً، يا مَن لَيسَ لَهُ شَريكٌ في المُلكِ، يا مَن لَم يَكُن لَهُ وَليُّ مِنَ الذُّلِّ.

(63) يا مَن يَعلَمُ مُرادَ المُريدينَ، يا مَن يَعلَمُ ضَميرَ الصَّامِتينَ، يا مَن يَسمَعُ أنينَ الواهِنينَ، يا مَن يَرى بُكاءَ الخائِفينَ، يا مَن يَملِكُ حَوائِجَ السَّائِلينَ، يا مَن يَقبَلُ عُذرَ التَّائِبينَ، يا مَن لا يُصلِحُ عَمَلَ المُفسِدينَ، يا مَن لا يُضيعُ أجرَ المُحسِنينَ، يا مَن لا يَبعُدُ عَن قُلوبِ العارِفينَ، يا أجوَدَ الأجوَدينَ.

(64) يا دائِمَ البَقاءِ، يا سامِعَ الدُّعاءِ، يا واسِعَ العَطاءِ، يا غافِرَ الخَطاءِ، يا بَديعَ السَّماءِ، يا حَسَنَ البَلاءِ، يا جَميلَ الثَّناءِ، يا قَديمَ السَّناءِ، يا كَثيرَ الوَفاءِ، يا شَريفَ الجَزاءِ.

(65) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا سَتَّارُ، يا غَفَّارُ، يا قَهَّارُ، يا جَبَّارُ، يا صَبَّارُ، يا بارُّ، يا مُختارُ، يا فَتَّاحُ، يا نَفَّاحُ، يا مُرتاحُ.

(66) يا مَن خَلَقَني وَسَوَّاني، يا مَن رَزَقَني وَرَبَّاني، يا مَن أطعَمَني وَسَقاني، يا مَن قَرَّبَني وَأدناني، يا مَن عَصَمَني وَكَفاني، يا مَن حَفِظَني وَكَلاني ، يا مَن أعَزَّني وَأغناني، يا مَن وَفَّقَني وَهَداني، يا مَن آنَسَني وَآواني، يا مَن أماتَني وَأحياني.

(67) يا مَن يُحِقُّ الحَقَّ بِكَلِماتِهِ، يا مَن يَقبَلُ التَّوبَةَ عَن عِبادِهِ، يا مَن يَحولُ بَينَ المَرءِ وَقَلبِهِ، يا مَن لاتَنفَعُ الشَّفاعَةُ إلاّ بِإذنِهِ، يا مَن هُوَ أعلَمُ بِمَن ضَلَّ عَن سَبيلِهِ، يا مَن لامُعَقِّبَ لِحُكمِهِ، يا مَن لا رادَّ لِقَضائِهِ، يا مَن انقادَ كُلُّ شيءٍ لأمرِهِ، يا مَن السَّماواتُ مَطويا تٌ بيَمينِهِ، يا مَن يُرسِلُ الرياحَ بُشراً بَينَ يَدَي رَحمَتِهِ.

(68) يا مَن جَعَلَ الأرضَ مِهاداً، يا مَن جَعَلَ الجِبالَ أوتاداً، يا مَن جَعَلَ الشَّمسَ سِراجاً، يا مَن جَعَلَ القَمَرَ نوراً، يا مَن جَعَلَ اللَّيلَ لِباساً، يا مَن جَعَلَ النَّهارَ مَعاشاً، يا مَن جَعَلَ النَّومَ سُباتاً، يا مَن جَعَلَ السَّماء بِناءً، يا مَن جَعَلَ الأشياءَ أزواجاً، يا مَن جَعَلَ النّارَ مِرصاد.

(69) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا سَميعُ، يا شَفيعُ، يا رَفيعُ، يا مَنيعُ، يا سَريعُ، يا بَديعُ، يا كَبيرُ، يا قَديرُ، يا خَبيرُ، يا مُجيرُ.

(70) يا حَيا قَبلَّ كُلِّ حَيٍّ، يا حَيا بَعدَ كُلِّ حَيٍّ، يا حَيُّ الَّذي لَيسَ كَمِثلِهِ حَيُّ، يا حَيُّ الَّذي لا يُشارِكُهُ حَيُّ، يا حَيُّ الَّذي لايَحتاجُ إلى حَيٍّ، يا حَيُّ الَّذي يُميتُ كُلَّ حَيٍّ، يا حَيُّ الَّذي يَرزُقُ كُلَّ حَيٍّ، يا حَيا لَم يَرِثِ الحياةَ مِن حَيٍّ، يا حَيُّ الَّذي يُحيي المَوتى، يا حَيُّ يا قَيّومُ لاتَأخُذُهُ سِنَةٌ وَلانَومٌ.

(71) يا مَن لَهُ ذِكرٌ لايُنسى، يا مَن لَهُ نورٌ لا يُطفى، يا مَن لَهُ نِعَمٌ لا تُعَدُّ، يا مَن لَهُ مُلكٌ لا يَزولُ، يا مَن لَهُ ثَناءٌ لا يُحصى، يا مَن لَهُ جَلالٌ لا يُكَيَّفُ، يا مَن لَهُ كَمالٌ لا يُدرَكُ، يا مَن لَهُ قَضاءٌ لا يُرَدُّ، يا مَن لَهُ صِفاتٌ لا تُبَدَّلُ، يا مَن لَهُ نُعوتٌ لا تُغَيَّرُ.

(72) يا رَبَّ العالَمينَ، يا مالِكَ يَومِ الدّينِ، يا غايَةَ الطَّالِبينَ، يا ظَهرَ اللّاجِينَ، يا مُدرِكَ الهارِبينَ، يا مَن يُحِبُّ الصَّابِرينَ، يا مَن يُحِبُّ التَّوَّابينَ، يا مَن يُحِبُّ المُتَطَهِّرينَ، يا مَن يُحِبُّ المُحسِنينَ، يا مَن هُوَ أعلَمُ بِالمُهتَدينَ.

(73) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا شَفيقُ، يا رَفيقُ، يا حَفيظُ ، يا مُحيطُ، يا مُقيتُ، يا مُغيثُ، يا مُعِزُّ، يا مُذِلُّ، يا مُبدئُ، يا مُعيدُ.

(74) يا مَن هُوَ أحَدٌ بِلا ضِدٍّ، يا مَن هُوَ فَردٌ بِلا نِدٍّ، يا مَن هُوَ صَمَدٌ بِلا عَيبٍ، يا مَن هُوَ وِترٌ بِلا كَيفٍ، يا مَن هُوَ قاضٍ بِلا حَيفٍ، يا مَن هُوَ رَبٌّ بِلا وَزيرٍ، يا مَن هُوَ عَزيزٌ بِلا ذُلٍّ، يا مَن هُوَ غَنيٌّ بِلا فَقرٍ، يا مَن هُوَ مَلِكٌ بِلا عَزلٍ، يا مَن هُوَ مَوصوفٌ بِلا شَبيهٍ.

(75) يا مَن ذِكرُهُ شَرَفٌ لِلذَّاكِرينَ، يا مَن شُكرُهُ فَوزٌ لِلشَّاكِرينَ، يا مَن حَمدُهُ عِزٌّ لِلحامِدينَ، يا مَن طاعَتُهُ نَجاةٌ لِلمُطيعينَ، يا مَن بابُهُ مَفتوحٌ لِلطَّالِبينَ، يا مَن سَبيلُهُ وَاضِحٌ لِلمُنيبينَ، يا مَن آياتُهُ بُرهانٌ لِلنَّاظِرينَ، يا مَن كِتابُهُ تَذكِرَةٌ لِلمُتَّقينَ، يا مَن رِزقُهُ عُموم لِلطَّائِعينَ وَالعاصينَ، يا مَن رَحمَتُهُ قَريبٌ مِنَ المُحسِنينَ.

(76) يا مَن تَبارَكَ اسمُهُ، يا مَن تَعالى جَدُّهُ، يا مَن لا إلهَ غَيرُهُ، يا مَن جَلَّ ثَناؤُهُ، يا مَن تَقَدَّسَت أسماؤُهُ، يا مَن يَدومُ بَقاؤُهُ، يا مَن العَظَمَةُ بَهاؤُهُ، يا مَن الكِبرياءُ رِداؤُهُ، يا مَن لا تُحصَى آلاؤُهُ، يا مَن لا تُعَدُّ نَعماؤُهُ.

(77) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا مُعينُ، يا أمينُ، يا مُبينُ، يا مَتينُ، يا مَكينُ، يا رَشيدُ، يا حَميدُ، يا مَجيدُ، يا شَديدُ، يا شَهيدُ.

(78) يا ذا العَرشِ المَجيدِ، يا ذا القَولِ السَّديدِ، يا ذا الفِعلِ الرَّشيدِ، يا ذا البَطشِ الشَّديدِ، يا ذا الوَعدِ وَالوَعيدِ، يا مَن هُوَ الوَليُّ الحَميدُ ، يا مَن هُوَ فَعَّالٌ لِما يُريدُ، يا مَن هُوَ قَريبٌ غَيرُ بَعيدٌ، يا مَن هُوَ عَلى كُلِّ شيء شَهيدٌ، يا مَن هُوَ لَيسَ بِظَلّامٍ لِلعَبيدِ.

(79) يا مَن لا شَريكَ لَهُ وَلا وَزيرَ، يا مَن لا شَبيهَ لَهُ وَلا نَظيرَ، يا خالِقَ الشَّمسِ وَالقَمَرِ المُنيرِ، يا مُغنيَ البائِسِ الفَقيرِ، يا رازِقَ الطِّفلِ الصَّغيرِ، يا راحِمَ الشَّيخِ الكَبيرِ، يا جابِرَ العَظمِ الكَسيرِ، يا عِصمَةَ الخائِفِ المُستَجيرِ، يا مَن هُوَ بِعِبادِهِ خَبيرٌ بَصيرٌ، يا مَن هُوَ عَلى كُلِّ شيء قَديرٌ.

(80) يا ذا الجودِ وَالنِّعَمِ، يا ذا الفَضلِ وَالكَرَمِ، يا خالِقَ اللَّوحِ وَالقَلَمِ، يا بارئَ الذَّرِّ وَالنَّسَمِ، يا ذا البَأسِ وَالنِّقَمِ، يا مُلهِمَ العَرَبِ وَالعَجَمِ، يا كاشِفَ الضُّرِّ وَالألَمِ، يا عالِمَ السِّرِّ وَالهِمَمِ، يا رَبَّ البَيتِ وَالحَرَمِ، يا مَن خَلَقَ الأشياءَ مِنَ العَدَمِ.

(81) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا فاعِلُ، يا جاعِلُ، يا قابِلُ، يا كامِلُ، يا فاصِلُ، يا واصِلُ، يا عادِلُ، يا غالِبُ، يا طالِبُ، يا واهِبُ.

(82) يا مَن أنعَمَ بِطَولِهِ، يا مَن أكرَمَ بِجودِهِ، يا مَن جادَ بِلُطفِهِ، يا مَن تَعَزَّزَ بِقُدرَتِهِ، يا مَن قَدَّرَ بِحِكمَتِهِ، يا مَن حَكَمَ بِتدبيرِهِ، يا مَن دَبَّرَ بِعِلمِهِ، يا مَن تَجاوَزَ بِحِلمِهِ، يا مَن دَنا في عُلوِّهِ، يا مَن عَلا في دُنوِّهِ.

(83) يا مَن يَخلُقُ ما يَشاءُ، يا مَن يَفعَلُ ما يَشاءُ، يا مَن يَهدي مَن يَشاءُ، يا مَن يُضِلُّ مَن يَشاءُ، يا مَن يُعَذِّبُ مَن يَشاءُ، يا مَن يَغفِرُ لِمَن يَشاءُ، يا مَن يُعِزُّ مَن يَشاءُ، يا مَن يُذِلُّ مَن يَشاءُ، يا مَن يُصَوِّرُ في الأرحامِ ما يَشاءُ، يا مَن يَختَصُّ بِرَحمَتِهِ مَن يَشاءُ.

(84) يا مَن لَم يَتَّخِذ صاحِبَةً وَلا وَلَداً، يا مَن جَعَلَ لكلّ شيء قَدراً، يا مَن لا يُشرِكُ في حُكمِهِ أحَداً، يا مَن جَعَلَ المَلائِكَةَ رُسُلاً، يا مَن جَعَلَ في السَّماءِ بُروجاً، يا مَن جَعَلَ الأرضَ قَراراً، يا مَن خَلَقَ مِنَ الماءِ بَشَراً، يا مَن جَعَلَ لكلّ شيء أمَداً، يا مَن أحاطَ بِكُلِّ شيء عِلماً، يا مَن أحصى كُلَّ شيء عَدَد.

(85) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا أوَّلُ، يا آخِرُ، يا ظاهِرُ، يا باطِنُ، يا بَرُّ، يا حَقُّ، يا فَردُ، يا وِترُ، يا صَمَدُ، يا سَرمَدُ.

(86) يا خَيرَ مَعروفٍ عُرِفَ، يا أفضَلَ مَعبودٍ عُبِدَ، يا أجَلَّ مَشكورٍ شُكِرَ، يا أعَزَّ مَذكورٍ ذُكِرَ، يا أعلى مَحمودٍ حُمِدَ، يا أقدَمَ مَوجودٍ طُلِبَ، يا أرفَعَ مَوصوفٍ وُصِفَ، يا أكبَرَ مَقصودٍ قُصِدَ، يا أكرَمَ مَسؤولٍ سُئِلَ، يا أشرَفَ مَحبوبٍ عُلِمَ.

(87) يا حَبيبَ الباكينَ، يا سَيِّدَ المُتَوَكِّلينَ، يا هاديَ المُضِلّينَ، يا وَليَّ المُؤمِنينَ، يا أنيسَ الذَّاكِرينَ، يا مَفزَعَ المَلهوفينَ، يا مُنجيَ الصَّادِقينَ، يا أقدَرَ القادِرينَ، يا أعلَمَ العالِمينَ، يا إلهَ الخَلقِ أجمَعينَ.

(88) يا مَن عَلا فَقَهَرَ، يا مَن مَلَكَ فَقَدَرَ، يا مَن بَطَنَ فَخَبَرَ، يا مَن عُبِدَ فَشَكَرَ، يا مَن عُصيَ فَغَفَرَ، يا مَن لا تَحويهِ الفِكَرُ، يا مَن لايُدرِكُهُ بَصَرٌ، يا مَن لايَخفى عَلَيهِ أثَرٌ، يا رازِقَ البَشَرِ، يا مُقَدِّرَ كُلِّ قَدَرٍ.

(89) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا حافِظُ، يا ذارئُ، يا بارئُ، يا باذِخُ، يا فارِجُ، يا فاتِحُ، يا كاشِفُ، يا ضامِنُ، يا آمِرُ، يا ناهي.

(90) يا مَن لايَعلَمُ الغَيبَ إلاّ هوَ، يا مَن لا يَصرِفُ السّوءَ إلاّ هوَ، يا مَن لايَخلُقُ الخَلقَ إلاّ هوَ، يا مَن لايَغفِرُ الذَّنبَ إلاّ هوَ، يا مَن لايُتِمُّ النِّعمَةَ إلاّ هوَ، يا مَن لا يُقَلِّبُ القُلوبَ إلاّ هوَ، يا مَن لا يُدَبِّرُ الأمرَ الاّ هوَ، يا مَن لايُنَزِّلُ الغَيثَ إلاّ هوَ، يا مَن لايَبسُطُ الرِّزقَ إلاّ هوَ، يا مَن لايُحيِى المَوتى إلاّ هوَ.

(91) يا مُعينَ الضُّعَفاءِ، يا صاحِبَ الغُرَباءِ، يا ناصِرَ الأولياءِ، يا قاهِرَ الأعداءِ، يا رافِعَ السَّماءِ، يا أنيسَ الأصفياءِ، يا حَبيبَ الأتقياءِ، يا كَنزَ الفُقَراءِ، يا إلهَ الأغنياءِ، يا أكرَمَ الكُرَماءِ.

(92) يا كافياً مِن كُلِّ شيءٍ، يا قائِماً عَلى كُلِّ شيءٍ، يا مَن لا يَشبَهُهُ شيءٍ، يا مَن لايَزيدُ في مُلكِهِ شيءٍ، يا مَن لايَخفى عَلَيهِ شيءٍ، يا مَن لا يَنقُصُ مِن خَزائِنِهِ شيءٍ، يا مَن لَيسَ كَمِثلِهِ شيءٍ، يا مَن لايَعزُبُ عَن عِلمِهِ شيءٍ، يا مَن هُوَ خَبيرٌ بِكُلِّ شيءٍ، يا مَن وَسِعَت رَحمَتُهُ كُلَّ شيءٍ.

(93) اللهُمَّ إنّي أسألُكَ بِاسمِكَ، يا مُكرِمُ، يا مُطعِمُ، يا مُنعِمُ، يا مُعطي، يا مُغني، يا مُقني، يا مُفني، يا مُحيي، يا مُرضي، يا مُنجي.

(94) يا أوَّلَ كُلِّ شيء وَآخِـرَهُ، يا إلهَ كُلِّ شيء وَمَليكَهُ، يا رَبَّ كُلِّ شيء وَصانِعَهُ، يا بارئَ كُلِّ شيء وَخالِقَهُ، يا قابِضَ كُلِّ شيء وَباسِطَهِ، يا مُبدئَ كُلِّ شيء وَمُعيدَهُ، يا مُنشئَ كُلِّ شيء وَمُقَدِّرَهُ، يا مُكَوِّنَ كُلِّ شيء وَمُحَوِّلَهُ، يا مُحيي كُلِّ شيء وَمُميتَهُ، يا خالِقَ كُلِّ شيء وَوارِثَهُ.

(95) يا خَيرَ ذاكِرٍ وَمَذكورٍ، يا خَيرَ شاكِرٍ وَمَشكورٍ، يا خَيرَ حامِدٍ وَمَحمودٍ، يا خَيرَ شاهِدٍ وَمَشهودٍ، يا خَيرَ داعٍ وَمَدعوٍّ، يا خَيرَ مُجيبٍ وَمُجابٍ، يا خَيرَ مُؤنِسٍ وَأنيسٍ، يا خَيرَ صاحِبٍ وَجَليسٍ، يا خَيرَ مَقصودٍ وَمَطلوبٍ، يا خَيرَ حَبيبٍ وَمَحبوبٍ.

(96) يا مَن هُوَ لِمَن دَعاهُ مُجيبٌ، يا مَن هُوَ لِمَن أطاعَهُ حَبيبٌ، يا مَن هُوَ إلى مَن أحَبَّهُ قَريبٌ، يا مَن هُوَ بِمَن استَحفَظَهُ رَقيبٌ، يا مَن هُوَ بِمَن رَجاهُ كَريمٌ، يا مَن هُوَ بِمَن عَصاهُ حَليمٌ، يا مَن هُوَ في عَظَمَتِهِ رَحيمٌ ، يا مَن هُوَ في حِكمَتِهِ عَظيمٌ، يا مَن هُوَ في إحسانِهِ قَديمٌ، يا مَن هُوَ بِمَن أرادَهُ عَليمٌ.

(97) اللهُمَّ إنّي اسألُكَ بِاسمِكَ، يا مُسَبِّبُ، يا مُرَغِّبُ، يا مُقَلِّبُ، يا مُعَقِّبُ، يا مُرَتِّبُ، يا مُخَوِّفُ، يا مُحَذِّرُ، يا مُذَكِّرُ، يا مُسَخِّرُ، يا مُغَيِّرُ.

(98) يا مَن عِلمُهُ سابِقٌ، يا مَن وَعدُهُ صادِقٌ، يا مَن لُطفُهُ ظاهِرٌ، يا مَن أمرُهُ غالِبٌ، يا مَن كِتابُهُ مُحكَمٌ، يا مَن قَضاؤُهُ كائِنٌ، يا مَن قَرآنُهُ مَجيدٌ، يا مَن مُلكُهُ قَديمٌ، يا مَن فَضلُهُ عَميمٌ، يا مَن عَرشُهُ عَظيم.

(99) يا مَن لايَشغَلُهُ سَمعٌ عَن سَمعٍ، يا مَن لايَمنَعُهُ فِعلٌ عَن فِعلٍ، يا مَن لا يُلهيهِ قَولٌ عَن قَولٍ، يا مَن لا يُغلِّطُهُ سُؤالٌ عَن سُؤالٍ، يا مَن لايَحجُبُهُ شيءٌ عَن شيءٍ، يا مَن لا يُبرِمُهُ إلحاحُ المُلِحّينَ، يا مَن هُوَ غايَةُ مُرادِ المُريدينَ، يا مَن هُوَ مُنتَهى هِمَمِ العارِفينَ، يا مَن هُوَ مُنتَهى طَلَبِ الطَّالِبينَ، يا مَن لا يَخفى عَلَيهِ ذَرَّةٌ في العالَمينَ.

(100) يا حَليماً لا يعجَلُ، يا جَواداً لا يَبخَلُ، يا صادِقاً لا يُخلِفُ، يا وَهَّاباً لا يَمَلُّ، يا قاهِراً لا يُغلَبُ، يا عَظيماً لا يوصَفُ، يا عَدلاً لا يَحيفُ، يا غَنيا لا يَفتَقِرُ، يا كَبيراً لا يَصغُرُ، يا حافِظاً لا يَغفَلُ سُبحانَكَ، يا لا إلهَ إلاّ أنتَ الغَوثَ الغَوثَ خَلِّصنا مِنَ النّارِ يا رَبِّ.''',
    ),
    Dua(
      title: 'دعاء التوسل',
      benefits: 'دعاء شريف للتوسل بالنبي وأهل بيته (ع) لقضاء الحوائج',
      text: '''بسم الله الرحمن الرحيم

اَللَّهُمَّ إنِّي أسْأَلُكَ وَأتَوَجَّهُ إِلَيْكَ بِنَبِيِّكَ نَبِيِّ الرَّحْمَةِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ يَا أَبَا الْقَاسِمِ يَا رَسُولَ اللهِ يَا إِمَامَ الرَّحْمَةِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا أَبَا الْحَسَنِ يَا أَمِيرَ الْمُؤْمِنِينَ يَا عَلِيَّ بْنَ أَبِي طَالِبٍ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا فَاطِمَةُ الزَّهْراءُ يَا بِنْتَ مُحَمَّدٍ يَا قُرَّةَ عَيْنِ الرَّسُولِ يا سَيِّدَتَنَا وَمَوْلاتَنَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكِ إِلَى اللهِ وَقَدَّمْنَاكِ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهَةً عِنْدَ اللهِ اِشْفَعِي لَنَا عِنْدَ اللهِ يَا أَبَا مُحَمَّدٍ يَا حَسَنَ بْنَ عَلِيٍّ أَيُّهَا الْمُجْتَبَى يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا أَبَا عَبْدِ اللهِ يَا حُسَيْنَ بْنَ عَلِيٍّ أَيُّهَا الشَّهِيدُ يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا أَبَا الْحَسَنِ يَا عَلِيَّ بْنَ الْحُسَيْنِ يَا زَيْنَ الْعَابِدِينَ يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا أَبَا جَعْفَرٍ يَا مُحَمَّدَ بْنَ عَلِيٍّ أَيُّها الْبَاقِرُ يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا أَبَا عَبْدِ اللهِ يَا جَعْفَرَ بْنَ مُحَمَّدٍ أَيُّها الصَّادِقُ يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا أَبَا الْحَسَنِ يَا مُوسَى بْنَ جَعْفَرٍ أَيُّهَا الْكَاظِمُ يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا أَبَا الْحَسَنِ يَا عَلِيَّ بْنَ مُوسَى أَيُّهَا الرِّضَا يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا أَبَا جَعْفَرٍ يَا مُحَمَّدَ بْنَ عَلِيٍّ أَيُّهَا التَّقِيُّ الْجَوادُ يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يا أَبَا الْحَسَنِ يَا عَلِيَّ بْنَ مُحَمَّدٍ أَيُّهَا الْهَادِي النَّقِي يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا أَبَا مُحَمَّدٍ يَا حَسَنَ بْنَ عَلِيٍّ أَيُّهَا الزَّكِيُّ الْعَسْكَرِيُّ يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ يَا وَصِيَّ الْحَسَنِ وَالْخَلَفَ الْحُجَّةَ أَيُّهَا الْقَائِمُ الْمُنْتَظَرُ الْمَهْدِيُّ يَا بْنَ رَسُولِ اللهِ يَا حُجَّةَ اللهِ عَلَى خَلْقِهِ يَا سَيِّدَنَا وَمَوْلانَا إِنَّا تَوَجَّهْنَا وَاسْتَشْفَعْنَا وَتَوَسَّلْنَا بِكَ إِلَى اللهِ وَقَدَّمْنَاكَ بَيْنَ يَدَيْ حَاجَاتِنَا يَا وَجِيهاً عِنْدَ اللهِ اِشْفَعْ لَنَا عِنْدَ اللهِ ثم سل حوائجك فإنّها تقضى إن شاء الله تعالى وعلى رواية أخرى قل بعد ذلك يَا سَادَتِي وَمَوَالِيَّ إِنِّي تَوَجَّهْتُ بِكُمْ أَئِمَّتِي لِيَوْمِ فَقْرِي وَحاجَتِي إِلَى اللهِ وَتَوَسَّلْتُ بِكُمْ إِلَى اللهِ وَاسْتَشْفَعْتُ بِكُمْ إِلَى اللهِ فَاشْفَعُوا لِي عِنْدَ اللهِ وَاسْتَنْقِذُونِي مِنْ ذُنُوبِي عِنْدَ اللهِ فَإنَّكُمْ وَسِيلَتِي إِلَى اللهِ وَبِحُبِّكُمْ وَبِقُرْبِكُمْ أَرْجُو نَجاةً مِنَ اللهِ فَكُونُوا عِنْدَ اللهِ رَجَائِي يا سادَتي يَا أَوْلِيَاءَ اللهِ صَلَّى اللهُ عَلَيْهِمْ أَجْمَعِينَ وَلَعَنَ اللهُ أعْداءَ اللهِ ظَالِمِيهِم مِنَ الأوَّلِينَ وَالآخِرِينَ آمِينَ رَبَّ العالَمِينَ''',
    ),
    Dua(
      title: 'دعاء الصباح',
      benefits: 'دعاء مروي عن أمير المؤمنين (ع) يُستحب قراءته بعد صلاة الفجر',
      text: '''بسم الله الرحمن الرحيم

اَللّهُمَّ يا مَنْ دَلَعَ لِسَانَ الصَّبَاحِ بِنُطْقِ تَبَلُّجِهِ وَسَرَّحَ قِطَعَ اللَّيْلِ الْمُظْلِمِ بِغَيَاهِبِ تَلَجْلُجِهِ وَأَتْقَنَ صُنْعَ الْفَلَكِ الدَّوَّارِ فِي مَقَادِيرِ تَبَرُّجِهِ وَشَعْشَعَ ضِيَاءَ الشَّمْسِ بِنُورِ تَأَجُّجِهِ يَا مَنْ دَلَّ عَلَى ذَاتِهِ بِذَاتِهِ وَتَنَزَّهَ عَنْ مُجَانَسَةِ مَخْلُوقَاتِهِ وَجَلَّ عَنْ مُلاءَمَةِ كَيْفِيَّاتِهِ يَا مَنْ قَرُبَ مِنْ خَطَرَاتِ الظُّنُونِ وَبَعُدَ عَنْ لَحَظَاتِ الْعُيُونِ وَعَلِمَ بِمَا كَانَ قَبْلَ أَنْ يَكُونَ يَا مَنْ أَرْقَدَنِي فِي مِهَادِ أَمْنِهِ وَأَمَانِهِ وَأَيْقَظَنِي إِلَى مَا مَنَحَنِي بِهِ مِنْ مِنَنِهِ وَإِحْسَانِهِ وَكَفَّ أَكُفَّ السُّوءِ عَنِّي بِيَدِهِ وَسُلْطَانِهِ صَلِّ اَللَّهُمَّ عَلَى الدَّلِيلِ إِلَيْكَ فِي اللَّيْلِ الأَلْيَلِ وَالْمَاسِكِ مِنْ أَسْبَابِكَ بِحَبْلِ الشَّرَفِ الأَطْوَلِ والنَّاصِعِ الْحَسَبِ فِي ذِرْوَةِ الْكَاهِلِ الأَعْبَلِ وَالثَّابِتِ الْقَدَمِ عَلَى زَحَالِيفِهَا فِي الزَّمَنِ الأَوَّلِ وَعَلَى آلِهِ الأَخْيَارِ الْمُصْطَفَيْنَ الأَبْرَارِ وَافْتَحِ اللَّهُمَّ لَنَا مَصَارِيعَ الصَّبَاحِ بِمَفَاتِيحِ الرَّحْمَةِ وَالْفَلاحِ وَأَلْبِسْنِي اللَّهُمَّ مِنْ أَفْضَلِ خِلَعِ الْهِدَايَةِ وَالصَّلاحِ وَأَغْرِسِ اللَّهُمَّ بِعَظَمَتِكَ فِي شِرْبِ جَنَانِي يَنَابِيعَ الْخُشُوعِ وَأَجْرِ اللَّهُمَّ لِهَيْبَتِكَ مِنْ آمَاقِي زَفَراتِ الدُّمُوعِ وَأَدِّبِ اللَّهُمَّ نَزَقَ الْخُرْقِ مِنِّي بِأَزِمَّةِ الْقُنُوعِ إِلَهِي إِن لََمْ تَبْتَدِئْنِي الرَّحْمَةُ مِنْكَ بِحُسْنِ التَّوْفِيقِ فَمَنِ السَّالِكُ بِي إِلَيْكَ فِي وَاضِحِ الطَّرِيقِ وَإِنْ أَسْلَمَتْنِي أَنَاتُكَ لِقَائِدِ الأَمَلِ وَالْمُنَى فَمَنِ الْمُقِيلُ عَثَرَاتِي مِنْ كَبَوَاتِ الْهَوَى وَإِنْ خَذَلَنِي نَصْرُكَ عِنْدَ مُحَارَبَةِ النَّفْسِ وَالشَّيْطَانِ فَقَدْ وَكَلَنِي خِذْلانُكَ إِلَى حَيْثُ النَّصَبُ وَالْحِرْمَانُ إِلَهِي أَتَرَانِي مَا أَتَيْتُكَ إِلَّا مِنْ حَيْثُ الآمَالُ أَمْ عَلِقْتُ بَأَطْرَافِ حِبَالِكَ إِلَّا حِيْنَ بَاعَدَتْنِي ذُنُوبِي عَنْ دَارِ الْوِصَالِ فَبِئْسَ الْمَطِيَّةُ الَّتِي امْتَطَتْ نَفْسِي مِنْ هَوَاهَا فَوَاهاً لَهَا لِمَا سَوَّلَتْ لَهَا ظُنُونُها وَمُنَاهَا وَتَبًّا لَهَا لِجُرْأَتِهَا عَلَى سَيِّدِهَا وَمَوْلاهَا إِلَهِي قَرَعْتُ بَابَ رَحْمَتِكَ بِيَدِ رَجَائِي وَهَرَبْتُ إِلَيْكَ لاجِئاً مِنْ فَرْطِ أَهْوَائِي وَعَلَّقْتُ بِأَطْرَافِ حِبَالِكَ أَنَامِلَ وَلائِي فَاصْفَحِ اللَّهُمَّ عمَّا كُنْتُ أَجْرَمْتُهُ مِنْ زَلَلِي وَخَطَائِي وَأَقِلْنِي مِنْ صَرْعَةِ رِدَائِي فَإِنَّكَ سَيِّدِي وَمَوْلاي وَمُعْتَمَدِي وَرَجَائِي وَأَنْتَ غَايَةُ مَطْلُوبِي وَمُنَايَ فِي مُنْقَلَبِي وَمَثْوَايَ إِلَهِي كَيْفَ تَطْرُدُ مِسْكِيناً الْتَجَأَ إِلَيْكَ مِنَ الذُّنُوبِ هَارِباً أَمْ كَيْفَ تُخَيِّبُ مُسْتَرْشِداً قَصَدَ إِلَى جَنَابِكَ سَاعِياً أَمْ كَيْفَ تَرُدُّ ظَمْآناً وَرَدَ إِلَى حِيَاضِكَ شارِباً كَلّا وَحِياضُكَ مُتْرَعَةٌ فِي ضَنْكِ الْمُحُولِ وَبَابُكَ مَفْتُوحٌ لِلطَّلَبِ وَالْوُغُولِ وَأَنْتَ غَايَةُ الْمَسْؤُولِ ونِهَايَةُ الْمَأْمُولِ إِلَهِي هَذِهِ أَزِمَّةُ نَفْسِي عَقَلْتُهَا بِعِقَالِ مَشِيئَتِكَ وَهذِهِ أَعْبَاءُ ذُنُوبِي دَرَأْتُهَا بِعَفْوِكَ وَرَحْمَتِكَ وَهَذِهِ أَهْوَائِي الْمُضِلَّةُ وَكَلْتُهَا إِلَى جَنَابِ لُطْفِكَ وَرَأفَتِكَ فَاجْعَلِ اللَّهُمَّ صَبَاحِي هَذَا نَازِلاً عَلَيَّ بِضِيَاءِ الْهُدَى وَبِالسَّلامَةِ فِي الدِّينِ وَالدُّنْيَا وَمَسَائِي جُنَّةً مِنْ كَيْدِ العِدَى وَوِقَايَةً مِنْ مُرْدِيَاتِ الْهَوَى إِنَّكَ قَادِرٌ عَلَى مَا تَشَاءُ تُؤْتِي الْمُلْكَ مَنْ تَشَاءُ وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشَاءُ وَتُعِزُّ مَنْ تَشَاءُ وَتُذِلُّ مَنْ تَشَاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ تُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلِ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَتَرْزُقُ مَنْ تَشَاءُ بِغَيْرِ حِسَابٍ لا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ مَنْ ذا يَعْرِفُ قَدْرَكَ فَلا يَخَافُكَ وَمَنْ ذَا يَعْلَمُ مَا أَنْتَ فَلا يَهَابُكَ أَلَّفْتَ بِقُدْرَتِكَ الْفِرَقَ وَفَلَقْتَ بِلُطْفِكَ الْفَلَقَ وَأَنَرْتَ بِكَرَمِكَ دَيَاجِيَ الْغَسَقِ وَأَنْهَرْتَ الْمِيَاهَ مِنَ الصُّمِّ الصَّيَاخِيدِ عَذْباً وَأُجَاجاً وَأَنْزَلْتَ مِنَ الْمُعْصِرَاتِ مَاءً ثَجَّاجاً وَجَعَلْتَ الشَّمْسَ وَالْقَمَرَ لِلْبَرِيَّةِ سِرَاجاً وَهَّاجاً مِنْ غَيْرِ أَنْ تُمَارِسَ فِيمَا ابْتَدَأْتَ بِهِ لُغُوباً وَلا عِلاجاً فَيَا مَنْ تَوَحَّدَ بِالْعِزِّ وَالْبَقَاءِ وَقَهَرَ عِبَادَهُ بِالْمَوْتِ وَالْفَنَاءِ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ الأَتْقِيَاءِ وَاسْمَعْ نِدَائِي وَاسْتَجِبْ دُعَائِي وَحَقِّقْ بِفَضْلِكَ أَمَلِي وَرَجَائِي يا خَيْرَ مَنْ دُعِيَ لِكَشْفِ الضُّرِ وَالْمَأْمُولَِ لِكُلِّ عُسْرٍ وَيُسْرٍ بِكَ أَنْزَلْتُ حَاجَتِي فَلا تَرُدَّنِي مِنْ سَنِيِّ مَوَاهِبِكَ خَائِباً يَا كَرِيمُ يَا كَرِيمُ يَا كَرِيمُ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ وَصَلَّى اللهُ عَلَى خَيْرِ خَلْقِهِ مُحَمَّدٍ وَآلِهِ أَجْمَعِينَ ثُمَّ اسْجُدْ وَقُلْ إِلَهِي قَلْبِي مَحْجُوبٌ وَنَفْسِي مَعْيُوبٌ وَعَقْلِي مَغْلُوبٌ وَهُوَائِي غَالِبٌ وَطَاعَتِي قَلِيلٌ وَمَعْصِيَتِي كَثِيرٌ وَلِسَانِي مُقِرُّ بِالذُّنُوبِ فَكَيْفَ حِيلَتِي يَا سَتَّارَ الْعُيُوبِ وَيَا عَلّامَ الْغُيُوبِ وَيَا كَاشِفَ الْكُرُوبِ اِغْفِرْ ذُنُوبِي كُلَّهَا بِحُرْمَةِ مُحَمَّدٍ وَآلِ مُحَمَّدٍ يَا غَفَّارُ يَا غَفَّارُ يَا غَفَّارُ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dua(
      title: 'دعاء الافتتاح',
      benefits: 'دعاء عظيم الشأن يُستحب قراءته في كل ليلة من ليالي شهر رمضان المبارك',
      text: '''بسم الله الرحمن الرحيم

اَللَّهُمَّ إِنِّي أَفْتَتِحُ الثَّنَاءَ بِحَمْدِكَ وَأَنْتَ مُسَدِّدٌ لِلصَّوَابِ بِمَنِّكَ وَأَيْقَنْتُ أَنَّكَ أَنْتَ أَرْحَمُ الرَّاحِمِينَ فِي مَوْضِعِ الْعَفْوِ وَالرَّحْمَةِ وَأَشَدُّ الْمُعَاقِبِينَ فِي مَوْضِعِ النَّكَالِ وَالنَّقِمَةِ وَأَعْظَمُ الْمُتَجَبِّرِينَ فِي مَوْضِعِ الْكِبْرِيَاءِ وَالْعَظَمَةِ اَللَّهُمَّ أَذِنْتَ لِي فِي دُعَائِكَ وَمَسْأَلَتِكَ فَاسْمَعْ يَا سَمِيعُ مِدْحَتِي وَأَجِبْ يَا رَحِيمُ دَعْوَتِي وَأَقِلْ يَا غَفُورُ عَثْرَتِي فَكَمْ يَا إِلَهِي مِنْ كُرْبَةٍ قَدْ فَرَّجْتَهَا وَهُمُومٍ قَدْ كَشَفْتَهَا وَعَثْرَةٍ قَدْ أَقَلْتَهَا وَرَحْمَةٍ قَدْ نَشَرْتَهَا وَحَلْقَةِ بَلاءٍ قَدْ فَكَكْتَهَا اَلحَمْدُ للهِ الَّذِي لَمْ يَتَّخِذْ صَاحِبَةً وَلا وَلَداً وَلَمْ يَكُن لَّهُ شَرِيكٌ فِي الْمُلْكِ وَلَمْ يَكُن لَّهُ وَلِيٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبِيراً اَلحَمْدُ للهِ بِجَمِيعِ مَحَامِدِهِ كُلِّهَا عَلَى جَمِيعِ نِعَمِهِ كُلِّهَا اَلحَمْدُ للهِ الَّذِي لا مُضادَّ لَهُ فِي مُلْكِهِ وَلا مُنَازِعَ لَهُ فِي أَمْرِهِ اَلْحَمْدُ للهِ الَّذِي لا شَرِيكَ لَهُ فِي خَلْقِهِ وَلا شَبِيهَ لَهُ فِي عَظَمَتِهِ اَلْحَمْدُ للهِ الْفاشِي في الْخَلْقِ أَمْرُهُ وَحَمْدُهُ الظَّاهِرِ بِالْكَرَمِ مَجْدُهُ الْبَاسِطِ بِالْجُودِ يَدَهُ الَّذِي لا تَنْقُصُ خَزَائِنُهُ وَلا تَزيدُهُ كَثْرَةُ الْعَطَاءِ إِلَّا جُوداً وَكَرَماً إِنَّهُ هُوَ الْعَزِيزُ الْوَهَّابُ اَللَّهُمَّ إِنِّي أَسْأَلُكَ قَلِيلاً مِنْ كَثِيرٍ مَعَ حاجَةٍ بِي إِلَيْهِ عَظِيمَةٍ وَغِنَاكَ عَنْهُ قَدِيمٌ وَهُوَ عِنْدِي كَثِيرٌ وَهُوَ عَلَيْكَ سَهْلٌ يَسِيرٌ اَللَّهُمَّ إِنَّ عَفْوَكَ عَنْ ذَنْبِي وَتَجَاوُزَكَ عَنْ خَطِيئَتِي وَصَفْحَكَ عَنْ ظُلْمِي وَسِتْرَكَ عَلَى قَبِيحِ عَمَلِي وَحِلْمَكَ عَنْ كَثِيرِ جُرْمِي عِنْدَمَا كَانَ مِنْ خَطَإِي وَعَمْدِي أَطْمَعَنِي فِي أَنْ أَسْأَلَكَ مَا لا أَسْتَوْجِبُهُ مِنْكَ الَّذِي رَزَقْتَنِي مِن رَّحْمَتِكَ وَأَرَيْتَنِي مِنْ قُدْرَتِكَ وَعَرَّفْتَنِي مِنْ إِجَابَتِكَ فَصِرْتُ أَدْعُوكَ آمِناً وَأَسْأَلُكَ مُسْتَأنِساً لا خَائِفاً وَلا وَجِلاً مُدِلًّا عَلَيْكَ فِيمَا قَصَدتُّ فِيهِ إِلَيْكَ فَإِنْ أَبْطَأَ عَنِّي عَتَبْتُ بِجَهْلِي عَلَيْكَ وَلَعَلَّ الَّذِي أَبْطَأَ عَنِّي هُوَ خَيْرٌ لِي لِعِلْمِكَ بِعَاقِبَةِ الأُمُورِ فَلَمْ أَرَ مَوْلًى كَرِيماً أَصْبَرَ عَلَى عَبْدٍ لَئِيمٍ مِنْكَ عَلَيَّ يَا رَبِّ إِنَّكَ تَدْعُونِي فَأُوَلِّي عَنْكَ وَتَتَحَبَّبُ إِلَيَّ فَأَتَبَغَّضُ إِلَيْكَ وَتَتَوَدَّدُ إِلَيَّ فَلا أَقْبَلُ مِنْكَ كَأَنَّ لِيَ التَّطَوُّلَ عَلَيْكَ فَلَمْ يَمْنَعْكَ ذَلِكَ مِنَ الرَّحْمَةِ لِي وَالإِحْسَانِ إِلَيَّ وَالتَّفَضُّلِ عَلَيَّ بِجُودِكَ وَكَرَمِكَ فَارْحَمْ عَبْدَكَ الْجَاهِلَ وَجُدْ عَلَيْهِ بِفَضْلِ إِحْسَانِكَ إِنَّكَ جَوَادٌ كَرِيمٌ اَلْحَمْدُ للهِ مَالِكِ الْمُلْكِ مُجْرِي الْفُلْكِ مُسَخِّرِ الرِّيَاحِ فَالِقِ الإِصْبَاحِ دَيَّانِ الدِّينِ رَبِّ الْعَالَمِينَ اَلْحَمْدُ للهِ عَلَى حِلْمِهِ بَعْدَ عِلْمِهِ وَالْحَمْدُ للهِ عَلَى عَفْوِهِ بَعْدَ قُدْرَتِهِ وَالْحَمْدُ للهِ عَلَى طُولِ أَنَاتِهِ فِي غَضَبِهِ وَهُوَ قَادِرٌ عَلَى مَا يُرِيدُ اَلْحَمْدُ للهِ خَالِقِ الْخَلْقِ بَاسِطِ الرِّزْقِ فالِقِ الْإِصْبَاحِ ذِي الْجَلالِ وَالإِكْرَامِ وَالْفَضْلِ وَالإِنْعَامِ الَّذِي بَعُدَ فَلا يُرَى وَقَرُبَ فَشَهِدَ النَّجْوَى تَبَارَكَ وَتَعَالَى اَلحَمْدُ للهِ الَّذِي لَيْسَ لَهُ مُنَازِعٌ يُعَادِلُهُ وَلا شَبيهٌ يُشَاكِلُهُ وَلا ظَهِيرٌ يُعَاضِدُهُ قَهَرَ بِعِزَّتِهِ الأَعِزَّاءَ وَتَوَاضَعَ لِعَظَمَتِهِ الْعُظَمَاءُ فَبَلَغَ بِقُدْرَتِهِ مَا يَشَاءُ اَلْحَمْدُ للهِ الَّذِي يُجِيبُني حِينَ أُنَادِيهِ وَيَسْتُرُ عَلَيَّ كُلَّ عَوْرَةٍ وَأَنَا أَعْصِيهِ وَيُعَظِّمُ الْنِّعْمَةَ عَلَيَّ فَلا أُجَازِيهِ فَكَم مِّن مَّوْهِبَةٍ هَنيئَةٍ قَدْ أَعْطَانِي وَعَظِيمَةٍ مَخُوفَةٍ قَدْ كَفَانِي وَبَهْجَةٍ مُّونِقَةٍ قَدْ أَرَانِي فَأُثْنِي عَلَيْهِ حَامِداً وَأَذْكُرُهُ مُسَبِّحاً اَلْحَمْدُ للهِ الَّذِي لا يُهْتَكُ حِجَابُهُ وَلا يُغْلَقُ بَابُهُ وَلا يُرَدُّ سَائِلُهُ وَلا يُخَيَّبُ آمِلُهُ اَلْحَمْدُ للهِ الَّذِي يُؤْمِنُ الْخَائِفِينَ وَيُنَجِّي الصَّالِحِينَ وَيَرْفَعُ الْمُسْتَضْعَفِينَ وَيَضَعُ الْمُسْتَكْبِرِينَ ويُهْلِكُ مُلُوكاً وَيَسْتَخْلِفُ آخَرِينِ وَالْحَمْدُ للهِ قَاصِمِ الْجَبَّارِينَ مُبِيرِ الظَّالِمِينَ مُدْرِكِ الْهَارِبِينَ نَكَالِ الظَّالِمِينَ صَرِيخِ الْمُسْتَصْرِخِينَ مَوْضِعِ حَاجَاتِ الطَّالِبِينَ مُعْتَمَدِ الْمُؤْمِنِينَ اَلْحَمْدُ للهِ الَّذِي مِنْ خَشْيَتِهِ تَرْعَدُ السَّمَاءُ وَسُكَّانُهَا وَتَرْجُفُ الأَرْضُ وَعُمَّارُهَا وَتَمُوجُ الْبِحَارُ وَمَن يَّسْبَحُ فِي غَمَرَاتِهَا اَلْحَمْدُ للهِ الَّذِي هَدَانَا لِهَذا وَمَا كُنَّا لِنَهْتَدِيَ لَوْلا أَنْ هَدَانَا اللّهُ اَلْحَمْدُ للهِ الَّذِي يَخْلُقُ وَلَمْ يُخْلَقْ وَيَرْزُقُ وَلا يُرْزَقُ وَيُطْعِمُ وَلا يُطْعَمُ وَيُمِيتُ الأَحْيَاءَ وَيُحْيِي الْمَوْتَى وَهُوَ حَيٌّ لَّا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ وَأَمِينِكَ وَصَفِيِّكَ وَحَبِيبِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ وَحافِظِ سِرِّكَ وَمُبَلِّغِ رِسَالاتِكَ أَفْضَلَ وَأَحْسَنَ وَأَجْمَلَ وَأَكْمَلَ وَأَزْكَى وَأَنْمَى وَأَطْيَبَ وَأَطْهَرَ وَأَسْنَى وَأَكْثَرَ مَا صَلَّيْتَ وَبَارَكْتَ وَتَرَحَّمْتَ وَتَحَنَّنْتَ وَسَلَّمْتَ عَلَى أَحَدٍ مِن عِبَادِكَ وَأَنْبِيائِكَ وَرُسُلِكَ وَصَفْوَتِكَ وَأَهْلِ الْكَرَامَةِ عَلَيْكَ مِنْ خَلْقِكَ اَللَّهُمَّ وَصَلِّ عَلَى عَليٍّ أَمِيرِ الْمُؤْمِنِينَ وَوَصِيِّ رَسُولِ رَبِّ الْعَالَمِينَ عَبْدِكَ وَوَليِّكَ وَأَخِي رَسُولِكَ وَحُجَّتِكَ عَلَى خَلْقِكَ وَآيَتِكَ الْكُبْرَى وَالنَّبَإِ الْعَظِيمِ وَصَلِّ عَلَى الصِّدِّيقَةِ الطَّاهِرَةِ فَاطِمَةَ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ وَصَلِّ عَلَى سِبْطَيِ الرَّحْمَةِ وَإِمَامَيِ الْهُدَى الْحَسَنِ وَالْحُسَيْنِ سَيِّدَيْ شَبَابِ أَهْلِ الْجَّنَةِ وَصَلِّ عَلَى أَئِمَّةِ الْمُسْلِمِينَ عَلِيِّ بْنِ الْحُسَيْنِ وَمُحَمَّدِ بْنِ عَلِيٍّ وَجَعْفَرِ بْنِ مُحَمَّدٍ وَمُوسَى بْنِ جَعْفَرٍ وَعَلِيِّ بْنِ مُوسَى وَمُحَمَّدِ بْنِ عَلِيٍّ وَعَلِيِّ بْنِ مُحَمَّدٍ وَالْحَسَنِ بْنِ عَلِيٍّ وَالْخَلَفِ الْهَادِي الْمَهْدِيِّ حُجَجِكَ عَلَى عِبَادِكَ وَأُمَنَائِكَ فِي بِلادِكَ صَلَاةً كَثِيرَةً دَائِمَةً اَللَّهُمَّ وَصَلِّ عَلَى وَلِيِّ أَمِيرِكَ الْقَائِمِ الْمُؤَمَّلِ وَالْعَدْلِ الْمُنْتَظَرِ وَحُفَّهُ بِمَلائِكَتِكَ الْمُقَرَّبِينَ وَأَيِّدْهُ بِرُوحِ الْقُدُسِ يَا رَبَّ الْعَالَمِينَ اَللّهُمَّ اجْعَلْهُ الدَّاعِيَ إِلَى كِتَابِكَ وَالْقَائِمَ بِدِينِكَ اِسْتَخْلِفْهُ فِي الأَرْضِ كَمَا اسْتَخْلَفْتَ الَّذِينَ مِنْ قَبْلِهِ مَكِّن لَّهُ دِينَهُ الَّذِي ارْتَضَيْتَهُ لَهُ أَبْدِلْهُ مِنْ بَعْدِ خَوْفِهِ أَمْناً يَعْبُدُكَ لا يُشْرِكُ بِكَ شَيْئاً اَللَّهُمَّ أَعِزَّهُ وَأَعْزِزْ بِهِ وَانْصُرْهُ وَانْتَصِرْ بِهِ وَانْصُرْهُ نَصْراً عَزِيزاً وَافْتَحْ لَهُ فَتْحاً يَّسِيراً وَاجْعَل لَّهُ مِن لَّدُنْكَ سُلْطاناً نَّصيراً اَللَّهُمَّ أَظْهِرْ بِهِ دِينَكَ وَسُنَّةَ نَبِيِّكَ حَتّى لا يَسْتَخْفِيَ بِشَيْءٍ مِنَ الْحَقِّ مَخَافَةَ أَحَدٍ مِنَ الْخَلْقِ اَللَّهُمَّ إِنَّا نَرْغَبُ إِلَيْكَ فِي دَوْلَةٍ كََرِيمَةٍ تُعِزُّ بِهَا الإِسْلامَ وَأَهْلَهُ وَتُذِلُّ بِهَا النِّفَاقَ وَأَهْلَهُ وَتَجْعَلُنَا فِيهَا مِنَ الدُّعَاةِ إِلَى طَاعَتِكَ وَالْقادَةِ إِلَى سَبِيلِكَ وَتَرْزُقُنَا بِهَا كَرَامَةَ الدُّنْيَا وَالآخِرَةِ اَللَّهُمَّ مَا عَرَّفْتَنَا مِنَ الْحَقِّ فَحَمِّلْنَاهُ وَمَا قَصُرْنَا عَنْهُ فَبَلِّغْنَاهُ اَللَّهُمَّ الْمُمْ بِهِ شَعَثَنَا وَاشْعَب بِّهِ صَدْعَنَا وَارْتُقْ بِهِ فَتْقَنَا وَكَثِّرْ بِهِ قِلَّتَنَا وَأَعْزِزْ بِهِ ذِلَّتَنَا وَأَغْنِ بِهِ عائِلَنَا وَاقْضِ بِهِ عَن مُّغْرَمِنَا وَاجْبُرْ بِهِ فَقْرَنَا وَسُدَّ بِهِ خَلَّتَنَا وَيَسِّرْ بِهِ عُسْرَنَا وَبَيِّضْ بِهِ وُجُوهَنَا وَفُكَّ بِهِ أَسْرَنَا وَأَنْجِحْ بِهِ طَلِبَتَنَا وَأَنْجِزْ بِهِ مَوَاعِيدَنَا وَاسْتَجِب بِّهِ دَعْوَتَنَا وَأَعْطِنَا بِهِ سُؤْلَنَا وَبَلِّغْنَا بِهِ مِنَ الدُّنْيَا وَالآخِرَةِ آمَالَنَا وَأَعْطِنَا بِهِ فَوْقَ رَغْبَتِنَا يَا خَيْرَ الْمَسْؤُولِينَ وَأَوْسَعَ الْمُعْطِينَ اِشْفِ بِهِ صُدُورَنَا وَأَذْهِب بِّهِ غَيْظَ قُلُوبِنَا وَاهْدِنَا بِهِ لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيمٍ وَانْصُرْنَا بِهِ عَلَى عَدُوِّكَ وَعَدُوِّنَا إِلَهَ الْحَقِّ آمِينَ اَللَّهُمَّ إِنَّا نَشْكُو إِلَيْكَ فَقْدَ نَبِيِّنَا صَلَوَاتُكَ عَلَيْهِ وَآلِهِ وَغَيْبَةَ وَلِيِّنَا وَكَثْرَةَ عَدُوِّنَا وَقِلَّةَ عَدَدِنَا وَشِدَّةَ الْفِتَنِ بِنَا وَتَظَاهُرَ الزَّمَانِ عَلَيْنَا فَصَلِّ عَلَى مُحَمَّدٍ وَآلِهِ وَأَعِنَّا عَلَى ذَلِكَ بِفَتْحٍ مِنْكَ تُعَجِّلُهُ وَبِضُرٍّ تَكْشِفُهُ وَنَصْرٍ تُعِزُّهُ وَسُلْطَانِ حَقٍّ تُظْهِرُهُ وَرَحْمَةٍ مِنْكَ تَجَلِّلُنَاها وَعَافِيَةٍ مِّنْكَ تُلْبِسُنَاهَا بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ اَللَّهُمَّ بِرَحْمَتِكَ فِي الصَّالِحِينَ فَأَدْخِلْنَا وَفِي عِلِّيِّينَ فَارْفَعْنَا وِبَكَأسٍ مِّنْ مَعِينٍ مِنْ عَيْنٍ سَلْسَبِيلٍ فَاسْقِنَا وَمِنَ الْحُورِ الْعِينِ بِرَحْمَتِكَ فَزَوِّجْنَا وَمِنَ الْوِلْدَانِ الْمُخَلَّدِينَ كَأَنَّهُمْ لُؤْلُؤٌ مَكْنُونٌ فَأَخْدِمْنَا وَمِنْ ثِمَارِ الْجَنَّةِ وَلُحُومِ الطَّيْرِ فَأَطْعِمْنَا وِمِنْ ثِيَابِ السُّنْدُسِ وَالْحَرِيرِ وَالإِسْتَبْرَقِ فَأَلبِسْنَا وَلَيْلَةَ الْقَدْرِ وَحَجَّ بَيْتِكَ الْحرامِ وَقَتْلاً فِي سَبِيلِكَ فَوفِّقْ لَنَا وَصالِحَ الدُّعَاءِ وَالْمَسْأَلَةِ فاسْتَجِبْ لَنَا وَإِذَا جَمَعْتَ الأَوَّلِينَ وَالآخِرينَ يَوْمَ الْقِيَامَةِ فارْحَمْنَا وَبَراءَةً مِنَ النَّارِ فَاكْتُبْ لَنَا وَفِي جَهَنَّمَ فَلا تَغُلَّنَا وَفِي عَذَابِكَ وَهَوَانِكَ فَلا تَبْتَلِنَا وَمِنَ الزَّقُّومِ وَالضَّرِيعِ فَلا تُطْعِمْنَا وَمَعَ الشَّيَاطِينِ فَلا تَجْعَلْنَا وَفِي النَّارِ عَلَى وُجُوهِنَا فَلا تَكْبُبْنَا وَمِنْ ثِيَابِ النَّارِ وَسَرَابِيلِ الْقَطِرَانِ فَلا تُلْبِسْنَا وَمِنْ كُلِّ سُوءٍ يَا لَا إِلَهَ إِلَّا أَنْتَ بِحَقِّ لا إِلَهَ إِلَّا أَنْتَ فَنَجِّنَا''',
    ),
    Dua(
      title: 'دعاء يا عدتي في كربتي',
      benefits: 'دعاء مروي عن أئمة الهدى (ع) لدفع الشدائد والكرب',
      text: '''بسم الله الرحمن الرحيم

يَا عُدَّتِي فِي كُرْبَتِي وَيَا صَاحِبِي فِي شِدَّتِي وَيَا وَلِيِّي فِي نِعْمَتِي وَيَا غَايَتِي فِي رَغْبَتِي أَنْتَ السَّاتِرُ عَوْرَتِي وَالْمُؤْمِنُ رَوْعَتِي وَالْمُقِيلُ عَثْرَتِي فَاغْفِرْ لِي خَطِيئَتِي اَللَّهُمَّ إِنِّي أَسْأَلُكَ خُشُوعَ الإِيمَانِ قَبْلَ خُشُوعِ الذُّلِّ فِي النَّارِ يَا وَاحِدُ يَا أَحَدُ يَا صَمَدُ يَا مَن لَّمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ يَا مَن يُّعْطِي مَنْ سَأَلَهُ تَحَنُّناً مِنْهُ وَرَحْمَةً وَيَبْتَدِئُ بِالْخَيْرِ مَن لَّمْ يَسْأَلْهُ تَفَضُّلاً مِّنْهُ وَكَرَماً بِكَرَمِكَ الدّائِمِ صَلِّ عَلَى مُحَمَّدٍ وَّآلِ مُحَمَّدٍ وَهَبْ لِي رَحْمَةً وَّاسِعَةً جَامِعَةً أَبْلُغُ بِهَا خَيْرَ الدُّنْيَا وَالآخِرَةِ اَللَّهُمَّ إِنِّي أَسْتَغْفِرُكَ لِمَا تُبْتُ إِلَيْكَ مِنْهُ ثُمَّ عُدتُّ فِيهِ وَأَسْتَغْفِرُكَ لِكُلِّ خَيْرٍ أَرَدتُّ بِهِ وَجْهَكَ فَخالَطَنِي فِيهِ مَا لَيْسَ لَكَ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاعْفُ عَنْ ظُلْمِي وَجُرْمِي بِحِلْمِكَ وَجُودِكَ يا كَرِيمُ يَا مَن لَّا يَخِيبُ سَائِلُهُ وَلا يَنْفَدُ نَائِلُهُ يَا مَنْ عَلا فَلا شَيْءَ فَوْقَهُ وَدَنَا فَلا شَيءَ دُونَهُ صَلِّ عَلَى مُحَمَّدٍ وآلِ مُحَمَّدٍ وَارْحَمْنِي يَا فَالِقَ الْبَحْرِ لِمُوسَى اللَّيْلَةَ اللَّيْلَةَ اللَّيْلَةَ السَّاعَةَ السَّاعَةَ السَّاعَةَ اَللَّهُمَّ طَهِّرْ قَلْبِي مِنَ النِّفَاقِ وَعَمَلي مِنَ الرِّيَاءِ وَلِسَانِي مِنَ الْكَذِبِ وَعَيْنِي مِنَ الْخِيَانَةِ فَإِنَّكَ تَعْلَمُ خَائِنَةَ الأَعْيُنِ وَمَا تُخْفِي الصُّدُورِ يَا رَبِّ هَذَا مَقَامُ الْعَائِذِ بِكَ مِنَ النَّارِ هَذَا مَقَامُ الْمُسْتَجِيرِ بِكَ مِنَ النَّارِ هَذَا مَقَامُ الْمُسْتَغِيثِ بِكَ مِنَ النَّارِ هَذَا مَقَامُ الْهَارِبِ إِلَيْكَ مِنَ النَّارِ هَذَا مَقَامُ مَن يَّبُوءُ لَكَ بِخَطِيئَتِهِ وَيَعْتَرِفُ بِذَنْبِهِ وَيَتُوبُ إِلَى رَبِّهِ هَذَا مَقَامُ الْبَائِسِ الْفَقِيرِ هَذَا مَقَامُ الْخَائِفِ الْمُسْتَجِيرِ هَذَا مَقَامُ الْمَحْزُونِ الْمَكْرُوبِ هَذَا مَقَامُ الْمَغْمُومِ الْمَهْمُومِ هَذَا مَقَامُ الْغَرِيبِ الْغَرِيقِ هَذَا مَقَامُ الْمُسْتَوْحِشِ الْفَرِقِ هَذَا مَقَامُ مَن لَّا يَجِدُ لِذَنْبِهِ غَافِراً غَيْرَكَ وَلا لِضَعْفِهِ مُقَوِّياً إِلَّا أَنْتَ وَلا لِهَمِّهِ مُفَرِّجاً سِوَاكَ يَا أَللهُ يَا كَرِيمُ لا تُحْرِقْ وَجْهِي بِالنَّارِ بَعْدَ سُجُودِي لَكَ وَتَعْفِيرِي بِغَيْرِ مَنٍّ مِنِّي عَلَيْكَ بَل لَّكَ الْحَمْدُ وَالْمَنُّ وَالتَّفَضُّلُ عَلَيَّ ارْحَمْ أَيْ رَبِّ أَيْ رَبِّ ضَعْفِي وَقِلَّةَ حِيلَتِي وَرِقَّةَ جِلْدِي وَتَبَدُّدَ أَوْصَالِي وَتَنَاثُرَ لَحْمِي وَجِسْمِي وَجَسَدِي وَوَحْدَتِي وَوَحْشَتِي فِي قَبْرِي وَجَزَعِي مِنْ صَغيرِ الْبَلاءِ أَسْأَلُكَ يَا رَبِّ قُرَّةَ الْعَيْنِ وَالِاغْتِبَاطَ يَومَ الْحَسْرَةِ وَالنَّدامَةِ بَيِّضْ وَجْهِي يا رَبِّ يَوْمَ تَسْوَدُّ الْوُجُوهُ آمِنِّي مِنَ الْفَزَعِ الأَكْبَرِ أَسْأَلُكَ الْبُشْرَى يَوْمَ تُقَلَّبُ الْقُلُوبُ وَالأَبْصَارُ وَالْبُشْرَى عِنْدَ فِرَاقِ الدُّنْيَا اَلْحَمْدُ للهِ الَّذِي أَرْجُوهُ عَوْناً فِي حَيَاتِي وَأُعِدُّهُ ذُخْراً لِيَوْمِ فَاقَتِي اَلْحَمْدُ للهِ الَّذِي أَدْعُوهُ وَلا أَدْعُو غَيْرَهُ وَلَوْ دَعَوْتُ غَيْرَهُ لَخَيَّبَ دُعَائِي اَلْحَمْدُ للهِ الَّذِي أَرْجُوهُ وَلا أَرْجُو غَيْرَهُ وَلَوْ رَجَوْتُ غَيْرَهُ لأَخْلَفَ رَجَائِي اَلْحَمْدُ للهِ الْمُنْعِمِ الْمُحْسِنِ الُمجْمِلِ الْمُفْضِلِ ذِي الْجَلالِ والإِكْرامِ وَلِيِّ كُلِّ نِعْمَةٍ وَصَاحِبِ كُلِّ حَسَنَةٍ وَمُنْتَهَى كُلِّ رَغْبَةٍ وَقَاضِي كُلِّ حَاجَةٍ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَارْزُقْنِي الْيَقِينَ وُحسْنَ الظَّنِّ بِكَ وَأَثْبِتْ رَجَاءَكَ فِي قَلْبِي وَاقْطَعْ رَجَائَي عَمَّنْ سِوَاكَ حَتَّى لا أَرْجُوَ غَيْرَكَ وَلا أَثِقَ إِلَّا بِكَ يا لَطِيفاً لِمَا تَشَاءُ اُلْطُفْ لِي فِي جَمِيعِ أَحْوَالِي بِمَا تُحِبُّ وَتَرْضَى يا رَبِّ إِنِّي ضَعِيفٌ عَلَى النَّارِ فَلا تُعَذِّبْنِي بِالنَّارِ يَا رَبِّ ارْحَمْ دُعَائِي وَتَضَرُّعِي وَخَوْفِي وَذُلِّي وَمَسْكَنَتِي وَتَعْوِيذِي وَتَلْوِيذِي يَا رَبِّ إِنِّي ضَعِيفٌ عَنْ طَلَبِ الدُّنْيَا وَأَنْتَ واسِعٌ كَرِيمٌ أَسْأَلُكُ يَا رَبِّ بِقُوَّتِكَ عَلَى ذَلِكَ وَقُدْرَتِكَ عَلَيْهِ وَغِنَاكَ عَنْهُ وَحَاجَتي إِلَيْهِ أَنْ تَرْزُقَنِي فِي عَامِي هَذَا وَشَهْرِي هَذَا وَيَوْمِي هَذَا وَسَاعَتِي هَذِهِ رِزْقاً تُغْنِينِي بِهِ عَنْ تَكَلُّفُ مَا فِي أَيْدِي النَّاسِ مِن رِّزْقِكَ الْحَلالِ الطَّيِّبِ أَيْ رَبِّ مِنْكَ أَطْلُبُ وَإِلَيْكَ أَرْغَبُ وَإِيَّاكَ أَرْجُو وَأَنْتَ أَهْلُ ذَلِكَ لا أَرْجُو غَيْرَكَ وَلا أَثِقُ إِلَّا بِكَ يَا أَرْحَمَ الرَّاحِمِينَ أَيْ رَبِّ ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي وَارْحَمْنِي وَعَافِنِي يَا سَامِعَ كُلِّ صَوْتٍ وَيَا جَامِعَ كُلِّ فَوْتٍ وَيَا بَارِئَ النُّفُوسِ بَعْدَ الْمَوْتِ يَا مَن لَّا تَغْشَاهُ الظُّلُمَاتُ وَلا تَشْتَبِهُ عَلَيْهِ الأَصْوَاتُ وَلا يَشْغَلُهُ شَيْءٌ عَنْ شَيْءٍ أَعْطِ مُحَمَّداً صَلَّى اللهُ عَلَيْهِ وَآلِهِ أَفْضَلَ مَا سَأَلَكَ وَأَفْضَلَ مَا سُئِلْتَ لَهُ وَأَفْضَلَ مَا أَنْتَ مَسْؤُولٌ لَّهُ إِلَى يَوْمِ الْقِيَامَةِ وَهَبْ لِيَ الْعَافِيَةَ حَتَّى تُهَنِّئَنِي الْمَعِيشَةَ وَاخْتِمْ لِي بِخَيْرٍ حَتَّى لا تَضُرَّنِيِ الذُّنُوبُ اَللَّهُمَّ رَضِّنِي بِمَا قَسَمْتَ لِي حَتَّى لا أَسْأَلَ أَحَداً شَيْئاً اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَافْتَحْ لِي خَزائِنَ رَحْمَتِكَ وَارْحَمْنِي رَحْمَةً لا تُعَذِّبُنِي بَعْدَهَا أَبَداً فِي الدُّنْيَا وَالْآخِرَةِ وَارْزُقْنِي مِنْ فَضْلِكَ الْوَاسِعِ رِزْقاً حَلالاً طَيِّباً لا تُفْقِرُنِي إِلَى أَحَدٍ بَعْدَهُ سِوَاكَ تَزِيدُنِي بِذَلِكَ شُكْراً وَإِلَيْكَ فَاقَةً وَفَقْراً وَبِكَ عَمَّنْ سِوَاكَ غِنًى وَتَعَفُّفاً يَا مُحْسِنُ يَا مُجْمِلُ يَا مُنْعِمُ يَا مُفْضِلُ يَا مَلِيكُ يَا مُقْتَدِرُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاكْفِنِي الْمُهِمَّ كُلَّهُ وَاقْضِ لِي بِالْحُسْنَى وَبَارِكْ لِي فِي جَمِيعِ أُمُورِي وَاقْضِ لِي جَمِيعَ حَوَائِجِي اَللَّهُمَّ يَسِّرْ لِي مَا أَخَافُ تَعْسِيرَهُ فَإِنَّ تَيْسِيرَ مَا أَخَافُ تَعْسِيرَهُ عَلَيْكَ سَهْلٌ يَسِيرٌ وَسَهِّل لِّي مَا أَخَافُ حُزُونَتَهُ وَنَفِّسْ عَنِّي مَا أَخَافُ ضِيقَهُ وَكُفَّ عَنِّي مَا أَخَافُ هَمَّهُ وَاصْرِفْ عَنِّي مَا أَخَافُ بَلِيَّتَهُ يَا أَرْحَمَ الرَّاحِمِينَ اَللَّهُمَّ امْلَاْْ قَلْبِي حُبًّا لَّكَ وخَشْيَةً مِّنْكَ وَتَصْدِيقاً لَّكَ وَإيمَاناً بِكَ وفَرَقاً مِّنْكَ وَشَوْقاً إِلَيْكَ يَا ذَا الْجَلالِ وَالإِكْرَامِ اَللَّهُمَّ إِنَّ لَكَ حُقُوقاً فَتَصَدَّقْ بِهَا عَلَيَّ وَلِلنَّاسِ قِبَلِي تَبِعَاتٌ فَتَحَمَّلْهَا عَنِّي وَقَدْ أَوْجَبْتَ لِكُلِّ ضَيْفٍ قِرًى وَأَنَا ضَيْفُكَ فَاجْعَلْ قِرَايَ اللَّيْلَةَ الْجَنَّةَ يَا وَهَّابَ الْجَنَّةِ يَا وَهَّابَ الْمَغْفِرَةِ وَلا حَوْلَ وَلا قُوَّةَ إِلَّا بِكَ''',
    ),
    Dua(
      title: 'دعاء السمات',
      benefits: 'المعروف بدعاء الشبور، يُستحب قراءته في آخر ساعة من نهار يوم الجمعة',
      text: '''بسم الله الرحمن الرحيم

اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الْعَظِيمِ الأَعْظَمِ الأَعَزِّ الأَجَلِّ الأَكْرَمِ الَّذِي إِذَا دُعِيتَ بِهِ عَلَى مَغالِقِ أَبْوابِ السَّمَاءِ لِلْفَتْحِ بِالرَّحْمَةِ انْفَتَحَتْ وَإِذَا دُعِيتَ بِهِ عَلَى مَضَائِقِ أَبْوَابِ الأَرْضِ لِلْفَرَجِ انْفَرَجَتْ وَإِذَا دُعِيتَ بِهِ عَلَى الْعُسْرِ لِلْيُسْرِ تَيَسَّرَتْ وَإِذَا دُعِيْتَ بِهِ عَلَى الأَمْواتِ لِلْنُّشُورِ انْتَشَرَتْ وَإِذَا دُعِيْتَ بِهِ عَلَى كَشْفِ الْبَأْسَاءِ وَالضَّرَّاءِ انْكَشَفَتْ وَبِجَلالِ وَجْهِكَ الْكَرِيمِ أَكْرَمِ الْوُجُوهِ وَأَعَزِّ الْوُجُوهِ الَّذِي عَنَتْ لَهُ الْوُجُوهِ وَخَضَعَتْ لَهُ الرِّقابُ وَخَشَعَتْ لَهُ الأَصْوَاتُ وَوَجِلَتْ لَهُ الْقُلُوبُ مِنْ مَخَافَتِكَ وَبِقُوَّتِكَ الَّتِي بِهَا تُمْسِكُ السَّمَاءَ أَنْ تَقَعَ عَلَى الأَرْضِ إِلَّا بِإِذْنِكَ وَتُمْسِكُ السَّمَاواتِ وَالأَرْضَ أَنْ تَزُولا وَبِمَشِيَّتِكَ الَّتِي دَانَ لَهَا العَالَمُونَ وَبِكَلِمَتِكَ الَّتِي خَلَقْتَ بِهَا السَّمَاوَاتِ وَالأَرْضَ وَبِحِكْمَتِكَ الَّتِي صَنَعْتَ بِهَا الْعَجائِبَ وَخَلَقْتَ بِهَا الظُّلْمَةَ وَجَعَلْتَها لَيْلاً وَجَعَلْتَ اللَّيْلَ سَكَناً وَخَلَقْتَ بِهَا النُّورَ وَجَعَلْتَهُ نَهَاراً وَجَعَلْتَ النَّهَارَ نُشُوراً مُبْصِراً وَخَلَقْتَ بِهَا الشَّمْسَ وَجَعَلْتَ الشَّمْسَ ضِياءً وَخَلَقْتَ بِهَا الْقَمَرَ وَجَعَلْتَ الْقَمَرَ نُوراً وَخَلَقْتَ بِهَا الْكَواكِبَ وَجَعَلْتَهَا نُجُوماً وَبُرُوجاً وَمَصَابِيحَ وَزِينَةً وَرُجُوماً وَجَعَلْتَ لَهَا مَشَارِقَ وَمَغَارِبَ وَجَعَلْتَ لَهَا مَطَالِعَ وَمَجَارِيَ وَجَعَلْتَ لَهَا فَلَكاً وَمَسَابِحَ وَقَدَّرْتَهَا فِي السَّمَاءِ مَنَازِلَ فَأَحْسَنْتَ تَقْدِيرَهَا وَصَوَّرْتَهَا فَأَحْسَنْتَ تَصْوِيرَهَا وَأَحْصَيْتَهَا بِأَسْمائِكَ إِحْصَاءً وَدَبَّرْتَهَا بِحِكْمَتِكَ تَدْبِيرَاً وَأَحْسَنْتَ تَدْبِيرَهَا وَسَخَّرْتَهَا بِسُلْطَانِ اللَّيْلِ وَسُلْطَانِ النَّهَارِ وَالسَّاعَاتِ وَعَدَدِ السِّنِينَ وَالحِسَابِ وَجَعَلْتَ رُؤْيَتَهَا لِجَمِيعِ النّاسِ مَرْأًى وَاحِداً وَأَسْأَلُكَ اَللَّهُمَّ بِمَجْدِكَ الَّذِي كَلَّمْتَ بِهِ عَبْدَكَ وَرَسُولَكَ مُوسَى بْنَ عِمْرَانَ عَلَيْهِ السَّلامُ فِي المُقَدَّسِينَ فَوْقَ إِحْسَاسِ الكَرُّوبِيِّينَ فَوْقَ غَمَائِمِ النُّورِ فَوْقَ تابُوتِ الشَّهَادَةِ فِي عَمُودِ النَّارِ وَفِي طُورِ سَيْناءَ وَفِي جَبَلِ حُورِيثَ فِي الْوَادِي الْمُقَدَّسِ فِي الْبُقْعَةِ الْمُبَارَكَةِ مِنْ جَانِبِ الطُّورِ الأَيْمَنِ مِنَ الشَّجَرَةِ وَفِي أَرْضِ مِصْرَ بِتِسْعِ آيَاتٍ بَيِّنَاتٍ وَيَوْمَ فَرَقْتَ لِبَنِي إِسْرَائِيلَ الْبَحْرَ وَفِي الْمُنْبَجِسَاتِ الَّتِي صَنَعْتَ بِهَا الْعَجائِبَ فِي بَحْرِ سُوفٍ وَعَقَدْتَ ماءَ الْبَحْرِ فِي قَلْبِ الْغَمْرِ كَالْحِجارَةِ وَجَاوَزْتَ بِبَنِي إِسْرائِيلَ الْبَحْرَ وَتَمَّتْ كَلِمَتُكَ الْحُسْنَى عَلَيْهِمْ بِمَا صَبَرُوا وَأَوْرَثْتَهُمْ مَشَارِقَ الأَرْضِ وَمَغارِبَهَا الَّتِي بَارَكْتَ فِيهَا لِلْعَالَمِينَ وَأَغْرَقْتَ فِرْعَوْنَ وَجُنُودَهُ وَمَراكِبَهُ فِي الْيَمِّ وَبِاسْمِكَ الْعَظِيمِ الأَعْظَمِ الأَعَزِّ الأَجَلِّ الأَكْرَمِ وَبِمَجْدِكَ الَّذِي تَجَلَّيْتَ بِهِ لِمُوسَى كَلِيمِكَ عَلَيْهِ السَّلامُ فِي طُورِ سَيْناءَ وَلإِبْرَاهِيمَ عَلَيْهِ السَّلامُ خَلِيلِكَ مِنْ قَبْلُ فِي مَسْجِدِ الْخَيْفِ وَلإِسْحَاقَ صَفِيِّكَ عَلَيْهِ السَّلامُ فِي بِئْرِ شِيْعٍ وَلِيَعْقُوبَ نَبِيِّكَ عَلَيْهِ السَّلامُ فِي بَيْتِ إِيْلٍ وَأَوْفَيْتَ لإِبْراهِيمَ عَلَيْهِ السَّلامُ بِمِيثَاقِكَ وَلإِسْحَاقَ بِحِلْفِكَ وَلِيَعْقُوبَ بِشَهَادَتِكَ وَلِلْمُؤْمِنِينَ بِوَعْدِكَ وَلِلدَّاعِينَ بِأَسْمَائِكَ فَأَجَبْتَ وَبِمَجْدِكَ الَّذِي ظَهَرَ لِمُوسَى بْنِ عِمْرانَ عَلَيْهِ السَّلامُ عَلَى قُبَّةِ الرُّمَّانِ وَبِآيَاتِكَ الَّتِي وَقَعَتْ عَلَى أَرْضِ مِصْرَ بِمَجْدِ الْعِزَّةِ وَالْغَلَبَةِ بِآيَاتٍ عَزِيزَةٍ وَبِسُلْطَانِ الْقُوَّةِ وَبِعِزَّةِ الْقُدْرَةِ وَبِشَأْنِ الْكَلِمَةِ التَّامَّةِ وَبِكَلِمَاتِكَ الَّتِي تَفَضَّلْتَ بِهَا عَلَى أَهْلِ السَّمَاوَاتِ وَالأَرْضِ وَأَهْلِ الدُّنْيا وَأَهْلِ الآخِرَةِ وَبِرَحْمَتِكَ الَّتِي مَنَنْتَ بِهَا عَلَى جَمِيعِ خَلْقِكَ وَبِاسْتِطَاعَتِكَ الَّتِي أَقَمْتَ بِها عَلَى الْعَالَمِينَ وَبِنُورِكَ الَّذِي قَدْ خَرَّ مِنْ فَزَعِهِ طُورُ سَيْنَاءَ وَبِعِلْمِكَ وَجَلالِكَ وَكِبْرِيَائِكَ وَعِزَّتِكَ وَجَبَرُوتِكَ الَّتِي لَمْ تَسْتَقِلَّهَا الأَرْضُ وَانْخَفَضَتْ لَهَا السَّمَاواتُ وَانْزَجَرَ لَهَا الْعُمْقُ الأَكْبَرُ وَرَكَدَتْ لَهَا الْبِحَارُ وَالأَنْهَارُ وَخَضَعَتْ لَهَا الْجِبَالُ وَسَكَنَتْ لَهَا الأَرْضُ بِمَناكِبِها وَاسْتَسْلَمَتْ لَهَا الْخَلائِقُ كُلُّهَا وَخَفَقَتْ لَهَا الرِّيَاحُ فِي جَرَيَانِها وَخَمَدَتْ لَهَا النِّيرَانُ فِي أَوْطَانِهَا وَبِسُلْطَانِكَ الَّذِي عُرِفَتْ لَكَ بِهِ الْغَلَبَةُ دَهْرَ الدُّهُورِ وَحُمِدْتَ بِهِ فِي السَّماوَاتِ وَالأَرْضِ وَبِكَلِمَتِكَ كَلِمَةِ الصِّدْقِ الَّتِي سَبَقَتْ لأَبِينَا آدَمَ عَلَيْهِ السَّلامُ وَذُرِّيَّتِهِ بِالرَّحْمَةِ وَأَسْأَلُكَ بِكَلِمَتِكَ الَّتِي غَلَبَتْ كُلَّ شَيْءٍ وَبِنُورِ وَجْهِكَ الَّذِي تَجَلَّيْتَ بِهِ لِلْجَبَلِ فَجَعَلْتَهُ دَكّاً وَخَرَّ مُوسَى صَعِقاً وَبِمَجْدِكَ الَّذِي ظَهَرَ عَلَى طُورِ سَيْناءَ فَكَلَّمْتَ بِهِ عَبْدَكَ وَرَسُولَكَ مُوسَى بْنَ عِمْرَانَ وَبِطَلْعَتِكَ فِي سَاعِيْرَ وَظُهُورِكَ فِي جَبَلِ فَارَانَ بِرَبَوَاتِ المُقَدَّسِيْنَ وَجُنُودِ الْمَلائِكَةِ الصَّافِّينَ وَخُشُوعِ المَلائِكَةِ المُسَبِّحِينَ وَبِبَرَكَاتِكَ الَّتِي بارَكْتَ فِيهَا عَلَى إِبْراهِيمَ خَلِيلِكَ عَلَيْهِ السَّلامُ فِي أُمَّةِ مُحَمَّدٍ صَلّى اللهُ عَلَيْهِ وَآلِهِ وَبارَكْتَ لإِسْحاقَ صَفِيِّكَ فِي أُمَّةِ عِيْسَى عَلَيْهِمَا السَّلامُ وَبَارَكْتَ لِيَعْقُوبَ إِسْرائِيلِكَ فِي أُمَّةِ مُوسَى عَلَيْهِمَا السَّلامُ وَبارَكْتَ لِحَبِيبِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فِي عِتْرَتِهِ وَذُرِّيَّتِهِ وَأُمَّتِهِ اَللَّهُمَّ وَكَمَا غِبْنَا عَنْ ذلِكَ وَلَمْ نَشْهَدْهُ وَآمَنَّا بِهِ وَلَمْ نَرَهُ صِدْقاً وَعَدْلاً أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَنْ تُبَارِكَ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَتَرَحَّمَ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَأَفْضَلِ مَا صَلَّيْتَ وَبَارَكْتَ وَتَرَحَّمْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ فَعّالٌ لِمَا تُرِيدُ وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ثم تذكر حاجتك وتقول اَللَّهُمَّ بِحَقِّ هذا الدُّعاءِ وَبِحَقِّ هذِهِ الأَسْمَاءِ الَّتِي لا يَعْلَمُ تَفْسِيرَهَا وَلا يَعْلَمُ باطِنَهَا غَيْرُكَ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَافْعَلْ بِي مَا أَنْتَ أَهْلُهُ وَلا تَفْعَلْ بِي ما أَنَا أَهْلُهُ وَاغْفِرْ لِي مِنْ ذُنُوبِي مَا تَقَدَّمَ مِنْها وَمَا تَأَخَّرَ وَوَسِّعْ عَلَيَّ مِنْ حَلالِ رِزْقِكَ وَاكْفِيَنِي مَؤُونَةَ إِنْسَانِ سَوْءٍ وَجَارِ سَوْءٍ وَقَرِينِ سَوْءٍ وَسُلْطَانِ سَوْءٍ إِنَّكَ عَلَى مَا تَشَاءُ قَدِيرٌ وَبِكُلِّ شَيْءٍ عَلِيمٌ آمِينَ رَبَّ الْعَالَمِينَ''',
    ),
    Dua(
      title: 'دعاء المجير',
      benefits: 'دعاء رفيع الشأن مروي عن النبي (ص) نزل به جبرائيل (ع)، يُستحب قراءته في الأيام البيض من شهر رمضان',
      text: '''بسم الله الرحمن الرحيم

سُبْحَانَكَ يَا أَللهُ تَعالَيْتَ يَا رَحْمَنُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحانَكَ يَا رَحِيمُ تَعالَيْتَ يَا كَرِيمُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مَلِكُ تَعالَيْتَ يَا مَالِكُ أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا قُدُّوسُ تَعالَيْتَ يَا سَلامُ أَجِرْنا مِنَ النّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُؤْمِنُ تَعالَيْتَ يَا مُهَيْمِنُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحانَكَ يَا عَزِيزُ تَعالَيْتَ يَا جَبَّارُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُتَكَبِّرُ تَعَالَيْتَ يَا مُتَجَبِّرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا خَالِقُ تَعالَيْتَ يَا بَارِئُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُصَوِّرُ تَعالَيْتَ يَا مُقَدِّرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا هَادِي تَعَالَيْتَ يَا بَاقِي أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا وَهَّابُ تَعالَيْتَ يَا تَوَّابُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحانَكَ يَا فَتّاحُ تَعَالَيْتَ يَا مُرْتَاحُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا سَيِّدِي تَعَالَيْتَ يَا مَوْلايَ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا قَرِيبُ تَعَالَيْتَ يَا رَقِيبُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُبْدِئُ تَعَالَيْتَ يَا مُعِيدُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا حَمِيدُ تَعَالَيْتَ يَا مَجِيدُ أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا قَدِيمُ تَعَالَيْتَ يَا عَظِيمُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا غَفُورُ تَعَالَيْتَ يَا شَكُورُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا شَاهِدُ تَعَالَيْتَ يَا شَهِيدُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحانَكَ يَا حَنَّانُ تَعَالَيْتَ يَا مَنّانُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا بَاعِثُ تَعَالَيْتَ يَا وَارِثُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُحْيِي تَعالَيْتَ يَا مُمِيتُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا شَفِيقُ تَعَالَيْتَ يَا رَفِيقُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا أَنِيسُ تَعَالَيْتَ يَا مُؤْنِسُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا جَلِيلُ تَعالَيْتَ يَا جَمِيلُ أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا خَبِيرُ تَعَالَيْتَ يَا بَصِيرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا حَفِيُّ تَعَالَيْتَ يَا مَلِيُّ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مَعْبُودُ تَعَالَيْتَ يَا مَوْجُودُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا غَفَّارُ تَعَالَيْتَ يَا قَهَّارُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مَذْكُورُ تَعَالَيْتَ يَا مَشْكُورُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا جَوَادُ تَعَالَيْتَ يَا مَعَاذُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا جَمَالُ تَعالَيْتَ يَا جَلالُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا سَابِقُ تَعَالَيْتَ يَا رَازِقُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا صَادِقُ تَعالَيْتَ يَا فَالِقُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا سَمِيعُ تَعَالَيْتَ يَا سَرِيعُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا رَفِيعُ تَعَالَيْتَ يَا بَدِيعُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا فَعَّالُ تَعَالَيْتَ يَا مُتَعَالُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا قَاضِي تَعَالَيْتَ يَا رَاضِي أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا قَاهِرُ تَعَالَيْتَ يَا طَاهِرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا عَالِمُ تَعَالَيْتَ يَا حَاكِمُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا دَائِمُ تَعَالَيْتَ يَا قَائِمُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا عَاصِمُ تَعَالَيْتَ يَا قَاسِمُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا غَنِيُّ تَعَالَيْتَ يَا مُغْنِي أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا وَفِيُّ تَعَالَيْتَ يَا قَوِيُّ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا كَافِي تَعَالَيْتَ يَا شَافِي أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُقَدِّمُ تَعَالَيْتَ يَا مُؤَخِّرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحانَكَ يَا أَوَّلُ تَعَالَيْتَ يَا آخِرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا ظَاهِرُ تَعَالَيْتَ يَا بَاطِنُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا رَجاءُ تَعَالَيْتَ يَا مُرْتَجَى أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا ذَا الْمَنِّ تَعالَيْتَ يَا ذَا الطَّوْلِ أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا حَيُّ تَعَالَيْتَ يَا قَيُّومُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا واحِدُ تَعَالَيْتَ يَا أَحَدُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا سَيِّدُ تَعَالَيْتَ يَا صَمَدُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا قَدِيرُ تَعَالَيْتَ يَا كَبِيرُ أَجِرْنا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا وَالِي تَعَالَيْتَ يَا عَالِي أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا عَلِيُّ تَعَالَيْتَ يَا أَعْلَى أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا وَلِيُّ تَعَالَيْتَ يَا مَوْلَى أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا ذَارِئُ تَعَالَيْتَ يَا بَارِئُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا خَافِضُ تَعَالَيْتَ يَا رَافِعُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُقْسِطُ تَعَالَيْتَ يَا جَامِعُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُعِزُّ تَعَالَيْتَ يَا مُذِلُّ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا قَادِرُ تَعَالَيْتَ يَا مُقْتَدِرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا عَلِيمُ تَعَالَيْتَ يَا حَلِيمُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُعْطِي تَعَالَيْتَ يَا مَانِعُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا ضَارُّ تَعَالَيْتَ يَا نَافِعُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُجِيبُ تَعَالَيْتَ يَا حَسِيبُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا عَادِلُ تَعَالَيْتَ يَا فَاصِلُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا لَطِيفُ تَعالَيْتَ يَا شَرِيفُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحانَكَ يَا رَبُّ تَعَالَيْتَ يَا حَقُّ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مَاجِدُ تَعَالَيْتَ يَا وَاحِدُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا عَفُوُّ تَعَالَيْتَ يَا مُنْتَقِمُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا واسِعُ تَعَالَيْتَ يَا مُوَسِّعُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا رَؤُوفُ تَعَالَيْتَ يَا عَطُوفُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا فَرْدُ تَعَالَيْتَ يَا وِتْرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُقِيتُ تَعَالَيْتَ يَا مُحِيطُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا وَكِيلُ تَعَالَيْتَ يَا عَدْلُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُبِينُ تَعَالَيْتَ يَا مَتِينُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا بَرُّ تَعَالَيْتَ يَا وَدُودُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا رَشِيدُ تَعَالَيْتَ يَا مُرْشِدُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا نُورُ تَعَالَيْتَ يَا مُنَوِّرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا نَصِيرُ تَعَالَيْتَ يَا نَاصِرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا صَبُورُ تَعَالَيْتَ يَا صَابِرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُحْصِي تَعَالَيْتَ يَا مُنْشِئُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا سُبْحَانُ تَعَالَيْتَ يَا دَيَّانُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا مُغِيثُ تَعَالَيْتَ يَا غِيَاثُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا فَاطِرُ تَعالَيْتَ يَا حَاضِرُ أَجِرْنَا مِنَ النَّارِ يَا مُجِيرُ سُبْحَانَكَ يَا ذَا الْعِزِّ وَالْجَمَالِ تَبَارَكْتَ يَا ذَا الْجَبَرُوتِ وَالْجَلالِ سُبْحَانَكَ لا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظّالِمِينَ فَاسْتَجَبْنَا لَهُ وَنَجَّيْنَاهُ مِنَ الْغَمِّ وَكَذلِكَ نُنْجِي الْمُؤْمِنِين وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَآلِهِ أَجْمَعِينَ وَالْحَمْدُ للهِ رَبِّ الْعَالَمِينَ وَحَسْبُنا اللهُ وَنِعْمَ الْوَكِيلُ وَلا حَوْلَ وَلا قُوَّةَ إِلَّا بِاللهِ العَلِيِّ العَظِيمِ''',
    ),
    Dua(
      title: 'دعاء الجوشن الصغير',
      benefits: 'دعاء جليل القدر مروي عن الإمام الكاظم (ع) لدفع كيد الأعداء والظالمين',
      text: '''بسم الله الرحمن الرحيم

إِلَهِي كَم مِّنْ عَدُوٍّ انْتَضَى عَلَيَّ سَيْفَ عَدَاوَتِهِ وَشَحَذَ لِي ظُبَةَ مُِدْيَتِهِ وَأَرْهَفَ لِي شَبَا حَدِّهِ وَدَافَ لِي قَوَاتِلَ سُمُومِهِ وَسَدَّدَ إِلَيَّ صَوائِبَ سِهامِهِ وَلَمْ تَنَمْ عَنِّي عَيْنُ حِرَاسَتِهِ وَأَضْمَرَ أَنْ يَسُومَنِيَ الْمَكْرُوهَ وَيُجَرِّعَنِي ذُعَافَ مَرَارَتِهِ فَنَظَرْتَ إِلَى ضَعْفِي عَنِ احْتِمَالِ الْفَوَادِحِ وعَجْزِي عَنِ الِانْتِصارِ مِمَّنْ قَصَدَنِي بِمُحَارَبَتِهِ وَوَحْدَتِي فِي كَثِيرٍ مِمَّنْ نَاوَانِي وَأَرْصَدَ لِي فِيما لَمْ أُعْمِلْ فِكْرِي فِي الإِرْصَادِ لَهُمْ بِمِثْلِهِ فَأَيَّدتَّنِي بِقُوَّتِكَ وَشَدَدتَّ أَزْرِي بِنُصْرَتِكَ وَفَلَلْتَ لِي حَدَّهُ وَخَذَلْتَهُ بَعْدَ جَمْعِ عَدِيدِهِ وَحَشْدِهِ وَأَعْلَيْتَ كَعْبِي عَلَيْهِ وَوَجَّهْتَ مَا سَدَّدَ إِلَيَّ مِنْ مَكَايدِهِ إِلَيْهِ وَرَدَدْتَهُ عَلَيْهِ وَلَمْ يَشْفِ غَلِيلَهُ وَلَمْ تَبْرُدْ حَزَازَاتُ غَيْظِهِ وَقَدْ عَضَّ عَلَى أَنَامِلِهِ وَأَدْبَرَ مُوَلِّياً قَدْ أَخْفَقَتْ سَرَايَاهُ فَلَكَ الْحَمْدُ يا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَكَم مِّنْ بَاغٍ بَغَانِي بِمَكَايدِهِ وَنَصَبَ لِي أَشْرَاكَ مَصايدِهِ وَوَكَّلَ بِي تَفَقُّدَ رِعايَتِهِ وَأضْبَأَ إِلَيَّ إِضْبَاءَ السَّبُعِ لِطَرِيدَتِهِ انْتِظَاراً لانْتِهَازِ فُرْصَتِهِ وَهُوَ يُظْهِرُ بَشَاشَةَ الْمَلَقِ وَيَبْسُطُ وَجْهاً غَيْرَ طَلِقٍ فَلَمّا رَأَيْتَ دَغَلَ سَرِيرَتِهِ وَقُبْحَ مَا انْطَوى عَلَيْهِ لِشَرِيكِهِ فِي مِلَّتِهِ وأَصْبَحَ مُجْلِباً لِي فِي بَغْيِهِ أَرْكَسْتَهُ لأمِّ رَأْسِهِ وَأَتَيْتَ بُنْيَانَهُ مِنْ أَسَاسِهِ فَصَرَعْتَهُ فِي زُبْيَتِهِ وَرَدَّيْتَهُ فِي مَهْوَى حُفْرَتِهِ وَجَعَلْتَ خَدَّهُ طَبَقاً لِتُرابِ رِجْلِهِ وَشَغَلْتَهُ فِي بَدَنِهِ وَرِزْقِهِ وَرَمَيْتَهُ بِحَجَرِهِ وَخَنَقْتَهُ بِوَتَرِهِ وَذَكَّيْتَهُ بِمَشَاقِصِهِ وَكَبَبْتَهُ لِمَنْخِرِهِ وَرَدَدْتَ كَيْدَهُ فِي نَحْرِهِ وَرَبَقْتَهُ بِنَدامَتِهِ وَفَسَأْتَهُ بِحَسْرَتِهِ فَاسْتَخْذَأَ وَتَضَاءَلَ بَعْدَ نَخْوَتِهِ وانْقَمَعَ بَعْدَ اسْتِطَالَتِهِ ذَلِيلاً مَأْسُوراً فِي رِبْقِ حِبَالَتِهِ الَّتِي كانَ يُؤَمِّلُ أَنْ يَرَانِي فِيهَا يَوْمَ سَطْوَتِهِ وَقَدْ كِدْتُ يا رَبِّ لَوْلا رَحْمَتُكَ أَنْ يَحُلَّ بِي مَا حَلَّ بِسَاحَتِهِ فَلَكَ الْحَمْدُ يَا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَكَم مِّنْ حَاسِدٍ شَرِقَ بِحَسْرَتِهِ وَعَدُوٍّ شَجِيَ بِغَيْظِهِ وَسَلَقَنِي بِحَدِّ لِسَانِهِ وَوَخَزَنِي بِمُوقِ عَيْنِهِ وَجَعَلَنِي غَرَضاً لِمَرامِيهِ وَقَلَّدَنِي خِلالاً لَمْ تَزَلْ فِيهِ نادَيْتُكَ يا رَبِّ مُسْتَجِيراً بِكَ واثِقاً بِسُرْعَةِ إِجَابَتِكَ مُتَوَكِّلاً عَلى مَا لَمْ أَزَلْ أَتَعَرَّفُهُ مِنْ حُسْنِ دِفَاعِكَ عَالِماً أَنَّهُ لا يُضْطَهَدُ مَنْ أَوَى إِلَى ظِلِّ كَنَفِكَ وَلَنْ تَقْرَعَ الْحَوادِثُ مَنْ لَجَأَ إِلَى مَعْقِلِ الِانْتِصَارِ بِكَ فَحَصَّنْتَنِي مِنْ بَأْسِهِ بِقُدْرَتِكَ فَلَكَ الْحَمْدُ يا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَكَم مِّنْ سَحَائِبِ مَكْرُوهٍ جَلَّيْتَهَا وَسَمَاءِ نِعْمَةٍ مَطَرْتَهَا وَجَدَاوِلِ كَرَامَةٍ أَجْرَيْتَهَا وَأَعْيُنِ أَحْداثٍ طَمَسْتَهَا وَنَاشِئَةِ رَحْمَةٍ نَشَرْتَهَا وَجُنَّةِ عَافِيَةٍ أَلْبَسْتَهَا وَغَوامِرِ كُرُبَاتٍ كَشَفْتَهَا وَأُمُورٍ جَارِيَةٍ قَدَّرْتَهَا لَمْ تُعْجِزْكَ إِذْ طَلَبْتَهَا وَلَمْ تَمْتَنِعْ مِنْكَ إِذْ أَرَدتَّهَا فَلَكَ الْحَمْدُ يا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَكَم مِّنْ ظَنٍّ حَسَنٍ حَقَّقْتَ وَمِنْ كَسْرِ إِمْلاقٍ جَبَرْتَ وَمِنْ مَسْكَنَةٍ فَادِحَةٍ حَوَّلْتَ وَمِنْ صَرْعَةٍ مُهْلِكَةٍ نَعَشْتَ وَمِن مَّشَقَّةٍ أَرَحْتَ لا تُسْأَلُ عَمَّا تَفْعَلُ وَهُمْ يُسْأَلُونَ وَلا يَنْقُصُكَ مَا أَنْفَقْتَ وَلَقَدْ سُئِلْتَ فَأَعْطَيْتَ وَلَمْ تُسْأَلْ فَابْتَدَأْتَ وَاسْتُمِيحَ بَابُ فَضْلِكَ فَما أَكْدَيْتَ أَبَيْتَ إِلَّا إِنْعَاماً وَامْتِنَاناً وَإِلَّا تَطَوُّلاً يا رَبِّ وَإِحْسَاناً وَأَبَيْتُ إِلَّا انْتِهَاكاً لِحُرُمَاتِكَ وَاجْتِرَاءً عَلى مَعَاصِيكَ وَتَعَدِّياً لِحُدُودِكَ وَغَفْلَةً عَنْ وَعِيدِكَ وَطَاعَةً لِعَدُوِّي وَعَدُوِّكَ وَلَمْ يَمْنَعْكَ يَا إِلَهِي وَنَاصِرِي إِخْلالِي بِالشَّكْرِ عَنْ إِتْمَامِ إِحْسَانِكَ وَلا حَجَزَنِي ذَلِكَ عَنِ اِرْتِكَابِ مَسَاخِطِكَ اَللَّهُمَّ وَهَذا مَقَامُ عَبْدٍ ذَلِيلٍ اعْتَرَفَ لَكَ بِالتَّوْحِيدِ وَأَقَرَّ عَلَى نَفْسِهِ بِالتَّقْصِيرِ فِي أَدَاءِ حَقِّكَ وَشَهِدَ لَكَ بِسُبُوغِ نِعْمَتِكَ عَلَيْهِ وَجَمِيلِ عَادَتِكَ عِنْدَهُ وَإِحْسَانِكَ إِلَيْهِ فَهَبْ لِي يَا إِلَهِي وَسَيِّدِي مِنْ فَضْلِكَ مَا أُرِيدُهُ إِلَى رَحْمَتِكَ وَأَتَّخِذُهُ سُلَّماً أَعْرُجُ فِيهِ إِلَى مَرْضَاتِكَ وَآمَنُ بِهِ مِنْ سَخَطِكَ بِعِزَّتِكَ وَطَوْلِكَ وَبِحَقِّ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فَلَكَ الْحَمْدُ يا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَكَم مِّنْ عَبْدٍ أَمْسَى وَأَصْبَحَ فِي كَرْبِ الْمَوْتِ وَحَشْرَجَةِ الصَّدْرِ وَالنَّظَرِ إِلى ما تَقْشَعِرُّ مِنْهُ الْجُلُودُ وَتَفْزَعُ لَهُ الْقُلُوبُ وَأَنا فِي عَافِيَةٍ مِنْ ذَلِكَ كُلِّهِ فَلَكَ الْحَمْدُ يَا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَكَم مِّنْ عَبْدٍ أَمْسَى وَأَصْبَحَ سَقِيماً مُوجِعاً فِي أَنَّةٍ وَعَوِيلٍ يَتَقَلَّبُ فِي غَمِّهِ لا يَجِدُ مَحِيصاً وَلا يُسِيغُ طَعَاماً وَلا شَرَاباً وَأَنَا فِي صِحَّةٍ مِنَ الْبَدَنِ وَسَلامَةً مِنَ الْعَيْشِ كُلُّ ذَلِكَ مِنْكَ فَلَكَ الْحَمْدُ يَا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَكَم مِّنْ عَبْدٍ أَمْسَى وَأَصْبَحَ خائِفاً مَرْعُوباً مُشْفِقاً وَجِلاً هَارِباً طَرِيداً مُنْجَحِراً فِي مَضِيقٍ وَمَخْبَأَةٍ مِنَ الْمَخابِئِ قَدْ ضَاقَتْ عَلَيْهِ الأَرْضُ بِرُحْبِهَا لا يَجِدُ حِيلَةً وَلا مَنْجًى وَلا مَأْوًى وَأَنَا فِي أَمْنٍ وَطُمْأَنِينَةٍ وَعَافِيَةٍ مِنْ ذَلِكَ كُلِّهِ فَلَكَ الْحَمْدُ يا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَسَيِّدِي وَكَم مِّنْ عَبْدٍ أَمْسى وَأَصْبَحَ مَغْلُولاً مُكَبَّلاً فِي الْحَدِيدِ بَأَيْدِي الْعُداةِ لا يَرْحَمُونَهُ فَقِيداً مِنْ أَهْلِهِ وَوَلَدِهِ مُنْقَطِعاً عَنْ إخْوَانِهِ وَبَلَدِهِ يَتَوَقَّعُ كُلَّ ساعَةٍ بِأَيِّ قِتْلَةٍ يُقْتَلُ وَبِأَيِّ مُثْلَةٍ يُمَثَّلُ بِهِ وَأَنَا فِي عَافِيَةٍ مِنْ ذَلِكَ كُلِّهِ فَلَكَ الْحَمْدُ يَا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَناةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَكَمْ مِنْ عَبْدٍ أَمْسَى وَأَصْبَحَ يُقاسِي الْحَرْبَ وَمُبَاشَرَةَ الْقِتَالِ بِنَفْسِهِ قَدْ غَشِيَتْهُ الأَعْدَاءُ مِنْ كُلِّ جَانِبٍ بِالسُّيُوفِ وَالرِّمَاحِ وَآلَةِ الْحَرْبِ يَتَقَعْقَعُ فِي الْحَدِيدِ قَدْ بَلَغَ مَجْهُودَهُ لا يَعْرِفُ حِيلَةً وَلا يَجِدُ مَهْرَباً قَدْ أُدْنِفَ بِالْجِراحَاتِ أوْ مُتَشَحِّطاً بِدَمِهِ تَحْتَ السَّنَابِكِ وَالأَرْجُلِ يَتَمَنَّى شَرْبَةً مِنْ مَاءٍ أَوْ نَظْرَةً إِلَى أَهْلِهِ وَوَلَدِهِ لا يَقْدِرُ عَلَيْهَا وَأَنَا فِي عَافِيَةٍ مِنْ ذَلِكَ كُلِّهِ فَلَكَ الْحَمْدُ يَا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَكَمْ مِنْ عَبْدٍ أَمْسَى وَأَصْبَحَ فِي ظُلُمَاتِ الْبِحارِ وَعَوَاصِفِ الرِّيَاحِ وَالأَهْوَالِ وَالأمْوَاجِ يَتَوَقَّعُ الْغَرَقَ وَالْهَلاكَ لا يَقْدِرُ عَلَى حِيلَةٍ أَوْ مُبْتَلًى بِصَاعِقَةٍ أَوْ هَدْمٍ أَوْ حَرْقٍ أَوْ شَرْقٍ أَوْ خَسْفٍ أَوْ مَسْخٍ أَوْ قَذْفٍ وَأَنَا فِي عَافِيَةٍ مِنْ ذَلِكَ كُلِّهِ فَلَكَ الْحَمْدُ يا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلهِي وَكَم مِّنْ عَبْدٍ أَمْسَى وَأَصْبَحَ مُسافِراً شَاخِصاً عَنْ أَهْلِهِ وَوَلَدِهِ مُتَحَيِّراً فِي الْمَفَاوِزِ تَائِهاً مَعَ الْوُحُوشِ وَالْبَهَائِمِ وَالْهَوامِّ وَحِيداً فَرِيداً لا يَعْرِفُ حِيْلَةً وَلا يَهْتَدِي سَبِيلاً أَوْ مُتَأَذِّياً بِبَرْدٍ أَوْ حَرٍّ أَوْ جُوعٍ أَوْ عُرْيٍ أَوْ غَيْرِهِ مِنَ الشَّدائِدِ مِمَّا أَنَا مِنْهُ خِلْوٌ فِي عَافِيَةٍ مِنْ ذَلِكَ كُلِّهِ فَلَكَ الْحَمْدُ يَا رَبِّ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلهِي وَسَيِّدِي وَكَم مِّنْ عَبْدٍ أَمْسى وَأَصْبَحَ فَقِيراً عَائِلاً عَارِياً مُمْلِقاً مُخْفِقاً مَهْجُوراً جَائِعاً ظَمْآنَ يَنْتَظِرُ مَنْ يَعُودُ عَلَيْهِ بِفَضْلٍ أَوْ عَبْدٍ وَجِيهٍ عِنْدَكَ هُوَ أَوْجَهُ مِنِّي عِنْدَكَ وَأَشَدُّ عِبَادَةً لَكَ مَغْلُولاً مَقْهُوراً قَدْ حُمِّلَ ثِقْلاً مِنْ تَعَبِ الْعَناءِ وَشِدَّةِ الْعُبُودِيَّةِ وَكُلْفَةِ الرِّقِّ وَثِقْلِ الضَّرِيبَةِ أَوْ مُبْتَلًى بِبَلاءٍ شَدِيدٍ لا قِبَلَ لَهُ إِلَّا بِمَنِّكَ عَلَيْهِ وَأَنَا المَخْدُومُ المُنَعَّمُ الْمُعَافَى الْمُكَرَّمُ فِي عَافِيَةٍ مِمَّا هُوَ فِيهِ فَلَكَ الْحَمْدُ عَلَى ذَلِكَ كُلِّهِ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ إِلَهِي وَسَيّدِي وَكَم مِّنْ عَبْدٍ أَمْسَى وَأَصْبَحَ عَلِيلاً مَرِيضاً سَقِيماً مُدْنَفاً عَلَى فُرُشِ الْعِلَّةِ وَفِي لِبَاسِهَا يَتَقَلَّبُ يَمِيناً وَشِمالاً لا يَعْرِفُ شَيْئاً مِنْ لَذَّةِ الطَّعَامِ وَلا مِنْ لَذَّةِ الشَّرَابِ يَنْظُرُ إِلَى نَفْسِهِ حَسْرَةً لا يَسْتَطِيعُ لَهَا ضَرّاً وَلا نَفْعاً وَأَنَا خِلْوٌ مِنْ ذلِكَ كُلِّهِ بِجُودِكَ وَكَرَمِكَ فَلا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لَكَ مِنَ الْعَابِدِينَ وَلِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ وَارْحَمْنِي بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ مَوْلايَ وَسَيِّدِي وَكَم مِّنْ عَبدٍ أَمْسَى وَأَصْبَحَ وَقَدْ دَنَا يَوْمُهُ مِنْ حَتْفِهِ وَأَحْدَقَ بِهِ مَلَكُ الْمَوْتِ فِي أَعْوَانِهِ يُعَالِجُ سَكَرَاتِ الْمَوْتِ وَحِيَاضَهُ تَدُورُ عَيْنَاهُ يَمِيناً وَشِمَالاً يَنْظُرُ إِلَى أَحِبَّائِهِ وَأَوِدَّائِهِ وَأَخِلَّائِهِ قَدْ مُنِعَ مِنَ الْكَلامِ وَحُجِبَ عَنِ الْخِطَابِ يَنْظُرُ إِلَى نَفْسِه حَسْرَةً لا يَسْتَطِيعُ لَهَا ضَرّاً وَلا نَفْعاً وَأَنَا خِلْوٌ مِنْ ذَلِكَ كُلِّهِ بِجُودِكَ وَكَرَمِكَ فَلا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ وَارْحَمْنِي بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ مَوْلايَ وَسَيِّدِي وَكَم مِّنْ عَبْدٍ أَمْسَى وَأَصْبَحَ فِي مَضايِقِ الْحُبُوسِ وَالسُّجُونِ وَكُرَبِهَا وَذُلِّها وَحَدِيدِهَا يَتَدَاوَلُهُ أَعْوَانُهَا وَزَبَانِيَتُهَا فَلا يَدْرِي أَيُّ حالٍ يُفْعَلُ بِهِ أَيُّ مُثْلَةٍ يُمَثَّلُ بِهِ فَهُوَ فِي ضُرٍّ مِنَ الْعَيْشِ وَضَنْكٍ مِنَ الْحَيَاةِ يَنْظُرُ إِلَى نَفْسِهِ حَسْرَةً لا يَسْتَطِيعُ لَهَا ضَرّاً وَلا نَفْعاً وَأَنَا خِلْوٌ مِنْ ذَلِكَ كُلِّهِ بِجُودِكَ وَكَرَمِكَ فَلا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لَكَ مِنَ الْعَابِدِينَ وَلِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ وَارْحَمْنِي بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ سَيِّدِي وَمَوْلايَ وَكَم مِّنْ عَبْدٍ أَمْسَى وَأَصْبَحَ قَدِ اسْتَمَرَّ عَلَيْهِ الْقَضَاءُ وَأَحْدَقَ بِهِ الْبَلاءُ وَفَارَقَ أَوِدَّاءَهُ وَأَحِبَّاءَهُ وَأَخِلّاءَهُ وَأَمْسَى أَسِيراً حَقِيراً ذَلِيلاً فِي أَيْدِي الْكُفَّارِ وَالأَعْدَاءِ يَتَدَاوَلُونَهُ يَمِيناً وَشِمَالاً قَدْ حُصِرَ فِي الْمَطامِيرِ وَثُقِّلَ بِالْحَدِيدِ لا يَرى شَيْئاً مِنْ ضِياءِ الدُّنْيَا وَلا مِنْ رَوْحِهَا يَنْظُرُ إِلَى نَفْسِهِ حَسْرَةً لا يَسْتَطِيعُ لَهَا ضَرّاً وَلا نَفْعاً وَأَنَا خِلْوٌ مِنْ ذَلِكَ كُلِّهِ بِجُودِكَ وَكَرَمِكَ فَلا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ مِن مُّقْتَدِرٍ لا يُغْلَبُ وَذِي أَنَاةٍ لا يَعْجَلُ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لَكَ مِنَ الْعَابِدِينَ وَلِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ وَارْحَمْنِي بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ وَعِزَّتِكَ يَا كَرِيمُ لأَطْلُبَنَّ مِمَّا لَدَيْكَ وَلأُلِحَّنَّ عَلَيْكَ وَلأَمُدَّنَّ يَدِي نَحْوَكَ مَعَ جُرْمِها إِلَيْكَ يَا رَبِّ فَبِمَنْ أَعُوذُ وَبِمَنْ أَلُوذُ لا أَحَدَ لِي إِلَّا أَنْتَ أَفَتَرُدُّنِي وَأَنْتَ مُعَوَّلِي وَعَلَيْكَ مُتَّكَلِي أَسْأَلُكَ بِاسْمِكَ الَّذِي وَضَعْتَهُ عَلَى السَّمَاءِ فاسْتَقَلَّتْ وَعَلَى الأَرْضِ فَاسْتَقَرَّتْ وَعَلَى الْجِبالِ فَرَسَتْ وَعَلَى اللَيْلِ فَأظْلَمَ وَعَلَى النَّهَارِ فَاسْتَنَارَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَنْ تَقْضِيَ لِي حَوَائِجِي كُلَّهَا وَتَغْفِرَ لِي ذُنُوبِي كُلَّهَا صَغِيرَهَا وَكَبِيرَهَا وَتُوَسِّعَ عَلَيَّ مِنَ الرِّزْقِ مَا تُبَلِّغُنِي بِهِ شَرَفَ الدُّنْيَا وَالآخِرَةِ يَا أَرْحَمَ الرَّاحِمِينَ مَوْلايَ بِكَ اسْتَعَنْتُ فَصَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَعِنِّي وَبِكَ اسْتَجَرْتُ فَأَجِرْنِي وَأَغْنِنِي بِطَاعَتِكَ عَنْ طَاعَةِ عِبَادِكَ وَبِمَسْأَلَتِكَ عَنْ مَسْأَلَةِ خَلْقِكَ وَانْقُلْنِي مِنْ ذُلِّ الْفَقْرِ إِلَى عِزِّ الْغِنَى وَمِنْ ذُلِّ الْمَعَاصِي إِلَى عِزِّ الطَّاعَةِ فَقَدْ فَضَّلْتَنِي عَلَى كَثِيرٍ مِنْ خَلْقِكَ جُوداً مِنْكَ وَكَرَماً لا بِاسْتِحْقاقٍ مِنِّي إِلَهِي فَلَكَ الْحَمْدُ عَلَى ذلِكَ كُلِّهِ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْنِي لِنَعْمَائِكَ مِنَ الشَّاكِرِينَ وَلآلائِكَ مِنَ الذَّاكِرِينَ ثم تسجد وتقول سَجَدَ وَجْهِي الذَّلِيلُ لِوَجْهِكَ الْعَزِيزِ الْجَلِيلِ سَجَدَ وَجْهِي الْبَالِي الْفَانِي لِوَجْهِكَ الدَّائِمِ الْبَاقِي سَجَدَ وَجْهِي الْفَقِيرُ لِوَجْهِكَ الْغَنِيِّ الْكَبِيرِ سَجَدَ وَجْهِي وَسَمْعِي وَبَصَرِي وَلَحْمِي وَدَمِي وَجِلْدِي وَعَظْمِي وَمَا أَقَلَّتِ الأَرْضُ مِنّي للهِ رَبِّ الْعَالَمِينَ اَللَّهُمَّ عُدْ عَلَى جَهْلِي بِحِلْمِكَ وَعَلَى فَقْرِي بِغِنَاكَ وَعَلَى ذُلِّي بِعِزِّكَ وَسُلْطَانِكَ وَعَلَى ضَعْفِي بِقُوَّتِكَ وَعَلَى خَوْفِي بِأَمْنِكَ وَعَلَى ذُنُوبِي وَخَطَايَايَ بِعَفْوِكَ وَرَحْمَتِكَ يَا رَحمَنُ يَا رَحِيمُ اَللَّهُمَّ إِنِّي أَدْرَأُ بِكَ فِي نَحْرِ فُلان بْنِ فُلان وَأَعُوذُ بِكَ مِنْ شَرِّهِ فَاكْفِنِيهِ بِما كَفَيْتَ بِهِ أَنْبِيَاءَكَ وَأَوْلِيَاءَكَ مِنْ خَلْقِكَ وَصَالِحِي عِبَادِكَ مِنْ فَرَاعِنَةِ خَلْقِكَ وَطُغَاةِ عُدَاتِكَ وَشَرِّ جَمِيعِ خَلْقِكَ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَحَسْبُنَا اللهُ وَنِعْمَ الْوَكِيلُ''',
    ),
    Dua(
      title: 'دعاء زيارة القبور',
      benefits: 'أدعية تقال عند زيارة المقابر والموتى لطلب الرحمة لهم',
      text: '''عن أمير المؤمنين (عليه السلام) تقول عند زيارة المقبرة اَلسَّلامُ عَلَى أَهْلِ لَا إِلَهَ إِلَّا اللهُ مِنْ أَهْلِ لَا إِلَهَ إِلَّا اللهُ يَا أَهْلَ لَا إِلَهَ إِلَّا اللهُ كَيْفَ وَجَدتُّمْ كَلِمَةَ لَا إِلَهَ إِلَّا اللهُ يَا لَا إِلَهَ إِلَّا اللهُ بِحَقِّ لَا إِلَهَ إِلَّا اللهُ اِغْفِرْ لِمَنْ قَالَ لَا إِلَهَ إلَّا اللهُ وَاحْشِرْنَا فِي زُمْرَةِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللهُ مُحَمَّدٌ رَسُولُ اللهِ عَلِيٌّ وَّلِيُّ اللهِ

رواية اخرى عن الإمام الصادق عليه السلام اَلسَّلامُ عَلَى أَهْلِ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ أَنْتُمْ لَنَا فَرَطٌ وَنَحْنُ إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ

روي عن الإمام الحسين (عليه السلام) أنه قال مَنْ دخل المقابر فقال اَللَّهُمَّ رَبَّ الْأَرْوَاحِ الْفَانِيَةِ وَالْأَجْسَادِ الْبَالِيَةِ وَالْعِظَامِ النَّخِرَةِ الَّتِي خَرَجَتْ مِنَ الدُّنْيَا وَهِيَ بِكَ مُؤْمِنَةٌ أدْخِلْ عَلَيْهَا مِنْكَ رَوْحاً وسَلاماً كَتَبَ اللهُ لَهُ مِن لَّدُنْ آدَمَ إلَى أنْ تَقُومَ السَّاعَةُ حَسَنَاتٍ

الرواية الثانية عن أبي عبد الله الصادق (عليه السلام) تدعو للموتى عند زيارة المقبرة وتقول اَللَّهُمَّ جَافِ الْأَرْضَ عَنْ جُنُوبِهِمْ وَلَقِّهِمْ مِنْكَ رِضْوَاناً وَأَسْكِنْ إِلَيْهِم مِّن رَّحْمَتِكَ مَا تَصِلُ بِهِ وَحْدَتَهُمْ وَتُؤْنِسُ بِهِ وَحْشَتَهُمْ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ

وأيضاً الدعاء لخصوص القبر الذي تزوره تستقبل القبلة وتضع يدك على القبر وتقول ما رُوي عن أبي جعفر الباقر (عليه السلام) اَللَّهُمَّ ارْحَمْ غُرْبَتَهُ وَصِلْ وَحْدَتَهُ وَآنِسْ وَحْشَتَهُ وآمِن رَّوْعَتَهُ وَأَسْكِنْ إِلَيْهِ مِن رَّحْمَتِكَ مَا يَسْتَغْنِي بِهَا عَن رَّحْمَةِ مَنْ سِوَاكَ وَألْحِقْهُ بِمَنْ كَانَ يَتَوَلَّاهُ''',
    ),
    Dua(
      title: 'دعاء حديث الكساء',
      benefits: 'حديث شريف ومبارك في فضل أهل البيت (ع) يُقرأ لنزول الرحمة وقضاء الحوائج',
      text: '''بسم الله الرحمن الرحيم

عَنْ جابر بْنِ عبد الله الأنصاريّ عن فاطمة الزّهراء عليها السلام بنت رسول الله صَلَّى اللهُ عَلَيْهِ وَآلِهِ قال سمعتُ فاطمةَ أنّها قالت دَخَلَ عَلَيَّ أَبِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فِي بَعْضِ الأَيَّامِ فَقَالَ السَّلامُ عَلَيْكِ يَا فَاطِمَةُ فَقُلْتُ وَعَلَيْكَ السَّلامُ فَقَالَ إِنِّي أجِدُ فِي بَدَنِي ضَعْفاً فَقُلْتُ لَهُ أُعِيْذُكَ بِاللهِ يَا أَبَتَاهُ مِنَ الضَّعْفِ فَقَالَ يَا فَاطِمَةُ ائتِينِي بِالْكِسَاءِ الْيَمَانِيِّ فَغَطِّينِي بِهِ فَأَتَيْتُهُ بِالْكِسَاءِ الْيَمَانِيِّ فَغَطَّيْتُهُ بِهِ وَصِرْتُ أَنْظُرُ إِلَيْهِ وَإِذَا وَجْهُهُ يَتَلأْلأُ وَكَأَنَّهُ الْبَدْرُ فِي لَيْلَةِ تَمَامِهِ وَكَمَالِهِ فَمَا كَانَتْ إِلَّا سَاعَةً وَإِذَا بِوَلَدِيَ الْحَسَنِ عليه السلام قَدْ أَقْبَلَ وَقَالَ السَّلامُ عَلَيْكِ يَا أُمَّاهُ فَقُلْتُ وَعَلَيْكَ السَّلامُ يَا قُرَّةَ عَيْنِي وَثَمَرَةَ فُؤَادِي فَقَالَ يَا أُمَّاهُ إِنِّي أَشَـُمُّ عِنْدَكِ رَائِحَةً طَيِّبَةً كَأَنَّهَا رَائِحَةُ جَدِّي رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فَقُلْتُ نَعَمْ يَا وَلَدِي إِنَّ جَدَّكَ تَحْتَ الْكِسَاءِ فَأَقْبَلَ الْحَسَنُ عَلَيهِ السلام نَحْوَ الْكِسَاءِ وَقَالَ اَلسَّلامُ عَلَيْكَ يَا جَدَّاهُ يَا رَسُولَ اللهِ أَتَأْذَنُ لِي أَنْ أَدْخُلَ مَعَكَ تَحْتَ الْكِسَاءِ فَقَالَ وَعَلَيْكَ السَّلامُ يَا وَلَدِي وَيَا صَاحِبَ حَوْضِي قَدْ أَذِنْتُ لَكَ فَدَخَلَ مَعَهُ تَحْتَ الْكِسَاءِ فَمَا كَانَتْ إِلَّا سَاعَةً وَإِذَا بِوَلَدِيَ الْحُسَيْنِ عَلَيْهِ السَّلامُ قَدْ أَقْبَلَ وَقَالَ السَّلامُ عَلَيْكِ يَا أُمَّاهُ فَقُلْتُ وَعَلَيْكَ السَّلامُ يَا وَلَديْ ويَا قُرَّةَ عَيْنِي وَثَمَرَةَ فُؤَادِي فَقَالَ لِي يَا أُمَّاهُ إِنِّي أَشَـُمُّ عِنْدَكِ رَائِحَةً طَيِّبَةً كَأَنَّهَا رَائِحَةُ جَدِّي رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فَقُلْتُ نَعَمْ إِنَّ جَدَّكَ وَأَخَاكَ تَحْتَ الْكِسَاءِ فَدَنَا الْحُسَيْنُ عَلَيْهِ السَّلامُ نَحْوَ الْكِسَاءِ وقَالَ السَّلامُ عَلَيْكَ يَا جَدَّاهُ السَّلامُ عَلَيْكَ يَا مَنِ اخْتَارَهُ اللهُ أَتَأْذَنُ لِي أَنْ أَكُونَ مَعَكُمَا تَحْتَ الْكِسَاءِ فَقَالَ وَعَلَيْكَ السَّلامُ يَا وَلَدِي وَيَا شَافِعَ أُمَّتِي قَدْ أَذِنْتُ لَكَ فَدَخَلَ مَعَهُمَا تَحْتَ الْكِسَاءِ فَأَقْبَلَ عِنْدَ ذَلِكَ أَبُو الْحَسَنِ عَلِيُّ بْنُ أَبِي طَالِبٍ وَقَالَ السَّلامُ عَلَيْكِ يَا بِنْتَ رَسُولِ اللهِ فَقُلْتُ وَعَلَيْكَ السَّلامُ يَا أَبَا الْحَسَنِ وَيَا أَمِيْرَ الْمُؤْمِنِينَ فَقَالَ يَا فَاطِمَةُ إِنِّي أَشَـُمُّ عِنْدَكِ رَائِحَةً طَيِّبَةً كَأَنَّهَا رَائِحَةُ أَخِي وَابْنِ عَمِّي رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فَقُلْتُ نَعَمْ هَا هُوَ مَعَ وَلَدَيْكَ تَحْتَ الْكِسَاءِ فَأَقْبَلَ عَلِيٌّ عَلَيْهِ السَّلامُ نَحْوَ الْكِسَاءِ وَقَالَ السَّلامُ عَلَيْكَ يَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ أَتَأْذَنُ لِي أَنْ أَكُونَ مَعَكُمْ تَحْتَ الْكِسَاءِ قَالَ لَهُ وَعَلَيْكَ السَّلامُ يَا أَخِي وَيَا وَصِيِّي وَخَلِيْفَتِي وَصَاحِبَ لِوَائِي قَدْ أَذِنْتُ لَكَ فَدَخَلَ عَلِيٌّ عَلَيْهِ السَّلامُ تَحْتَ الْكِسَاءِ ثُمَّ أَتَيْتُ نَحْوَ الْكِسَاءِ وَقُلْتُ اَلسَّلامُ عَلَيْكَ يَا أَبَتَاهُ يَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ أَتَأْذَنُ لِي أَنْ أَكُوْنَ مَعَكُمْ تَحْتَ الْكِسَاءِ قَالَ وَعَلَيْكِ السَّلامُ يَا ابْنَتِي وَيَا بِـَضْعَتِي قَدْ أَذِنْتُ لَكِ فَدَخَلْتُ تَحْتَ الكِسَاءِ فَلَمَّا اكْتَمَلْنَا جَمِيْعاً تَحْتَ الْكِسَاءِ أَخَذَ أَبِي رَسُولُ اللهِ صَلَّى اللهُ علَيْهِ وَآلِهِ بِطَرَفَيِ الْكِسَاءِ وَأَوْمَأَ بِيَدِهِ الْيُمْنَى إِلَى السَّمَاءِ وَقَالَ اَللَّهُمَّ إِنَّ هَؤُلاءِ أَهْلُ بَيْتِي وَخَاصَّتِي وَحَامَّتِي لَحْمُهُمْ لَحْمِي وَدَمُهُمْ دَمِي يُؤْلِمُنِي مَا يُؤْلِمُهُمْ ويَـُحْزُِنُنِي مَا يَـُحْزُِنُهُمْ أَنَا حَرْبٌ لِمَنْ حَارَبَهُمْ وَسِلْمٌ لِمَنْ سَالَمَهُمْ وَعَدُوٌّ لِمَنْ عَادَاهُمْ وَمُحِبٌّ لِّمَنْ أَحَبَّهُمْ إِنَّهُمْ مِنِّي وَأَنَا مِنْهُمْ فَاجْعَلْ صَلَوَاتُكَ وَبَرَكَاتِكَ وَرَحْمتَكَ وَغُفْرَانَكَ وَرِضْوَانَكَ عَلَيَّ وَعَلَيْهِمْ وَأَذْهِبْ عَنْهُمُ الرِّجْسَ وَطَهِّرْهُمْ تَطْهِيْراً فَقَالَ اللهُ عَزَّ وَجَلَّ يَا مَلائِكَتِي وَيَا سُكَّانَ سَماوَاتِي إِنِّي مَا خَلَقْتُ سَمَاءً مَبْنِيَّةً وَلَا أَرْضاً مَدْحِيَّةً وَلَا قَمَراً مُنِيْراً وَلَا شَمْساً مُضِيْئَةً وَلَا فَلَكَاً يَدُورُ وَلَا بَحْراً يَجْرِي وَلَا فُلْكاً يَسْرِي إِلَّا فِي مَحَبَّةِ هؤُلاءِ الْخَمْسَةِ الَّذِينَ هُمْ تَحْتَ الْكِسَاءِ فَقَالَ الأَمِيْنُ جِبْرَائِيْلُ يَا رَبِّ وَمَنْ تَحْتَ الْكِسَاءِ فَقَالَ عَزَّ وَجَلَّ هُمْ أَهْلُ بَيْتِ النُّبُوَّةِ وَمَعْدِنُ الرِّسَالَةِ هُمْ فَاطِمَةُ وَأَبُوهَا وَبَعْلُهَا وَبَنُوهَا فَقَالَ جُبْرَائِيْلُ يَا رَبّ أَتَأْذَنُ لِي أَنْ أَهْبِطَ إِلَى الأَرْضِ لأَكُونَ مَعَهُمْ سَادِساً فَقَالَ اللهُ نَعَمْ قَدْ أَذِنْتُ لَكَ فَهَبَطَ الأَمِيْنُ جِبْرَائِيْلُ وَقَالَ السَّلامُ عَلَيْكَ يَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِه الْعَلِيُّ الأَعْلَى يُقْرِئُكَ السَّلامَ وَيَخُصُّكَ بِالتَّحِيَّةِ وَالإِكْرَامِ وَيَقُولُ لَكَ وَعِزَّتِي وَجَلاَلِي إِنِّي مَا خَلَقْتُ سَمَاءً مَّبْنِيَّةً وَلَا أَرْضَاً مَدْحِيَّةً وَلَا قَمَراً مُّنِيْراً وَلَا شَمْساً مُّضِيْئَةً وَلَا فَلكاً يَدُورُ وَلَا بَحْراً يَّجْرِي وَلَا فُلْكَاً يَسْرِي إِلَّا لأَجْلِكُمْ وَقَدْ أَذِنَ لِي أَنْ أَدْخُلَ مَعَكُمْ فَهَلْ تَأْذَنُ لِي يَا رَسُولَ اللهِ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَعَلَيْكَ السَّلامُ يَا أَمِيْنَ وَحْيِ اللهِ إنَّهُ نَعَمْ قَدْ أَذِنْتُ لَكَ فَدَخَلَ جَبْرَائِيْلُ مَعَنَا تَحْتَ الْكِسَاءِ فَقَالَ لأَبِي إِنَّ اللهَ عَزَّ وَجَلَّ قَدْ أَوْحَى إِلَيْكُمْ وَيَقُولُ إِنَّمَا يُرِيْدُ اللهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيْراً فَقَالَ عَلِيٌّ لأَبِي يَا رَسُولَ اللهِ أَخْبِرْنِي مَا لِجُلُوسِنَا هَذَا تَحْتَ الْكِسَاءِ مِنَ الْفَضْلِ عِنْدَ اللهِ فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَالَّذِي بَعَثَنِي بِالْحَقِّ نَبِيًّا وَاصْطَفَانِي بِالرِّسَالَةِ نَجِيًّا مَا ذُكِرَ خَبَرُنَا هَذَا فِي مَحْفِلٍ مِن مَّحَافِلِ أَهْلِ الأَرْضِ وَفِيْهِ جَمْعٌ مِنْ شِيْعَتِنَا وَمُحِبِّينَا إِلَّا نَزَلَتْ عَلَيْهِمُ الرَّحْمَةُ وَحَفَّتْ بِهِمُ الْمَلَائِكَةُ وَاسْتَغْفَرَتْ لَهُمْ إِلَى أَن يَّتَفَرَّقُوا فَقَالَ عَلِيٌّ عَلَيْهِ السَّلامُ إِذَن وَّاللهِ فُزْنَا وَفَازَ شِيْعَتُنَا وَرَبِّ الْكَعْبَةِ فَقَالَ أبِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ يَا عَلِيُّ وَالَّذِي بَعَثَنِي بِالْحَقِّ نَبِيًّا وَاصْطَفَانِي بِالرِّسَالَةِ نَجِيًّا مَّا ذُكِرَ خَبَرُنَا هَذَا فِي مَحْفِلٍ مِن مَّحَافِلِ أَهْلِ الأَرْضِ وَفِيْهِ جَمْعٌ مِّنْ شِيْعَتِنَا وَمُحِبِّيْنَا وَفِيْهِم مَّهْمُومٌ إِلَّا فَرَّجَ اللهُ هَمَّهُ وَلَا مَغْمُومٌ إِلَّا كَشَفَ اللهُ غَمَّهُ وَلَا طَالِبُ حَاجَةٍ إِلَّا قَضَى اللهُ حَاجَتَهُ فَقَالَ عَلِيٌّ عَلَيْهِ السَّلَامُ إِذَن وَّاللهِ فُزْنَا وَسُعِدْنَا وَكَذَلِكَ شِيْعَتُنَا فَازُوا وَسُعِدُوا فِي الدُّنْيَا وَالآخِرَةِ وَرَبِّ الْكَعْبَةِ''',
    ),
  ];
  static final List<Ziyarat> ziyarats = [
    Ziyarat(
      title: 'زيارة عاشوراء',
      benefits: 'زيارة الإمام الحسين (ع) في يوم عاشوراء',
      text: '''بسم الله الرحمن الرحيم 

اَلسَّلامُ عَلَيْكَ يَا أَبَا عَبْدِ اللهِ اَلسَّلامُ عَلَيْكَ يَا بْنَ رَسُولِ اللهِ اَلسَّلامُ عَلَيْكَ يَا خِيَرَةَ اللهِ وَابْنَ خِيَرَتِهِ اَلسَّلامُ عَلَيْكَ يَا بْنَ أَميرِ الْمُؤْمِنِينَ وَابْنَ سَيِّدِ الْوَصِيِّينَ اَلسَّلامُ عَلَيْكَ يَا بْنَ فاطِمَةَ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ اَلسَّلامُ عَلَيْكَ يَا ثَأْرَ اللهِ وَابْنَ ثَأْرِهِ وَالْوِتْرَ الْمَوْتُورَ اَلسَّلامُ عَلَيْكَ وَعَلَى الْأَرْوَاحِ الَّتِي حَلَّتْ بِفِنَائِكَ عَلَيْكُم مِّنِّي جَمِيعاً سَلامُ اللهِ أَبَداً مَّا بَقِيتُ وَبَقِيَ اللَّيْلُ وَالنَّهَارُ يَا أَبَا عَبْدِ اللهِ لَقَدْ عَظُمَتِ الرَّزِيَّةُ وَجَلَّتْ وَعَظُمَتِ الْمُصِيبَةُ بِكَ عَلَيْنا وَعَلَى جَميعِ أَهْلِ الْإِسْلَامِ وَجَلَّتْ وَعَظُمَتْ مُصِيبَتُكَ فِي السَّمَاوَاتِ عَلَى جَمِيعِ أَهْلِ السَّمَاوَاتِ فَلَعَنَ اللهُ أُمَّةً أَسَّسَتْ أَسَاسَ الظُّلْمِ وَالْجَوْرِ عَلَيْكُمْ أَهْلَ الْبَيْتِ وَلَعَنَ اللهُ أُمَّةً دَفَعَتْكُمْ عَن مَّقامِكُمْ وَأَزالَتْكُمْ عَن مَّراتِبِكُمُ الَّتي رَتَّبَكُمُ اللهُ فِيهَا وَلَعَنَ اللهُ أُمَّةً قَتَلَتْكُمْ وَلَعَنَ اللهُ الْمُمَهِّدِينَ لَهُمْ بِالتَّمْكِينِ مِنْ قِتَالِكُمْ بَرِئْتُ إِلَى اللهِ وَإِلَيْكُمْ مِنْهُمْ وَمِنْ أَشْيَاعِهِمْ وَأَتْبَاعِهِمْ وَأَوْلِيَائِهِم يَا أَبَا عَبْدِ اللهِ إِنِّي سِلْمٌ لِمَنْ سَالَمَكُمْ وَحَرْبٌ لِّمَنْ حَارَبَكُمْ إِلَى يَوْمِ الْقِيَامَةِ وَلَعَنَ اللهُ آلَ زِيَادٍ وَآلَ مَرْوَانَ وَلَعَنَ اللهُ بَنِي أُمَيَّةَ قَاطِبَةً وَلَعَنَ اللهُ ابْنَ مَرْجَانَةَ وَلَعَنَ اللهُ عُمَرَ بْنَ سَعْدٍ وَلَعَنَ اللهُ شِمْراً وَلَعَنَ اللهُ أُمَّةً أَسْرَجَتْ وَأَلْجَمَتْ وَتَنَقَّبَتْ لِقِتَالِكَ بِأَبِي أَنْتَ وَأُمِّي لَقَدْ عَظُمَ مُصَابِي بِكَ فَأَسْأَلُ اللهَ الَّذِي أَكْرَمَ مَقَامَكَ وَأَكْرَمَنِي بِكَ أَن يَّرْزُقَنِي طَلَبَ ثَأْرِكَ مَعَ إِمَامٍ مَّنْصُورٍ مِنْ أَهْلِ بَيْتِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ اَللَّهُمَّ اجْعَلْنِي عِنْدَكَ وَجيهاً بِالْحُسَيْنِ عَلَيْهِ السَّلامُ فِي الدُّنْيَا وَالْآخِرَةِ يَا أَبَا عَبْدِ اللهِ إِنِّي أَتَقَرَّبُ إِلى اللهِ وَإِلَى رَسُولِهِ وَإِلَى أَمِيرِ الْمُؤْمِنِينَ وَإِلَى فَاطِمَةَ وَإِلَى الْحَسَنِ وَإِلَيْكَ بِمُوَالاتِكَ وَبِالْبَرَاءَةِ مِمَّنْ قَاتَلَكَ وَنَصَبَ لَكَ الْحَرْبَ وَبِالْبَراءَةِ مِمَّنْ أَسَّسَ أَسَاسَ الظُّلْمِ وَالْجَوْرِ عَلَيْكُمْ وَأَبْرَأُ إِلَى اللهِ وَإِلَى رَسُولِهِ مِمَّنْ أَسَّسَ أَسَاسَ ذَلِكَ وَبَنَى عَلَيْهِ بُنْيَانَهُ وَجَرى فِي ظُلْمِهِ وَجَوْرِهِ عَلَيْكُمْ وَعَلَى أَشْيَاعِكُمْ بَرِئْتُ إِلَى اللهِ وَإِلَيْكُم مَِنْهُمْ وَأَتَقَرَّبُ إِلَى اللهِ ثُمَّ إِلَيْكُمْ بِمُوَالاتِكُمْ وَمُوَالاةِ وَلِيِّكُمْ وَبِالْبَرَاءَةِ مِنْ أَعْدَائِكُمْ وَالنَّاصِبِينَ لَكُمُ الْحَرْبَ وَبِالْبَرَاءَةِ مِنْ أَشْيَاعِهِمْ وَأَتْبَاعِهِمْ إِنِّي سِلْمٌ لِّمَنْ سَالَمَكُمْ وَحَرْبٌ لِّمَنْ حَارَبَكُمْ وَوَلِيٌّ لِّمَنْ وَالاكُمْ وَعَدُوٌّ لَِمَنْ عَادَاكُمْ فَأَسْأَلُ اللهَ الَّذِي أَكْرَمَنِي بِمَعْرِفَتِكُمْ وَمَعْرِفَةِ أَوْلِيَائِكُمْ وَرَزَقَنِيَ الْبَرَاءَةَ مِنْ أَعْدَائِكُمْ أَن يَّجْعَلَنِي مَعَكُمْ فِي الدُّنْيا وَالْآخِرَةِ وَأَن يُّثَبِّتَ لِي عِنْدَكُمْ قَدَمَ صِدْقٍ فِي الدُّنْيا وَالْآخِرَةِ وَأَسْأَلُهُ أَن يُّبَلِّغَنِيَ الْمَقَامَ الْمَحْمُودَ لَكُمْ عِنْدَ اللهِ وَأَن يَّرْزُقَني طَلَبَ ثَأْرِي مَعَ إِمَامِ هُدًى ظَاهِرٍ نَّاطِقٍ بِالْحَقِّ مِنْكُمْ وَأَسْألُ اللهَ بِحَقِّكُمْ وَبِالشَّأْنِ الَّذِي لَكُمْ عِنْدَهُ أَنْ يُعْطِيَنِي بِمُصَابِي بِكُمْ أَفْضَلَ مَا يُعْطِي مُصَاباً بِمُصِيبَتِهِ مُصِيبَةً مَّا أَعْظَمَهَا وَأَعْظَمَ رَزِيَّتَهَا فِي الْإِسْلامِ وَفِي جَمِيعِ السَّمَاوَاتِ وَالْأرْضِ اَللَّهُمَّ اجْعَلْنِي فِي مَقَامِي هَذَا مِمَّنْ تَنَالُهُ مِنْكَ صَلَوَاتٌ وَّرَحْمَةٌ وَّمَغْفِرَةٌ اَللَّهُمَّ اجْعَلْ مَحْيَايَ مَحْيَا مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَمَمَاتِي مَمَاتَ مُحَمَّدٍ وَآلِ مُحَمَّدٍ اَللَّهُمَّ إِنَّ هَذَا يَوْمٌ تَبَرَّكَتْ بِهِ بَنُو أُمَيَّةَ وَابْنُ آكِلَةِ الْأَكْبَادِ اللَّعِينُ بْنُ اللَّعِينِ عَلَى لِسَانِكَ وَلِسَانِ نَبِيِّكَ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فِي كُلِّ مَوْطِنٍ وَّمَوْقِفٍ وَّقَفَ فِيهِ نَبِيُّكَ صَلَّى اللهُ عَلَيْهِ وَآلِهِ اَللَّهُمَّ الْعَنْ أَبَا سُفْيَانَ وَمُعَاوِيَةَ وَيَزيدَ بْنَ مُعَاوِيَةَ عَلَيْهِم مِّنْكَ اللَّعْنَةُ أَبَدَ الْآبِدِينَ وَهَذَا يَوْمٌ فَرِحَتْ بِهِ آلُ زِيَادٍ وَآلُ مَرْوَانَ بِقَتْلِهِمُ الْحُسَيْنَ صَلَواتُ اللهِ عَلَيْهِ اَللَّهُمَّ فَضَاعِفْ عَلَيْهِمُ اللَّعْنَ مِنْكَ وَالْعَذَابَ الْأَلِيمَ اَللَّهُمَّ إِنِّي أَتَقَرَّبُ إِلَيْكَ فِي هَذَا الْيَوْمِ وَفِي مَوْقِفِي هَذَا وَأَيَّامِ حَيَاتِي بِالْبَرَاءَةِ مِنْهُمْ وَاللَّعْنَةِ عَلَيْهِمْ وَبِالْمُوَالاةِ لِنَبِيِّكَ وَآلِ نَبِيِّكَ عَلَيْهِ وَعَلَيْهِمُ السَّلامُ

ثمّ تقول مائة مرّة:
اَللَّهُمَّ الْعَنْ أَوَّلَ ظَالِمٍ ظَلَمَ حَقَّ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَآخِرَ تَابِعٍ لَهُ عَلَى ذلِكَ اَللَّهُمَّ الْعَنْ الْعِصَابَةَ الَّتي جَاهَدتِ الْحُسَيْنَ عَلَيْهِ السَّلَامُ وَشَايَعَتْ وَبَايَعَتْ وَتَابَعَتْ عَلَى قَتْلِهِ اَللَّهُمَّ الْعَنْهُمْ جَمِيعاً

ثمّ تقول مائة مرّة:
اَلسَّلامُ عَلَيْكَ يَا أَبَا عَبْدِ اللهِ وَعَلَى الْأَرْوَاحِ الَّتِي حَلَّتْ بِفِنَائِكَ عَلَيْكَ مِنِّي سَلامُ اللهِ أَبَداً مَّا بَقِيتُ وَبَقِيَ اللَّيْلُ وَالنَّهَارُ وَلا جَعَلَهُ اللهُ آخِرَ الْعَهْدِ مِنِّي لِزِيَارَتِكُمْ اَلسَّلامُ عَلَى الْحُسَيْنِ وَعَلَى عَلِيِّ بْنِ الْحُسَيْنِ وَعَلَى أَوْلادِ الْحُسَيْنِ وَعَلَى أَصْحَابِ الْحُسَيْنِ

ثمّ تقول:
اَللَّهُمَّ خُصَّ أَنْتَ أَوَّلَ ظَالِمٍ بِاللَّعْنِ مِنِّي وَابْدَأْ بِهِ أَوَّلاً ثُمَّ الْعَنِ الثَّانيَ وَالثَّالِثَ وَالرَّابِعَ اَللَّهُمَّ الْعَنْ يَزيدَ خَامِساً وَالْعَنْ عُبَيْدَ اللهِ بْنَ زِيَادٍ وَابْنَ مَرْجانَةَ وَعُمَرَ بْنَ سَعْدٍ وَشِمْراً وَآلَ أَبِي سُفْيَانَ وَآلَ زِيادٍ وَآلَ مَرْوَانَ إِلَى يَوْمِ الْقِيَامَةِ

ثمّ تسجد وتقُول:
اَللَّهُمَّ لَكَ الْحَمْدُ حَمْدَ الشَّاكِرِينَ لَكَ عَلَى مُصَابِهِمْ اَلْحَمْدُ للهِ عَلَى عَظِيمِ رَزِيَّتِي اَللَّهُمَّ ارْزُقْنِي شَفَاعَةَ الْحُسَيْنِ يَوْمَ الْعُرُودِ وَثَبِّتْ لِي قَدَمَ صِدْقٍ عِنْدَكَ مَعَ الْحُسَيْنِ وَأَصْحَابِ الْحُسَيْنِ الَّذِينَ بَذَلُوا مُهَجَهُمْ دُونَ الْحُسَيْنِ عَلَيْهِ السَّلامُ''',
    ),
    Ziyarat(
      title: 'زيارة آل يس',
      benefits: 'زيارة الإمام المهدي (عج)',
      text: '''بسم الله الرحمن الرحيم

سَلامٌ عَلَى آلِ يسٓ اَلسَّلامُ عَلَيْكَ يَا دَاعِيَ اللهِ وَرَبَّانِيَّ آيَاتِهِ اَلسَّلامُ عَلَيْكَ يَا بَابَ اللهِ وَدَيَّانَ دِينِهِ اَلسَّلامُ عَلَيْكَ يَا خَلِيفَةَ اللهِ وَنَاصِرَ حَقِّهِ اَلسَّلامُ عَلَيْكَ يَا حُجَّةَ اللهِ وَدَلِيلَ إِرَادَتِهِ السَّلامُ عَلَيْكَ يَا تَالِيَ كِتَابِ اللهِ وتَرْجُمَانَهُ اَلسَّلامُ عَلَيْكَ فِي آنَاءِ لَيْلِكَ وَأطْرَافِ نَهَارِكَ اَلسَّلامُ عَلَيْكَ يَا بَقِيَّةَ اللهِ فِي أَرْضِهِ اَلسَّلامُ عَلَيْكَ يَا مِيثاقَ اللهِ الذي أَخَذَهُ وَوَكَّدَهُ السَّلامُ عَلَيكَ يا وَعْدَ اللهِ الَّذِي ضَمِنَهُ اَلسَّلامُ عَلَيْكَ أَيُّهَا الْعَلَمُ الْمَنْصُوبُ وَالْعِلْمُ الْمَصْبُوبُ وَالْغَوْثُ وَالرَّحْمَةُ الْوَاسِعَةُ وَعْداً غَيْرَ مَكْذُوبٍ اَلسَّلامُ عَلَيْكَ حِينَ تَقُومُ اَلسَّلامُ عَلَيْكَ حِينَ تَقْعُدُ اَلسَّلامُ عَليَكَ حِينَ تَقْرَأُ وَتُبَيِّنُ اَلسَّلامُ عَلَيْكَ حِينَ تُصَلِّي وَتَقْنُتُ اَلسَّلامُ عَلَيْكَ حِينَ تَرْكَعُ وَتَسْجُدُ اَلسَّلامُ عَلَيْكَ حِينَ تُهَلِّلُ وَتُكبِّرُ اَلسَّلامُ عَلَيْكَ حِينَ تَحْمَدُ وَتَسْتَغْفِرُ اَلسَّلامُ عَلَيْكَ حِين تُصْبِحُ وَتُمْسِي اَلسَّلامُ عَلَيْكَ فِي اللَّيْلِ إِذَا يَغْشَى وَالنَّهَارِ إِذَا تَجَلَّى اَلسَّلامُ عَلَيْكَ أيُّهَا الإِمَامُ الْمَأْمُونُ اَلسَّلامُ عَلَيْكَ أيُّهَا الْمُقَدَّمُ الْمَأْمُولُ اَلسَّلامُ عَلَيْكَ بِجَوَامِعِ السَّلامِ

أُشْهِدُكَ يَا مَوْلايَ أَنِّي أَشْهَدُ أن لَّا إِلَه إِلَّا اللهُ وَحْدَهُ لا شَرِيكَ لَهُ وَأنَّ مُحمَّداً عَبْدُهُ وَرَسُولُهُ لا حَبِيبَ إِلَّا هُوَ وَأَهْلُهُ وأُشْهِدُكَ يَا مَوْلايَ أنَّ عَلِيًّا أَمِيرَ الْمُؤْمِنِينَ حُجَّتُهُ وَالْحَسَنَ حُجَّتُهُ وَالْحُسَيْنَ حُجَّتُهُ وَعَلِيَّ بنَ الْحُسَيْنِ حُجَّتُهُ وَمُحَمَّدَ بْنَ عَلِيٍّ حُجَّتُهُ وَجَعْفَرَ بنَ مُحَمَّدٍ حُجَّتُهُ وَمُوسَى بْنَ جَعْفَرٍ حُجَّتُهُ وَعَلِيَّ بْنَ مُوسَى حُجَّتُهُ وَمُحَمَّدَ بْنَ عَلِيٍّ حُجَّتُهُ وَعَلِيَّ بْنَ مُحَمَّدٍ حُجَّتُهُ وَالْحَسَنَ بْنَ عليٍّ حُجَّتُهُ وَأَشْهَدُ أنَّكَ حُجَّةُ اللهِ أنْتُمُ الأَوَّلُ وَالآخِرُ وَأنَّ رَجْعَتَكُمْ حَقٌّ لا رَيْبَ فِيهَا يَوْمَ لا يَنْفَعُ نَفْساً إيْمَانُها لَمْ تكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إيْمَانِهَا خَيْراً وَأنَّ المَوْتَ حَقٌّ وَأنَّ نَاكِراً وَنَكِيراً حَقٌّ وَأَشْهَدُ أنَّ النَّشْرَ حَقٌّ وَالبَعْثَ حَقٌّ وَأَنَّ الصِّرَاطَ حَقٌّ وَالْمِرْصَادَ حَقٌّ وَالْمِيزَانَ حَقٌّ وَالْحَشْرَ حَقٌّ وَالْحِسَابَ حَقٌّ وَالْجَنَّةَ وَالنَّارَ حَقٌّ وَالْوَعْدَ وَالْوَعِيدَ بِهِمَا حَقٌّ يَا مَوْلَايَ شَقِيَ مَنْ خَالَفَكُمْ وَسَعِدَ مَنْ أَطَاعَكُمْ فَاشْهَدْ عَلَى مَا أشْهَدتُّكَ عَلَيْهِ وَأَنَا وَلِيٌّ لَّكَ برِيءٌ مِّنْ عَدُوِّكَ فَالْحَقُّ مَا رَضِيتُمُوهُ وَالْبَاطِلُ مَا أَسْخَطتُّمُوهُ وَالْمَعْرُوفُ مَا أَمَرْتُمْ بهِ وَالْمُنْكَرُ مَا نَهَيْتُمْ عَنْهُ فَنَفْسِي مُؤْمِنَةٌ بِالله وَحْدَهُ لا شَرِيكَ لَهُ وَبِرَسُولهِ وَبِأَمِيرِ الْمُؤْمِنِينَ وَبِكُمْ يَا مَوْلايَ أَوَّلِكُمْ وَآخِرِكُمْ وَنُصْرَتِي مُعَدَّةٌ لَّكُمْ وَمَوَدَّتِي خَالِصَةٌ لَّكُمْ آمِينَ آمِينَ''',
    ),
    Ziyarat(
      title: 'زيارة الأربعين',
      benefits: 'زيارة الإمام الحسين (ع) في يوم الأربعين',
      text: '''بسم الله الرحمن الرحيم

اَلسَّلامُ عَلى وَلِيِّ اللهِ وَحَبيبِهِ اَلسَّلامُ عَلى خَليلِ اللهِ وَنَجيبِهِ اَلسَّلامُ عَلى صَفِيِّ اللهِ وَابْنِ صَفِيِّهِ اَلسَّلامُ عَلى الْحُسَيْنِ الْمَظْلُومِ الشَّهيدِ اَلسَّلامُ على اَسيرِ الْكُرُباتِ وَقَتيلِ الْعَبَراتِ اَللَّهُمَّ اِنّي اَشْهَدُ اَنَّهُ وَلِيُّكَ وَابْنُ وَلِيِّكَ وَصَفِيُّكَ وَابْنُ صَفِيِّكَ الْفائِزُ بِكَرامَتِكَ اَكْرَمْتَهُ بِالشَّهادَةِ وَحَبَوْتَهُ بِالسَّعادَةِ وَاَجْتَبَيْتَهُ بِطيبِ الْوِلادَةِ وَجَعَلْتَهُ سَيِّداً مِنَ السادَةِ وَقائِداً مِنَ الْقادَةِ وَذائِداً مِنْ الْذادَةِ وَاَعْطَيْتَهُ مَواريثَ الاَنْبِياءِ وَجَعَلْتَهُ حُجَّةً عَلى خَلْقِكَ مِنَ الاَوْصِياءِ فَاَعْذَرَ فىِ الدُّعاءِ وَمَنَحَ النُّصْحَ وَبَذَلَ مُهْجَتَهُ فيكَ لِيَسْتَنْقِذَ عِبادَكَ مِنَ الْجَهالَةِ وَحَيْرَةِ الضَّلالَةِ وَقَدْ تَوازَرَ عَلَيْهِ مَنْ غَرَّتْهُ الدُّنْيا وَباعَ حَظَّهُ بِالاَرْذَلِ الاَدْنى وَشَرى آخِرَتَهُ بِالَّثمَنِ الاَوْكَسِ وَتَغَطْرَسَ وَتَرَدّى فِي هَواهُ وَاَسْخَطَكَ وَاَسْخَطَ نَبِيَّكَ وَاَطاعَ مِنْ عِبادِكَ اَهْلَ الشِّقاقِ وَالنِّفاقِ وَحَمَلَةَ الاَوْزارِ الْمُسْتَوْجِبينَ النّارَ فَجاهَدَهُمْ فيكَ صابِراً مُحْتَسِباً حَتّى سُفِكَ فِي طاعَتِكَ دَمُهُ وَاسْتُبيحَ حَريمُهُ اَللَّهُمَّ فَالْعَنْهُمْ لَعْناً وَبيلاً وَعَذِّبْهُمْ عَذاباً اَليماً

اَلسَّلامُ عَلَيْكَ يَا بْنَ رَسُولِ اللهِ اَلسَّلامُ عَلَيْكَ يَا بْنَ سَيِّدِ الاَوْصِياءِ اَشْهَدُ اَنَّكَ اَمينُ اللهِ وَابْنُ اَمينِهِ عِشْتَ سَعيداً وَمَضَيْتَ حَميداً وَمُتَّ فَقيداً مَظْلُوماً شَهيداً وَاَشْهَدُ اَنَّ اللهَ مُنْجِزٌ ما وَعَدَكَ وَمُهْلِكٌ مَنْ خَذَلَكَ وَمُعَذِّبٌ مَنْ قَتَلَكَ وَاَشْهَدُ اَنَّكَ وَفَيْتَ بِعَهْدِ اللهِ وَجاهَدْتَ فِي سَبيلِهِ حَتّى اَتياكَ الْيَقينُ فَلَعَنَ اللهُ مَنْ قَتَلَكَ وَلَعَنَ اللهُ مَنْ ظَلَمَكَ وَلَعَنَ اللهُ اُمَّةً سَمِعَتْ بِذلِكَ فَرَضِيَتْ بِهِ اَللَّهُمَّ اِنّي اُشْهِدُكَ اَنّي وَلِيٌّ لِمَنْ والاهُ وَعَدُوٌّ لِمَنْ عاداهُ بِاَبي اَنْتَ وَاُمّي يَا بْنَ رَسُولِ اللهِ اَشْهَدُ اَنَّكَ كُنْتَ نُوراً فىِ الاَصْلابِ الشّامِخَةِ وَالاَرْحامِ الْمُطَهَّرَةِ لَمْ تُنَجِّسْكَ الْجاهِلِيَّةُ بِاَنْجاسِها وَلَمْ تُلْبِسْكَ الْمُدْلَهِمّاتُ مِنْ ثِيابِها وَاَشْهَدُ اَنَّكَ مِنْ دَعائِمِ الدّينِ وَاَرْكانِ الْمُسْلِمينَ وَمَعْقِلِ الْمُؤْمِنينَ وَاَشْهَدُ اَنَّكَ الاِمامُ الْبَرُّ التَّقِيُّ الرَّضِيُّ الزَّكِيُّ الْهادِي الْمَهْدِيُّ وَاَشْهَدُ اَنَّ الاَئِمَّةَ مِنْ وُلْدِكَ كَلِمَةُ التَّقْوى وَاَعْلامُ الْهُدى وَالْعُرْوَةُ الْوُثْقى وَالْحُجَّةُ على اَهْلِ الدُّنْيا وَاَشْهَدُ اَنّي بِكُمْ مُؤْمِنٌ وَبِاِيابِكُمْ مُوقِنٌ بِشَرايِعِ ديني وَخَواتيمِ عَمَلي وَقَلْبي لِقَلْبِكُمْ سِلْمٌ وَاَمْري لاَِمْرِكُمْ مُتَّبِعٌ وَنُصْرَتي لَكُمْ مُعَدَّةٌ حَتّى يَأذَنَ اللهُ لَكُمْ فَمَعَكُمْ مَعَكُمْ لا مَعَ عَدُوِّكُمْ صَلَواتُ اللهِ عَلَيْكُمْ وَعلى اَرْواحِكُمْ وَاَجْسادِكُمْ وَشاهِدِكُمْ وَغائِبِكُمْ وَظاهِرِكُمْ وَباطِنِكُمْ آمينَ رَبَّ الْعالِمينَ''',
    ),
    Ziyarat(
      title: 'زيارة الناحية المقدسة',
      benefits: 'من الزيارات العظيمة للإمام الحسين (ع)',
      text: '''بسم الله الرحمن الرحيم

السَّلَامُ عَلَى آدَمَ صَفْوَةِ اللَّهِ مِنْ خَلِيقَتِهِ السَّلَامُ عَلَى شَيْثٍ وَلِيِّ اللَّهِ وَ خِيَرَتِهِ السَّلَامُ عَلَى إِدْرِيسَ الْقَائِمِ لِلَّهِ بِحُجَّتِهِ السَّلَامُ عَلَى نُوحٍ الْمُجَابِ فِي دَعْوَتِهِ السَّلَامُ عَلَى هُودٍ الْمَمْدُودِ مِنَ اللَّهِ بِمَعُونَتِهِ السَّلَامُ عَلَى صَالِحٍ الَّذِي تَوَّجَهُ اللَّهُ بِكَرَامَتِهِ السَّلَامُ عَلَى إِبْرَاهِيمَ الَّذِي حَبَاهُ اللَّهُ بِخَلَّتِهِ السَّلَامُ عَلَى إِسْمَاعِيلَ الَّذِي فَدَاهُ اللَّهُ بِذِبْحٍ عَظِيمٍ مِنْ جَنَّتِهِ السَّلَامُ عَلَى إِسْحَاقَ الَّذِي جَعَلَ اللَّهُ النُّبُوَّةَ فِي ذُرِّيَّتِهِ السَّلَامُ عَلَى يَعْقُوبَ الَّذِي رَدَّ اللَّهُ عَلَيْهِ بَصَرَهُ بِرَحْمَتِهِ السَّلَامُ عَلَى يُوسُفَ الَّذِي نَجَّاهُ اللَّهُ مِنَ الْجُبِّ بِعَظَمَتِهِ السَّلَامُ عَلَى مُوسَى الَّذِي فَلَقَ اللَّهُ الْبَحْرَ لَهُ بِقُدْرَتِهِ السَّلَامُ عَلَى هَارُونَ الَّذِي خَصَّهُ اللَّهُ بِنُبُوَّتِهِ السَّلَامُ عَلَى شُعَيْبٍ الَّذِي نَصَرَهُ اللَّهُ عَلَى أُمَّتِهِ السَّلَامُ عَلَى دَاوُدَ الَّذِي تَابَ اللَّهُ عَلَيْهِ مِنْ خَطِيئَتِهِ السَّلَامُ عَلَى سُلَيْمَانَ الَّذِي ذَلَّتْ لَهُ الْجِنُّ بِعِزَّتِهِ السَّلَامُ عَلَى أَيُّوبَ الَّذِي شَفَاهُ اللَّهُ مِنْ عِلَّتِهِ السَّلَامُ عَلَى يُونُسَ الَّذِي أَنْجَزَ اللَّهُ لَهُ مَضْمُونَ عِدَتِهِ السَّلَامُ عَلَى عُزَيْرٍ الَّذِي أَحْيَاهُ اللَّهُ بَعْدَ مَيْتَتِهِ السَّلَامُ عَلَى زَكَرِيَّا الصَّابِرِ فِي مِحْنَتِهِ السَّلَامُ عَلَى يَحْيَى الَّذِي أَزْلَفَهُ اللَّهُ بِشَهَادَتِهِ السَّلَامُ عَلَى عِيسَى رُوحِ اللَّهِ وَ كَلِمَتِهِ السَّلَامُ عَلَى مُحَمَّدٍ حَبِيبِ اللَّهِ وَ صَفْوَتِهِ السَّلَامُ عَلَى أَمِيرِ الْمُؤْمِنِينَ عَلِيِّ بْنِ أَبِي طَالِبٍ الْمَخْصُوصِ بِأُخُوَّتِهِ السَّلَامُ عَلَى فَاطِمَةَ الزَّهْرَاءِ ابْنَتِهِ السَّلَامُ عَلَى أَبِي مُحَمَّدٍ الْحَسَنِ وَصِيِّ أَبِيهِ وَ خَلِيفَتِهِ السَّلَامُ عَلَى الْحُسَيْنِ الَّذِي سَمَحَتْ نَفْسُهُ بِمُهْجَتِهِ السَّلَامُ عَلَى مَنْ أَطَاعَ اللَّهَ فِي سِرِّهِ وَ عَلَانِيَتِهِ السَّلَامُ عَلَى مَنْ جُعِلَ الشِّفَاءُ فِي تُرْبَتِهِ السَّلَامُ عَلَى مَنِ الْإِجَابَةُ تَحْتَ قُبَّتِهِ السَّلَامُ عَلَى مَنِ الْأَئِمَّةُ مِنْ ذُرِّيَّتِهِ السَّلَامُ عَلَى ابْنِ خَاتَمِ الْأَنْبِيَاءِ السَّلَامُ عَلَى ابْنِ سَيِّدِ الْأَوْصِيَاءِ السَّلَامُ عَلَى ابْنِ فَاطِمَةَ الزَّهْرَاءِ السَّلَامُ عَلَى ابْنِ خَدِيجَةَ الْكُبْرَى السَّلَامُ عَلَى ابْنِ سِدْرَةِ الْمُنْتَهَى السَّلَامُ عَلَى ابْنِ جَنَّةِ الْمَأْوَى السَّلَامُ عَلَى ابْنِ زَمْزَمَ وَ الصَّفَا السَّلَامُ عَلَى الْمُرَمَّلِ بِالدِّمَاءِ السَّلَامُ عَلَى مَهْتُوكِ الْخِبَاءِ السَّلَامُ عَلَى خَامِسِ أَصْحَابِ أَهْلِ الْكِسَاءِ السَّلَامُ عَلَى غَرِيبِ الْغُرَبَاءِ السَّلَامُ عَلَى شَهِيدِ الشُّهَدَاءِ السَّلَامُ عَلَى قَتِيلِ الْأَدْعِيَاءِ السَّلَامُ عَلَى سَاكِنِ كَرْبَلَاءَ السَّلَامُ عَلَى مَنْ بَكَتْهُ مَلَائِكَةُ السَّمَاءِ السَّلَامُ عَلَى مَنْ ذُرِّيَّتُهُ الْأَزْكِيَاءُ السَّلَامُ عَلَى يَعْسُوبِ الدِّينِ السَّلَامُ عَلَى مَنَازِلِ الْبَرَاهِينِ السَّلَامُ عَلَى الْأَئِمَّةِ السَّادَاتِ السَّلَامُ عَلَى الْجُيُوبِ الْمُضَرَّجَاتِ السَّلَامُ عَلَى الشِّفَاهِ الذَّابِلَاتِ السَّلَامُ عَلَى النُّفُوسِ الْمُصْطَلَمَاتِ السَّلَامُ عَلَى الْأَرْوَاحِ الْمُخْتَلَسَاتِ السَّلَامُ عَلَى الْأَجْسَادِ الْعَارِيَاتِ السَّلَامُ عَلَى الْجُسُومِ الشَّاحِبَاتِ السَّلَامُ عَلَى الدِّمَاءِ السَّائِلَاتِ السَّلَامُ عَلَى الْأَعْضَاءِ الْمُقَطَّعَاتِ السَّلَامُ عَلَى الرُّءُوسِ الْمُشَالاتِ السَّلَامُ عَلَى النِّسْوَةِ الْبَارِزَاتِ السَّلَامُ عَلَى حُجَّةِ رَبِّ الْعَالَمِينَ السَّلَامُ عَلَيْكَ وَ عَلَى آبَائِكَ الطَّاهِرِينَ السَّلَامُ عَلَيْكَ وَ عَلَى أَبْنَائِكَ الْمُسْتَشْهَدِينَ السَّلَامُ عَلَيْكَ وَ عَلَى ذُرِّيَّتِكَ النَّاصِرِينَ السَّلَامُ عَلَيْكَ وَ عَلَى الْمَلَائِكَةِ الْمُضَاجِعِينَ السَّلَامُ عَلَى الْقَتِيلِ الْمَظْلُومِ السَّلَامُ عَلَى أَخِيهِ الْمَسْمُومِ السَّلَامُ عَلَى عَلِيٍّ الْكَبِيرِ السَّلَامُ عَلَى الرَّضِيعِ الصَّغِيرِ السَّلَامُ عَلَى الْأَبْدَانِ السَّلِيبَةِ السَّلَامُ عَلَى الْعِتْرَةِ الْقَرِيبَةِ السَّلَامُ عَلَى الْمُجَدَّلِينَ فِي الْفَلَوَاتِ السَّلَامُ عَلَى النَّازِحِينَ عَنِ الْأَوْطَانِ السَّلَامُ عَلَى الْمَدْفُونِينَ بِلَا أَكْفَانٍ السَّلَامُ عَلَى الرُّءُوسِ الْمُفَرَّقَةِ عَنِ الْأَبْدَانِ السَّلَامُ عَلَى الْمُحْتَسِبِ الصَّابِرِ السَّلَامُ عَلَى الْمَظْلُومِ بِلَا نَاصِرٍ السَّلَامُ عَلَى سَاكِنِ التُّرْبَةِ الزَّاكِيَةِ السَّلَامُ عَلَى صَاحِبِ الْقُبَّةِ السَّامِيَةِ السَّلَامُ عَلَى مَنْ طَهَّرَهُ الْجَلِيلُ السَّلَامُ عَلَى مَنِ افْتَخَرَ بِهِ جَبْرَئِيلُ السَّلَامُ عَلَى مَنْ نَاغَاهُ فِي الْمَهْدِ مِيكَائِيلُ السَّلَامُ عَلَى مَنْ نُكِثَتْ ذِمَّتُهُ السَّلَامُ عَلَى مَنْ هُتِكَتْ حُرْمَتُهُ السَّلَامُ عَلَى مَنْ أُرِيقَ بِالظُّلْمِ دَمُهُ السَّلَامُ عَلَى الْمُغَسَّلِ بِدَمِ الْجِرَاحِ السَّلَامُ عَلَى الْمُجَرَّعِ بِكَأْسَاتِ الرِّمَاحِ السَّلَامُ عَلَى الْمُضَامِ الْمُسْتَبَاحِ السَّلَامُ عَلَى الْمَهْجُورِ فِي الْوَرَى السَّلَامُ عَلَى مَنْ تَوَلَّى دَفْنَهُ أَهْلُ الْقُرَى السَّلَامُ عَلَى الْمَقْطُوعِ الْوَتِينِ السَّلَامُ عَلَى الْمُحَامِي بِلَا مُعِينٍ السَّلَامُ عَلَى الشَّيْبِ الْخَضِيبِ السَّلَامُ عَلَى الْخَدِّ التَّرِيبِ السَّلَامُ عَلَى الْبَدَنِ السَّلِيبِ السَّلَامُ عَلَى الثَّغْرِ الْمَقْرُوعِ بِالْقَضِيبِ السَّلَامُ عَلَى الْوَدَجِ الْمَقْطُوعِ السَّلَامُ عَلَى الرَّأْسِ الْمَرْفُوعِ السَّلَامُ عَلَى الْأَجْسَامِ الْعَارِيَةِ فِي الْفَلَوَاتِ تَنْهَشُهَا الذِّئَابُ الْعَادِيَاتُ وَ تَخْتَلِفُ إِلَيْهَا السِّبَاعُ الضَّارِيَاتُ السَّلَامُ عَلَيْكَ يَا مَوْلَايَ وَ عَلَى الْمَلَائِكَةِ الْمَرْفُوفِينَ حَوْلَ قُبَّتِكَ الْحَافِّينَ بِتُرْبَتِكَ الطَّائِفِينَ بِعَرْصَتِكَ الْوَارِدِينَ لِزِيَارَتِكَ السَّلَامُ عَلَيْكَ فَإِنِّي قَصَدْتُ إِلَيْكَ وَ رَجَوْتُ الْفَوْزَ لَدَيْكَ السَّلَامُ عَلَيْكَ سَلَامَ الْعَارِفِ بِحُرْمَتِكَ الْمُخْلِصِ فِي وَلَايَتِكَ الْمُتَقَرِّبِ إِلَى اللَّهِ بِمَحَبَّتِكَ الْبَرِيءِ مِنْ أَعْدَائِكَ سَلَامَ مَنْ قَلْبُهُ بِمُصَابِكَ مَقْرُوحٌ وَ دَمْعُهُ عِنْدَ ذِكْرِكَ مَسْفُوحٌ سَلَامَ الْمَفْجُوعِ الْمَحْزُونِ الْوَالِهِ الْمُسْتَكِينِ سَلَامَ مَنْ لَوْ كَانَ مَعَكَ بِالطُّفُوفِ لَوَقَاكَ بِنَفْسِهِ حَدَّ السُّيُوفِ وَ بَذَلَ حُشَاشَتَهُ دُونَكَ لِلْحُتُوفِ وَ جَاهَدَ بَيْنَ يَدَيْكَ وَ نَصَرَكَ عَلَى مَنْ بَغَى عَلَيْكَ وَ فَدَاكَ بِرُوحِهِ وَ جَسَدِهِ وَ مَالِهِ وَ وُلْدِهِ وَ رُوحُهُ لِرُوحِكَ فِدَاءٌ وَ أَهْلُهُ لِأَهْلِكَ وِقَاءٌ فَلَئِنْ أَخَّرَتْنِي الدُّهُورُ وَ عَاقَنِي عَنْ نَصْرِكَ الْمَقْدُورُ وَ لَمْ أَكُنْ لِمَنْ حَارَبَكَ مُحَارِباً وَ لِمَنْ نَصَبَ لَكَ الْعَدَاوَةَ مُنَاصِباً فَلَأَنْدُبَنَّكَ صَبَاحاً وَ مَسَاءً وَ لَأَبْكِيَنَّ عَلَيْكَ بَدَلَ الدُّمُوعِ دَماً حَسْرَةً عَلَيْكَ وَ تَأَسُّفاً عَلَى مَا دَهَاكَ وَ تَلَهُّفاً حَتَّى أَمُوتَ بِلَوْعَةِ الْمُصَابِ وَ غُصَّةِ الِاكْتِيَابِ أَشْهَدُ أَنَّكَ قَدْ أَقَمْتَ الصَّلَاةَ وَ آتَيْتَ الزَّكَاةَ وَ أَمَرْتَ بِالْمَعْرُوفِ وَ نَهَيْتَ عَنِ الْمُنْكَرِ وَ الْعُدْوَانِ وَ أَطَعْتَ اللَّهَ وَ مَا عَصَيْتَهُ وَ تَمَسَّكْتَ بِهِ وَ بِحَبْلِهِ فَأَرْضَيْتَهُ وَ خَشْيَتَهُ وَ رَاقَبْتَهُ وَ اسْتَجَبْتَهُ وَ سَنَنْتَ السُّنَنَ وَ أَطْفَأْتَ الْفِتَنَ وَ دَعَوْتَ إِلَى الرَّشَادِ وَ أَوْضَحْتَ سُبُلَ السَّدَادِ وَ جَاهَدْتَ فِي اللَّهِ حَقَّ الْجِهَادِ وَ كُنْتَ لِلَّهِ طَائِعاً وَ لِجَدِّكَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ تَابِعاً وَ لِقَوْلِ أَبِيكَ سَامِعاً وَ إِلَى وَصِيَّةِ أَخِيكَ مُسَارِعاً وَ لِعِمَادِ الدِّينِ رَافِعاً وَ لِلطُّغْيَانِ قَامِعاً وَ لِلطُّغَاةِ مُقَارِعاً وَ لِلْأُمَّةِ نَاصِحاً وَ فِي غَمَرَاتِ الْمَوْتِ سَابِحاً وَ لِلْفُسَّاقِ مُكَافِحاً وَ بِحُجَجِ اللَّهِ قَائِماً وَ لِلْإِسْلَامِ وَ الْمُسْلِمِينَ رَاحِماً وَ لِلْحَقِّ نَاصِراً وَ عِنْدَ الْبَلَاءِ صَابِراً وَ لِلدِّينِ كَالِئاً وَ عَنْ حَوْزَتِهِ مُرَامِياً وَ عَنْ شَرِيعَتِهِ مُحَامِياً تَحُوطُ الْهُدَى وَ تَنْصُرُهُ وَ تَبْسُطُ الْعَدْلَ وَ تَنْشُرُهُ وَ تَنْصُرُ الدِّينَ وَ تُظْهِرُهُ وَ تَكُفُّ الْعَابِثَ وَ تَزْجُرُهُ وَ تَأْخُذُ لِلدَّنِيِّ مِنَ الشَّرِيفِ وَ تُسَاوِي فِي الْحُكْمِ بَيْنَ الْقَوِيِّ وَ الضَّعِيفِ كُنْتَ رَبِيعَ الْأَيْتَامِ وَ عِصْمَةَ الْأَنَامِ وَ عِزَّ الْإِسْلَامِ وَ مَعْدِنَ الْأَحْكَامِ وَ حَلِيفَ الْإِنْعَامِ سَالِكاً طَرَائِقَ جَدِّكَ وَ أَبِيكَ مُشْبِهاً فِي الْوَصِيَّةِ لِأَخِيكَ وَفِيَّ الذِّمَمِ رَضِيَّ الشِّيَمِ ظَاهِرَ الْكَرَمِ مُتَهَجِّداً فِي الظُّلَمِ قَوِيمَ الطَّرَائِقِ كَرِيمَ الْخَلَائِقِ عَظِيمَ السَّوَابِقِ شَرِيفَ النَّسَبِ مُنِيفَ الْحَسَبِ رَفِيعَ الرُّتَبِ كَثِيرَ الْمَنَاقِبِ مَحْمُودَ الضَّرَائِبِ جَزِيلَ الْمَوَاهِبِ حَلِيمٌ رَشِيدٌ مُنِيبٌ جَوَادٌ عَلِيمٌ شَدِيدٌ إِمَامٌ شَهِيدٌ أَوَّاهٌ مُنِيبٌ حَبِيبٌ مَهِيبٌ كُنْتَ لِلرَّسُولِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَلَداً وَ لِلْقُرْآنِ مُنْقِذاً وَ لِلْأُمَّةِ عَضُداً وَ فِي الطَّاعَةِ مُجْتَهِداً حَافِظاً لِلْعَهْدِ وَ الْمِيثَاقِ نَاكِباً عَنْ سُبُلِ الْفُسَّاقِ بَاذِلًا لِلْمَجْهُودِ طَوِيلَ الرُّكُوعِ وَ السُّجُودِ زَاهِداً فِي الدُّنْيَا زُهْدَ الرَّاحِلِ عَنْهَا نَاظِراً إِلَيْهَا بِعَيْنِ الْمُسْتَوْحِشِينَ مِنْهَا آمَالُكَ عَنْهَا مَكْفُوفَةٌ وَ هِمَّتُكَ عَنْ زِينَتِهَا مَصْرُوفَةٌ وَ أَلْحَاظُكَ عَنْ بَهْجَتِهَا مَطْرُوفَةٌ وَ رَغْبَتُكَ فِي الْآخِرَةِ مَعْرُوفَةٌ حَتَّى إِذَا الْجَوْرُ مَدَّ بَاعَهُ وَ أَسْفَرَ الظُّلْمُ قِنَاعَهُ وَ دَعَا الْغَيُّ أَتْبَاعَهُ وَ أَنْتَ فِي حَرَمِ جَدِّكَ قَاطِنٌ وَ لِلظَّالِمِينَ مُبَايِنٌ جَلِيسُ الْبَيْتِ وَ الْمِحْرَابِ مُعْتَزِلٌ عَنِ اللَّذَّاتِ وَ الشَّهَوَاتِ تُنْكِرُ الْمُنْكَرَ بِقَلْبِكَ وَ لِسَانِكَ عَلَى قَدْرِ طَاقَتِكَ وَ إِمَكَانِكَ ثُمَّ اقْتَضَاكَ الْعِلْمُ لِلْإِنْكَارِ وَ لَزِمَكَ أَنْ تُجَاهِدَ الْفُجَّارَ فَسِرْتَ فِي أَوْلَادِكَ وَ أَهَالِيكَ وَ شِيعَتِكَ وَ مَوَالِيكَ وَ صَدَعْتَ بِالْحَقِّ وَ الْبَيِّنَةِ وَ دَعَوْتَ إِلَى اللَّهِ بِالْحِكْمَةِ وَ الْمَوْعِظَةِ الْحَسَنَةِ وَ أَمَرْتَ بِإِقَامَةِ الْحُدُودِ وَ الطَّاعَةِ لِلْمَعْبُودِ وَ نَهَيْتَ عَنِ الْخَبَائِثِ وَ الطُّغْيَانِ وَ وَاجَهُوكَ بِالظُّلْمِ وَ الْعُدْوَانِ فَجَاهَدْتَهُمْ بَعْدَ الْإِيعَادِ لَهُمْ وَ تَأْكِيدِ الْحُجَّةِ عَلَيْهِمْ فَنَكَثُوا ذِمَامَكَ وَ بَيْعَتَكَ وَ أَسْخَطُوا رَبَّكَ وَ جَدَّكَ وَ بَدَءُوكَ بِالْحَرْبِ فَثَبَتَّ لِلطَّعْنِ وَ الضَّرْبِ وَ طَحَنْتَ جُنُودَ الْفُجَّارِ وَ اقْتَحَمْتَ قَسْطَلَ الْغُبَارِ مُجَالِداً بِذِي الْفَقَارِ كَأَنَّكَ عَلِيٌّ الْمُخْتَارُ فَلَمَّا رَأَوْكَ ثَابِتَ الْجَأْشِ غَيْرَ خَائِفٍ وَ لَا خَاشٍ نَصَبُوا لَكَ غَوَائِلَ مَكْرِهِمْ وَ قَاتَلُوكَ بِكَيْدِهِمْ وَ شَرِّهِمْ وَ أَمَرَ اللَّعِينُ جُنُودَهُ فَمَنَعُوكَ الْمَاءَ وَ وُرُودَهُ وَ نَاجَزُوكَ الْقِتَالَ وَ عَاجَلُوكَ النِّزَالَ وَ رَشَقُوكَ بِالسِّهَامِ وَ النِّبَالِ وَ بَسَطُوا إِلَيْكَ أَكُفَّ الِاصْطِلَامِ وَ لَمْ يَرْعَوْا لَكَ ذِمَاماً وَ لَا رَاقَبُوا فِيكَ الْأَنَامَ فِي قَتْلِهِمْ أَوْلِيَاءَكَ وَ نَهْبِهِمْ رِحَالَكَ أَنْتَ مُقَدَّمٌ فِي الْهَبَوَاتِ وَ مُحْتَمِلٌ لِلْأَذِيَّاتِ وَ قَدْ عَجِبَتْ مِنْ صَبْرِكَ مَلَائِكَةُ السَّمَاوَاتِ وَ أَحْدَقُوا بِكَ مِنْ كُلِّ الْجِهَاتِ وَ أَثْخَنُوكَ بِالْجِرَاحِ وَ حَالُوا بَيْنَكَ وَ بَيْنَ الرَّوَاحِ وَ لَمْ يَبْقَ لَكَ نَاصِرٌ وَ أَنْتَ مُحْتَسِبٌ صَابِرٌ تَذُبُّ عَنْ نِسْوَتِكَ وَ أَوْلَادِكَ حَتَّى نَكَسُوكَ عَنْ جَوَادِكَ فَهَوَيْتَ إِلَى الْأَرْضِ جَرِيحاً تَطَؤُكَ الْخُيُولُ بِحَوَافِرِهَا وَ تَعْلُوكَ الطُّغَاةُ بِبَوَاتِرِهَا قَدْ رَشَحَ لِلْمَوْتِ جَبِينُكَ وَ اخْتَلَفَتْ بِالانْقِبَاضِ وَ الِانْبِسَاطِ شِمَالُكَ وَ يَمِينُكَ تُدِيرُ طَرْفاً خَفِيّاً إِلَى رَحْلِكَ وَ بَيْتِكَ وَ قَدْ شُغِلْتَ بِنَفْسِكَ عَنْ وُلْدِكَ وَ أَهْلِكَ وَ أَسْرَعَ فَرَسُكَ شَارِداً وَ إِلَى خِيَامِكَ قَاصِداً مُحَمَّحِماً بَاكِياً فَلَمَّا رَأَيْنَ النِّسَاءُ جَوَادَكَ مَخْزِيّاً وَ نَظَرْنَ سَرْجَكَ عَلَيْهِ مَلْوِيّاً بَرَزْنَ مِنَ الْخُدُورِ نَاشِرَاتِ الشُّعُورِ عَلَى الْخُدُودِ لَاطِمَاتِ الْوُجُوهِ سَافِرَاتٍ وَ بِالْعَوِيلِ دَاعِيَاتٍ وَ بَعْدَ الْعِزِّ مُذَلَّلَاتٍ وَ إِلَى مَصْرَعِكَ مُبَادِرَاتٍ وَ الشِّمْرُ جَالِسٌ عَلَى صَدْرِكَ مُولِغٌ سَيْفَهُ عَلَى نَحْرِكَ قَابِضٌ عَلَى شَيْبَتِكَ بِيَدِهِ ذَابِحٌ لَكَ بِمُهَنَّدِهِ قَدْ سَكَنَتْ حَوَاسُّكَ وَ خَفِيَتْ أَنْفَاسُكَ وَ رُفِعَ عَلَى الْقَنَا رَأْسُكَ وَ سُبِيَ أَهْلُكَ كَالْعَبِيدِ وَ صُفِّدُوا فِي الْحَدِيدِ فَوْقَ أَقْتَابِ الْمَطِيَّاتِ تَلْفَحُ وُجُوهَهُمْ حَرُّ الْهَاجِرَاتِ يُسَاقُونَ فِي الْبَرَارِي وَ الْفَلَوَاتِ أَيْدِيهِمْ مَغْلُولَةٌ إِلَى الْأَعْنَاقِ يُطَافُ بِهِمْ فِي الْأَسْوَاقِ فَالْوَيْلُ لِلْعُصَاةِ الْفُسَّاقِ لَقَدْ قَتَلُوا بِقَتْلِكَ الْإِسْلَامَ وَ عَطَّلُوا الصَّلَاةَ وَ الصِّيَامَ وَ نَقَضُوا السُّنَنَ وَ الْأَحْكَامَ وَ هَدَمُوا قَوَاعِدَ الْإِيمَانِ وَ حَرَّفُوا آيَاتِ الْقُرْآنِ وَ هَمْلَجُوا فِي الْبَغْيِ وَ الْعُدْوَانِ لَقَدْ أَصْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ مَوْتُوراً وَ عَادَ كِتَابُ اللَّهِ عَزَّ وَ جَلَّ مَهْجُوراً وَ غُودِرَ الْحَقُّ إِذْ قُهِرْتَ مَقْهُوراً وَ فُقِدَ بِفَقْدِكَ التَّكْبِيرُ وَ التَّهْلِيلُ وَ التَّحْرِيمُ وَ التَّحْلِيلُ وَ التَّنْزِيلُ وَ التَّأْوِيلُ وَ ظَهَرَ بَعْدَكَ التَّغْيِيرُ وَ التَّبْدِيلُ وَ الْإِلْحَادُ وَ التَّعْطِيلُ وَ الْأَهْوَاءُ وَ الْأَضَالِيلُ وَ الْفِتَنُ وَ الْأَبَاطِيلُ فَقَامَ نَاعِيكَ عِنْدَ قَبْرِ جَدِّكَ الرَّسُولِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ فَنَعَاكَ إِلَيْهِ بِالدَّمْعِ الْهَطُولِ قَائِلًا يَا رَسُولَ اللَّهِ قُتِلَ سِبْطُكَ وَ فَتَاكَ وَ اسْتُبِيحَ أَهْلُكَ وَ حِمَاكَ وَ سُبِيَتْ بَعْدَكَ ذَرَارِيكَ وَ وَقَعَ الْمَحْذُورُ بِعِتْرَتِكَ وَ ذَوِيكَ فَانْزَعَجَ الرَّسُولُ وَ بَكَى قَلْبُهُ الْمَهُولُ وَ عَزَّاهُ بِكَ الْمَلَائِكَةُ وَ الْأَنْبِيَاءُ وَ فُجِعَتْ بِكَ أُمُّكَ الزَّهْرَاءُ وَ اخْتَلَفَتْ جُنُودُ الْمَلَائِكَةِ الْمُقَرَّبِينَ تُعَزِّي أَبَاكَ أَمِيرَ الْمُؤْمِنِينَ وَ أُقِيمَتْ لَكَ الْمَآتِمُ فِي أَعْلَى عِلِّيِّينَ وَ لَطَمَتْ عَلَيْكَ الْحُورُ الْعِينُ وَ بَكَتِ السَّمَاءُ وَ سُكَّانُهَا وَ الْجِنَانُ وَ خُزَّانُهَا وَ الْهِضَابُ وَ أَقْطَارُهَا وَ الْأَرْضُ وَ أَقْطَارُهَا وَ الْبِحَارُ وَ حِيتَانُهَا وَ مَكَّةُ وَ بُنْيَانُهَا وَ الْجِنَانُ وَ وِلْدَانُهَا وَ الْبَيْتُ وَ الْمَقَامُ وَ الْمَشْعَرُ الْحَرَامُ وَ الْحِلُّ وَ الْإِحْرَامُ اللَّهُمَّ فَبِحُرْمَةِ هَذَا الْمَكَانِ الْمُنِيفِ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ احْشُرْنِي فِي زُمْرَتِهِمْ وَ أَدْخِلْنِي الْجَنَّةَ بِشَفَاعَتِهِمْ اللَّهُمَّ فَإِنِّي أَتَوَسَّلُ إِلَيْكَ يَا أَسْرَعَ الْحَاسِبِينَ وَ يَا أَكْرَمَ الْأَكْرَمِينَ وَ يَا أَحْكَمَ الْحَاكِمِينَ بِمُحَمَّدٍ خَاتَمِ النَّبِيِّينَ رَسُولِكَ إِلَى الْعَالَمِينَ أَجْمَعِينَ وَ بِأَخِيهِ وَ ابْنِ عَمِّهِ الْأَنْزَعِ الْبَطِينِ الْعَالِمِ الْمَكِينِ عَلِيٍّ أَمِيرِ الْمُؤْمِنِينَ وَ بِفَاطِمَةَ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ وَ بِالْحَسَنِ الزَّكِيِّ عِصْمَةِ الْمُتَّقِينَ وَ بِأَبِي عَبْدِ اللَّهِ الْحُسَيْنِ أَكْرَمِ الْمُسْتَشْهَدِينَ وَ بِأَوْلَادِهِ الْمَقْتُولِينَ وَ بِعِتْرَتِهِ الْمَظْلُومِينَ وَ بِعَلِيِّ بْنِ الْحُسَيْنِ زَيْنِ الْعَابِدِينَ وَ بِمُحَمَّدِ بْنِ عَلِيٍّ قِبْلَةِ الْأَوَّابِينَ وَ جَعْفَرِ بْنِ مُحَمَّدٍ أَصْدَقِ الصَّادِقِينَ وَ مُوسَى بْنِ جَعْفَرٍ مُظْهِرِ الْبَرَاهِينِ وَ عَلِيِّ بْنِ مُوسَى نَاصِرِ الدِّينِ وَ مُحَمَّدِ بْنِ عَلِيٍّ قُدْوَةِ الْمُهْتَدِينَ وَ عَلِيِّ بْنِ مُحَمَّدٍ أَزْهَدِ الزَّاهِدِينَ وَ الْحَسَنِ بْنِ عَلِيٍّ وَارِثِ الْمُسْتَخْلَفِينَ وَ الْحُجَّةِ عَلَى الْخَلْقِ أَجْمَعِينَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ الصَّادِقِينَ الْأَبَرِّينَ آلِ طَهَ وَ يس وَ أَنْ تَجْعَلَنِي فِي الْقِيَامَةِ مِنَ الْآمِنِينَ الْمُطْمَئِنِّينَ الْفَائِزِينَ الْفَرِحِينَ الْمُسْتَبْشِرِينَ اللَّهُمَّ اكْتُبْنِي فِي الْمُسَلِّمِينَ وَ أَلْحِقْنِي بِالصَّالِحِينَ وَ اجْعَلْ لِي لِسانَ صِدْقٍ فِي الْآخِرِينَ وَ انْصُرْنِي عَلَى الْبَاغِينَ وَ اكْفِنِي كَيْدَ الْحَاسِدِينَ وَ اصْرِفْ عَنِّي مَكْرَ الْمَاكِرِينَ وَ اقْبِضْ عَنِّي أَيْدِيَ الظَّالِمِينَ وَ اجْمَعْ بَيْنِي وَ بَيْنَ السَّادَةِ الْمَيَامِينِ فِي أَعْلَى عِلِّيِّينَ مَعَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَ الصِّدِّيقِينَ وَ الشُّهَداءِ وَ الصَّالِحِينَ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ اللَّهُمَّ إِنِّي أُقْسِمُ عَلَيْكَ بِنَبِيِّكَ الْمَعْصُومِ وَ بِحُكْمِكَ الْمَحْتُومِ وَ نَهْيِكَ الْمَكْتُومِ وَ بِهَذَا الْقَبْرِ الْمَلْمُومِ الْمُوَسَّدِ فِي كَنَفِهِ الْإِمَامِ الْمَعْصُومِ الْمَقْتُولِ الْمَظْلُومِ أَنْ تَكْشِفَ مَا بِي مِنَ الْغُمُومِ وَ تَصْرِفَ عَنِّي شَرَّ الْقَدَرِ الْمَحْتُومِ وَ تُجِيرَنِي مِنَ النَّارِ ذَاتِ السَّمُومِ اللَّهُمَّ جَلِّلْنِي بِنِعْمَتِكَ وَ رَضِّنِي بِقَسْمِكَ وَ تَغَمَّدْنِي بِجُودِكَ وَ كَرَمِكَ وَ بَاعِدْنِي مِنْ مَكْرِكَ وَ نَقِمَتِكَ اللَّهُمَّ اعْصِمْنِي مِنَ الزَّلَلِ وَ سَدِّدْنِي فِي الْقَوْلِ وَ الْعَمَلِ وَ افْسَحْ لِي فِي مُدَّةِ الْأَجَلِ وَ أَعْفِنِي مِنَ الْأَوْجَاعِ وَ الْعِلَلِ وَ بَلِّغْنِي بِمَوَالِيَّ وَ بِفَضْلِكَ أَفْضَلَ الْأَمَلِ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ اقْبَلْ تَوْبَتِي وَ ارْحَمْ عَبْرَتِي وَ أَقِلْنِي عَثْرَتِي وَ نَفِّسْ كُرْبَتِي وَ اغْفِرْ لِي خَطِيئَتِي وَ أَصْلِحْ لِي فِي ذُرِّيَّتِي اللَّهُمَّ لَا تَدَعْ لِي فِي هَذَا الْمَشْهَدِ الْمُعَظَّمِ وَ الْمَحَلِّ الْمُكَرَّمِ ذَنْباً إِلَّا غَفَرْتَهُ وَ لَا عَيْباً إِلَّا سَتَرْتَهُ وَ لَا غَمّاً إِلَّا كَشَفْتَهُ وَ لَا رِزْقاً إِلَّا بَسَطْتَهُ وَ لَا جَاهاً إِلَّا عَمَرْتَهُ وَ لَا فَسَاداً إِلَّا أَصْلَحْتَهُ وَ لَا أَمَلًا إِلَّا بَلَّغْتَهُ وَ لَا دُعَاءً إِلَّا أَجَبْتَهُ وَ لَا مُضَيَّقاً إِلَّا فَرَّجْتَهُ وَ لَا شَمْلاً إِلَّا جَمَعْتَهُ وَ لَا أَمْراً إِلَّا أَتْمَمْتَهُ وَ لَا مَالًا إِلَّا كَثَّرْتَهُ وَ لَا خُلُقاً إِلَّا حَسَّنْتَهُ وَ لَا إِنْفَاقاً إِلَّا أَخْلَفْتَهُ وَ لَا حَالًا إِلَّا عَمَّرْتَهُ وَ لَا حَسُوداً إِلَّا قَمَعْتَهُ وَ لَا عَدُوّاً إِلَّا أَرْدَيْتَهُ وَ لَا شَرّاً إِلَّا كَفَيْتَهُ وَ لَا مَرَضاً إِلَّا شَفَيْتَهُ وَ لَا بَعِيداً إِلَّا أَدْنَيْتُهُ وَ لَا شَعَثاً إلَّا لَمَمْتَهُ وَ لَا سُؤَالًا إِلَّا أَعْطَيْتَهُ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْعَاجِلَةِ وَ ثَوَابَ الْآجِلَةِ اللَّهُمَّ أَغْنِنِي بِحَلَالِكَ عَنِ الْحَرَامِ وَ بِفَضْلِكَ عَنْ جَمِيعِ الْأَنَامِ اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَ قَلْباً خَاشِعاً وَ يَقِيناً شَافِياً وَ عَمَلًا زَاكِياً وَ صَبْراً جَمِيلًا وَ أَجْراً جَزِيلًا اللَّهُمَّ ارْزُقْنِي شُكْرَ نِعْمَتِكَ عَلَيَّ وَ زِدْ فِي إِحْسَانِكَ وَ كَرَمِكَ إِلَيَّ وَ اجْعَلْ قَوْلِي فِي النَّاسِ مَسْمُوعاً وَ عَمَلِي عِنْدَكَ مَرْفُوعاً وَ أَثَرِي فِي الْخَيْرَاتِ مَتْبُوعاً وَ عَدُوِّي مَقمُوعاً اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ الْأَخْيَارِ فِي آنَاءِ اللَّيْلِ وَ أَطْرَافِ النَّهَارِ وَ اكْفِنِي شَرَّ الْأَشْرَارِ وَ طَهِّرْنِي مِنَ الذُّنُوبِ وَ الْأَوْزَارِ وَ أَجِرْنِي مِنَ النَّارِ وَ أَدْخِلْنِي دَارَ الْقَرَارِ وَ اغْفِرْ لِي وَ لِجَمِيعِ إِخْوَانِي فِيكَ وَ أَخَوَاتِيَ الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ  

ثمَّ تَتَوَجَّهْ إِلَى الْقِبْلَةِ، وَتُصَلِّي رَكْعَتَيْنِ، وَتَقْرَأُ فِي الْأُولَى سُورَةَ الْأَنْبِيَاءِ، وَفِي الثَّانِيَةِ الْحَشْرَ، وَتَقْنُتُ فَتَقُولُ:

لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ لَا إِلَهَ إِلَّا اللَّهُ الْعَلِيُّ الْعَظِيمُ لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَاوَاتِ السَّبْعِ وَ الْأَرَضِينَ السَّبْعِ وَ مَا فِيهِنَّ وَ مَا بَيْنَهُنَّ خِلَافاً لِأَعْدَائِهِ وَ تَكْذِيباً لِمَنْ عَدَلَ بِهِ وَ إِقْرَاراً لِرُبُوبِيَّتِهِ وَ خُشُوعاً لِعِزَّتِهِ الْأَوَّلُ بِغَيْرِ أَوَّلٍ وَ الْآخِرُ بِغَيْرِ آخِرٍ الظَّاهِرُ عَلَى كُلِّ شَيْءٍ بِقُدْرَتِهِ الْبَاطِنُ دُونَ كُلِّ شَيْءٍ بِعِلْمِهِ وَ لُطْفِهِ لَا تَقِفُ الْعُقُولُ عَلَى كُنْهِ عَظَمَتِهِ وَ لَا تُدْرِكُ الْأَوْهَامُ حَقِيقَةَ مَاهِيَّتِهِ وَ لَا تَتَصَوَّرُ الْأَنْفُسُ مَعَانِيَ كَيْفِيَّتِهِ مُطَّلِعاً عَلَى الضَّمَائِرِ عَارِفاً بِالسَّرَائِرِ يَعْلَمُ خائِنَةَ الْأَعْيُنِ وَ ما تُخْفِي الصُّدُورُ اللَّهُمَّ إِنِّي أُشْهِدُكَ عَلَى تَصْدِيقِي رَسُولَكَ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ إِيمَانِي بِهِ وَ عِلْمِي بِمَنْزِلَتِهِ وَ إِنِّي أَشْهَدُ أَنَّهُ النَّبِيُّ الَّذِي نَطَقَتِ الْحِكْمَةُ بِفَضْلِهِ وَ بَشَّرَتِ الْأَنْبِيَاءُ بِهِ وَ دَعَتْ إِلَى الْإِقْرَارِ بِمَا جَاءَ بِهِ وَ حَثَّتْ عَلَى تَصْدِيقِهِ بِقَوْلِهِ تَعَالَى الَّذِي يَجِدُونَهُ مَكْتُوباً عِنْدَهُمْ فِي التَّوْراةِ وَ الْإِنْجِيلِ يَأْمُرُهُمْ بِالْمَعْرُوفِ وَ يَنْهاهُمْ عَنِ الْمُنْكَرِ وَ يُحِلُّ لَهُمُ الطَّيِّباتِ وَ يُحَرِّمُ عَلَيْهِمُ الْخَبائِثَ وَ يَضَعُ عَنْهُمْ إِصْرَهُمْ وَ الْأَغْلالَ الَّتِي كانَتْ عَلَيْهِمْ فَصَلِّ عَلَى مُحَمَّدٍ رَسُولِكَ إِلَى الثَّقَلَيْنِ وَ سَيِّدِ الْأَنْبِيَاءِ الْمُصْطَفَيْنَ وَ عَلَى أَخِيهِ وَ ابْنِ عَمِّهِ اللَّذَيْنِ لَمْ يُشْرِكَا بِكَ طَرْفَةَ عَيْنٍ أَبَداً وَ عَلَى فَاطِمَةَ الزَّهْرَاءِ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ وَ عَلَى سَيِّدَيْ شَبَابِ أَهْلِ الْجَنَّةِ الْحَسَنِ وَ الْحُسَيْنِ صَلَاةً خَالِدَةَ الدَّوَامِ عَدَدَ قَطْرِ الرِّهَامِ وَ زِنَةَ الْجِبَالِ وَ الْآكَامِ مَا أَوْرَقَ السَّلَامُ وَ اخْتَلَفَ الضِّيَاءُ وَ الظَّلَامُ وَ عَلَى آلِهِ الطَّاهِرِينَ الْأَئِمَّةِ الْمُهْتَدِينَ الذَّائِدِينَ عَنِ الدِّينِ عَلِيٍّ وَ مُحَمَّدٍ وَ جَعْفَرٍ وَ مُوسَى وَ عَلِيٍّ وَ مُحَمَّدٍ وَ عَلِيٍّ وَ الْحَسَنِ وَ الْحُجَّةِ الْقُوَّامِ بِالْقِسْطِ وَ سُلَالَةِ السِّبْطِ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِحَقِّ هَذَا الْإِمَامِ فَرَجاً قَرِيباً وَ صَبْراً جَمِيلًا وَ نَصْراً عَزِيزاً وَ غِنًى عَنِ الْخَلْقِ وَ ثَبَاتاً فِي الْهُدَى وَ التَّوْفِيقَ لِمَا تُحِبُّ وَ تَرْضَى وَ رِزْقاً وَاسِعاً حَلَالًا طَيِّباً مَرِيئاً دَارّاً سَائِغاً فَاضِلًا مُفْضِلًا صَبّاً صَبّاً مِنْ غَيْرِ كَدٍّ وَ لَا نَكَدٍ وَ لَا مِنَّةٍ مِنْ أَحَدٍ وَ عَافِيَةً مِنْ كُلِّ بَلَاءٍ وَ سُقْمٍ وَ مَرَضٍ وَ الشُّكْرَ عَلَى الْعَافِيَةِ وَ النَّعْمَاءِ وَ إِذَا جَاءَ الْمَوْتُ فَاقْبِضْنَا عَلَى أَحْسَنِ مَا يَكُونُ لَكَ طَاعَةً عَلَى مَا أَمَرْتَنَا مُحَافِظِينَ حَتَّى تُؤَدِّيَنَا إِلَى جَنَّاتِ النَّعِيمِ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَوْحِشْنِي مِنَ الدُّنْيَا وَ آنِسْنِي بِالْآخِرَةِ فَإِنَّهُ لَا يُوحِشُ مِنَ الدُّنْيَا إِلَّا خَوْفُكَ وَ لَا يُؤْنِسُ بِالْآخِرَةِ إِلَّا رَجَاؤُكَ اللَّهُمَّ لَكَ الْحُجَّةُ لَا عَلَيْكَ وَ إِلَيْكَ الْمُشْتَكَى لَا مِنْكَ فَصَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ وَ أَعِنِّي عَلَى نَفْسِيَ الظَّالِمَةِ الْعَاصِيَةِ وَ شَهْوَتِيَ الْغَالِبَةِ وَ اخْتِمْ لِي بِالْعَفْوِ وَ الْعَافِيَةِ اللَّهُمَّ إِنَّ اسْتِغْفَارِي إِيَّاكَ وَ أَنَا مُصِرٌّ عَلَى مَا نَهَيْتَ قِلَّةُ حَيَاءٍ وَ تَرْكِيَ الِاسْتِغْفَارَ مَعَ عِلْمِي بِسَعَةِ حِلْمِكَ تَضْيِيعٌ لِحَقِّ الرَّجَاءِ اللَّهُمَّ إِنَّ ذُنُوبِي تُؤْيِسُنِي أَنْ أَرْجُوَكَ وَ إِنَّ عِلْمِي بِسَعَةِ رَحْمَتِكَ يَمْنَعُنِي أَنْ أَخْشَاكَ فَصَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ صَدِّقْ رَجَائِي لَكَ وَ كَذِّبْ خَوْفِي مِنْكَ وَ كُنْ لِي عِنْدَ أَحْسَنِ ظَنِّي بِكَ يَا أَكْرَمَ الْأَكْرَمِينَ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَيِّدْنِي بِالْعِصْمَةِ وَ أَنْطِقْ لِسَانِي بِالْحِكْمَةِ وَ اجْعَلْنِي مِمَّنْ يَنْدَمُ عَلَى مَا ضَيَّعَهُ فِي أَمْسِهِ وَ لَا يُغْبَنُ حَظُّهُ فِي يَوْمِهِ وَ لَا يَهُمُّ لِرِزْقِ غَدِهِ اللَّهُمَّ إِنَّ الْغَنِيَّ مَنِ اسْتَغْنَى بِكَ وَ افْتَقَرَ إِلَيْكَ وَ الْفَقِيرَ مَنِ اسْتَغْنَى بِخَلْقِكَ عَنْكَ فَصَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَغْنِنِي عَنْ خَلْقِكَ بِكَ وَ اجْعَلْنِي مِمَّنْ لَا يَبْسُطُ كَفّاً إِلَّا إِلَيْكَ اللَّهُمَّ إِنَّ الشَّقِيَّ مَنْ قَنَطَ وَ أَمَامَهُ التَّوْبَةُ وَ وَرَاءَهُ الرَّحْمَةُ وَ إِنْ كُنْتُ ضَعِيفَ الْعَمَلِ فَإِنِّي فِي رَحْمَتِكَ قَوِيُّ الْأَمَلِ فَهَبْ لِي ضَعْفَ عَمَلِي لِقُوَّةِ أَمَلِي اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ فِي عِبَادِكَ مَنْ هُوَ أَقْسَى قَلْباً مِنِّي وَ أَعْظَمُ مِنِّي ذَنْباً فَإِنِّي أَعْلَمُ أَنَّهُ لَا مَوْلَى أَعْظَمُ مِنْكَ طَوْلًا وَ أَوْسَعُ رَحْمَةً وَ عَفْواً فَيَا مَنْ هُوَ أَوْحَدُ فِي رَحْمَتِهِ اغْفِرْ لِمَنْ لَيْسَ بِأَوْحَدَ فِي خَطِيئَتِهِ اللَّهُمَّ إِنَّكَ أَمَرْتَنَا فَعَصَيْنَا وَ نَهَيْتَ فَمَا انْتَهَيْنَا وَ ذَكَّرْتَ فَتَنَاسَيْنَا وَ بَصَّرْتَ فَتَعَامَيْنَا وَ حَدَّدْتَ فَتَعَدَّيْنَا وَ مَا كَانَ ذَلِكَ جَزَاءَ إِحْسَانِكَ إِلَيْنَا وَ أَنْتَ أَعْلَمُ بِمَا أَعْلَنَّا وَ أَخْفَيْنَا وَ أَخْبَرُ بِمَا نَأْتِي وَ مَا أَتَيْنَا فَصَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ لَا تُؤَاخِذْنَا بِمَا أَخْطَأْنَا وَ نَسِينَا وَ هَبْ لَنَا حُقُوقَكَ لَدَيْنَا وَ أَتِمَّ إِحْسَانَكَ إِلَيْنَا وَ أَسْبِلْ رَحْمَتَكَ عَلَيْنَا اللَّهُمَّ إِنَّا نَتَوَسَّلُ إِلَيْكَ بِهَذَا الصِّدِّيقِ الْإِمَامِ وَ نَسْأَلُكَ بِالْحَقِّ الَّذِي جَعَلْتَهُ لَهُ وَ لِجَدِّهِ رَسُولِكَ وَ لِأَبَوَيْهِ عَلِيٍّ وَ فَاطِمَةَ أَهْلِ بَيْتِ الرَّحْمَةِ إِدْرَارَ الرِّزْقِ الَّذِي بِهِ قِوَامُ حَيَاتِنَا وَ صَلَاحُ أَحْوَالِ عِيَالِنَا فَأَنْتَ الْكَرِيمُ الَّذِي تُعْطِي مِنْ سَعَةٍ وَ تَمْنَعُ مِنْ قُدْرَةٍ وَ نَحْنُ نَسْأَلُكَ مِنَ الرِّزْقِ مَا يَكُونُ صَلَاحاً لِلدُّنْيَا وَ بَلَاغاً لِلْآخِرَةِ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ اغْفِرْ لَنَا وَ لِوَالِدَيْنَا وَ لِجَمِيعِ الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ وَ الْمُسْلِمِينَ وَ الْمُسْلِمَاتِ الْأَحْيَاءِ مِنْهُمْ وَ الْأَمْوَاتِ وَ آتِنا فِي الدُّنْيا حَسَنَةً وَ فِي الْآخِرَةِ حَسَنَةً وَ قِنا عَذابَ النَّارِ  

ثُمَّ تَرْكَعُ وَ تَسْجُدُ وَ تَجْلِسُ فَتَتَشَهَّدُ وَ تُسَلِّمُ، فَإِذَا سَبَّحْتَ فَعَفِّرْ خَدَّيْكَ وَ قُلْ:  

سُبْحَانَ اللَّهِ وَ الْحَمْدُ لِلَّهِ وَ لَا إِلَهَ إِلَّا اللَّهُ وَ اللَّهُ أَكْبَرُ (أَرْبَعِينَ مَرَّةً)

وَ اسْأَلِ اللَّهَ الْعِصْمَةَ وَ النَّجَاةَ، وَ الْمَغْفِرَةَ وَ التَّوْفِيقَ لِحُسْنِ الْعَمَلِ وَ الْقَبُولَ، لِمَا تَتَقَرَّبُ بِهِ إِلَيْهِ وَ تَبْتَغِي بِهِ وَجْهَهُ، وَ قِفْ عِنْدَ الرَّأْسِ ثُمَّ صَلِّ رَكْعَتَيْنِ عَلَى مَا تَقَدَّمَ، ثُمَّ انْكَبَّ عَلَى الْقَبْرِ وَ قَبِّلْهُ وَ قُلْ:

زَادَ اللَّهُ فِي شَرَفِكُمْ، وَ السَّلَامُ عَلَيْكُمْ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ

وَ ادْعُ لِنَفْسِكَ وَ لِوَالِدَيْكَ وَ لِمَنْ أَرَدْتَ، وَ انْصَرِفْ إِنْ شَاءَ اللَّهُ تَعَالَى.''',
    ),
    Ziyarat(
      title: 'الزيارة الجامعة الكبيرة',
      benefits: 'زيارة لجميع الأئمة (عليهم السلام)',
      text: '''بسم الله الرحمن الرحيم

أَشْهَدُ أَنْ لا إِلَهَ إِلا اللهُ وَحْدَهُ لا شَرِيكَ لَهُ ، وَأَشْهَدُ أَنَّ مُحَمَّداً صَلَّى اللهُ عَلَيْهِ وَآلِهِ عَبْدُهُ وَرَسُولُهُ . اَلسَّلامُ عَلَيْكُمْ يا اَهْلَ بَيْتِ النُّبُوَّةِ وَمَوْضِعَ الرِّسالَةِ وَمُخْتَلَفَ الْمَلائِكَةِ وَمَهْبِطَ الْوَحْىِ وَمَعْدِنَ الرَّحْمَةِ وَخُزّانَ الْعِلْمِ وَمُنْتَهَى الْحِلْمِ وَاُصُولَ الْكَرَمِ وَقادَةَ الاُْمَمِ وَاَوْلِياءَ النِّعَمِ وَعَناصِرَ الاَبْرارِ وَدَعائِمَ الاَخْيارِ وَساسَةَ الْعِبادِ وَاَرْكانَ الْبِلادِ وَاَبْوابَ الاْيمانِ وَاُمَناءَ الرَّحْمنِ وَسُلالَةَ النَّبِيّينَ وَصَفْوَةَ الْمُرْسَلينَ وَعِتْرَةَ خِيَرَةِ رَبِّ الْعالَمينَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ . اَلسَّلامُ عَلى اَئِمَّةِ الْهُدى وَمَصابيحِ الدُّجى وَاَعْلامِ التُّقى وَذَوِى النُّهى وَاُولِى الْحِجى وَكَهْفِ الْوَرى وَوَرَثَةِ الاَنْبِياءِ وَالْمَثَلِ الاَعْلى وَالدَّعْوَةِ الْحُسْنى وَحُجَجِ اللهِ عَلى اَهْلِ الدُّنْيَا وَالاْخِرَةِ وَالاُْولى وَرَحْمَةُ اللهِ وَبَرَكاتُهُ . اَلسَّلامُ عَلى مَحالِّ مَعْرِفَةِ اللهِ وَمَساكِنِ بَرَكَةِ اللهِ وَمَعادِنِ حِكْمَةِ اللهِ وَحَفَظَةِ سِرِّ اللهِ وَحَمَلَةِ كِتابِ اللهِ وَاَوْصِياءِ نَبِىِّ اللهِ وَذُرِّيَّةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ . اَلسَّلامُ عَلَى الدُّعاةِ اِلَى اللهِ وَالاَدِلاّءِ عَلى مَرْضاتِ اللهِ وَالْمُسْتَقِرّينَ فى اَمْرِ اللهِ وَالتّامّينَ فى مَحَبَّةِ اللهِ وَالُْمخْلِصينَ فِى تَوْحيدِ اللهِ وَالْمُظْهِرينَ لاَِمْرِ اللهِ وَنَهْيِهِ وَعِبادِهِ الْمُكْرَمينَ الَّذينَ لا يَسْبِقُونَهُ بِالْقَوْلِ وَهُمْ بِاَمْرِهِ يَعْمَلُونَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ . اَلسَّلامُ عَلَى الاَئِمَّةِ الدُّعاةِ وَالْقادَةِ الْهُداةِ وَالسّادَةِ الْوُلاةِ وَالذّادَةِ الْحُماةِ وَاَهْلِ الذِّكْرِ وَاُولِى الاَمْرِ وَبَقِيَّةِ اللهِ وَخِيَرَتِهِ وَحِزْبِهِ وَعَيْبَةِ عِلْمِهِ وَحُجَّتِهِ وَصِراطِهِ وَنُورِهِ وَبُرْهانِهِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ .

أَشْهَدُ اَنْ لا اِلـهَ اِلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ كَما شَهِدَ اللهُ لِنَفْسِهِ وَشَهِدَتْ لَهُ مَلائِكَتُهُ وَاُولُوالْعِلْمِ مِنْ خَلْقِهِ لا اِلـهَ اِلاّ هُوَ الْعَزِيزُ الْحَكيمُ ، وَاَشْهَدُ اَنَّ مُحَمَّداً عَبْدُهُ الْمُنْتَجَبُ وَرَسُولُهُ الْمُرْتَضى اَرْسَلَهُ بِالْهُدى وَدينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ ، وَاَشْهَدُ اَنَّكُمُ الاَئِمَّةُ الرّاشِدُونَ الْـمَهْدِيُّونَ الْمَعْصُومُونَ الْمُكَرَّمُونَ الْمُقَرَّبُونَ الْمُتَّقُونَ الصّادِقُونَ الْمُصْطَفَوْنَ الْمُطيعُونَ للهِ الْقَوّامُونَ بِاَمْرِهِ الْعامِلُونَ بِاِرادَتِهِ الْفائِزُونَ بِكَرامَتِهِ اصْطَفاكُمْ بِعِلْمِهِ وَارْتَضاكُمْ لِغَيْبِهِ وَاخْتارَكُمْ لِسِرِّهِ وَاجْتَباكُمْ بِقُدْرَتِهِ وَاَعَزَّكُمْ بِهُداهُ وَخَصَّكُمْ بِبُرْهانِهِ وَانْتَجَبَكُمْ لِنُورِهِ وَاَيَّدَكُمْ بِرُوحِهِ وَرَضِيَكُمْ خُلَفاءَ فى اَرْضِهِ وَحُجَجاً عَلى بَرِيَّتِهِ وَاَنْصاراً لِدينِهِ وَحَفَظَةً لِسِرِّهِ وَخَزَنَةً لِعِلْمِهِ وَمُسْتَوْدَعاً لِحِكْمَتِهِ وَتَراجِمَةً لِوَحْيِهِ وَاَرْكاناً لِتَوْحيدِهِ وَشُهَداءَ عَلى خَلْقِهِ وَاَعْلاماً لِعِبادِهِ وَمَناراً فى بِلادِهِ وَاَدِلاّءَ عَلى صِراطِهِ ، عَصَمَكُمُ اللهُ مِنَ الزَّلَلِ وَآمَنَكُمْ مِنَ الْفِتَنِ وَطَهَّرَكُمْ مِنَ الدَّنَسِ وَاَذْهَبَ عَنْكُمُ الرِّجْسَ وَطَهَّرَكُمْ تَطْهيراً ، فَعَظَّمْتُمْ جَلالَهُ وَاَكْبَرْتُمْ شَأْنَهُ وَمَجَّدْتُمْ كَرَمَهُ وَاَدَمْتُمْ ذِكْرَهُ وَوَكَّدْتُمْ ميثاقَهُ وَاَحْكَمْتُمْ عَقْدَ طاعَتِهِ وَنَصَحْتُمْ لَهُ فِى السِّرِّ وَالْعَلانِيَةِ وَدَعَوْتُمْ اِلى سَبيلِهِ بِالْحِكْمَةِ وَالْالْمَوْعِظَةِ الْحَسَنَةِ وَبَذَلْتُمْ اَنْفُسَكُمْ فى مَرْضاتِهِ وَصَبَرْتُمْ عَلى ما اَصابَكُمْ فى جَنْبِهِ وَاَقَمْتُمُ الصَّلاةَ وَآتَيْتُمُ الزَّكاةَ وَاَمَرْتُمْ بِالْمَعْرُوفِ وَنَهَيْتُمْ عَنِ الْمُنْكَرِ وَجاهَدْتُمْ فِى اللهِ حَقَّ جِهادِهِ حَتّى اَعْلَنْتُمْ دَعْوَتَهُ وَبَيَّنْتُمْ فَرائِضَهُ وَاَقَمْتُمْ حُدُودَهُ وَنَشَرْتُمْ شَرايِعَ اَحْكامِهِ وَسَنَنْتُمْ سُنَّتَهُ وَصِرْتُمْ فى ذلِكَ مِنْهُ اِلَى الرِّضا وَسَلَّمْتُمْ لَهُ الْقَضاءَ وَصَدَّقْتُمْ مِنْ رُسُلِهِ مَنْ مَضى ، فَالرّاغِبُ عَنْكُمْ مارِقٌ وَاللاّزِمُ لَكُمْ لاحِقٌ وَالْمُقَصِّرُ فى حَقِّكُمْ زاهِقٌ ، وَالْحَقُّ مَعَكُمْ وَفيكُمْ وَمِنْكُمْ وَاِلَيْكُمْ وَاَنْتُمْ اَهْلُهُ وَمَعْدِنُهُ وَميراثُ النُّبُوَّةِ عِنْدَكُمْ وَاِيابُ الْخَلْقِ اِلَيْكُمْ وَحِسابُهُمْ عَلَيْكُمْ وَفَصْلُ الْخِطابِ عِنْدَكُمْ وَآياتُ اللهِ لَدَيْكُمْ وَعَزائِمُهُ فيكُمْ وَنُورُهُ وَبُرْهانُهُ عِنْدَكُمْ وَاَمْرُهُ اِلَيْكُمْ ، مَنْ والاكُمْ فَقَدْ والَى اللهَ وَمَنْ عاداكُمْ فَقَدْ عادَ اللهَ وَمَنْ اَحَبَّكُمْ فَقَدْ اَحَبَّ اللهَ وَمَنْ اَبْغَضَكُمْ فَقَدْ اَبْغَضَ اللهَ وَمَنِ اعْتَصَمَ بِكُمْ فَقَدِ اعْتَصَمَ بِاللهِ ، اَنْتُمُ الصِّراطُ الاَقْوَمُ وَشُهَداءُ دارِ الْفَناءِ وَشُفَعاءُ دارِ الْبَقاءِ وَالرَّحْمَةُ الْمَوْصُولَةُ وَالاْيَةُ الَمخْزُونَةُ وَالاَمانَةُ الُْمحْفُوظَةُ وَالْبابُ الْمُبْتَلى بِهِ النّاسُ ، مَنْ اَتاكُمْ نَجا وَمَنْ لَمْ يَأتِكُمْ هَلَكَ ، اِلَى اللهِ تَدْعُونَ وَعَلَيْهِ تَدُلُّونَ وَبِهِ تُؤْمِنُونَ وَلَهُ تُسَلِّمُونَ وَبِاَمْرِهِ تَعْمَلُونَ وَاِلى سَبيلِهِ تُرْشِدُونَ وَبِقَوْلِهِ تَحْكُمُونَ ، سَعَدَ مَنْ والاكُمْ وَهَلَكَ مَنْ عاداكُمْ وَخابَ مَنْ جَحَدَكُمْ وَضَلَّ مَنْ فارَقَكُمْ وَفازَ مَنْ تَمَسَّكَ بِكُمْ وَاَمِنَ مَنْ لَجَاَ اِلَيْكُمْ وَسَلِمَ مَنْ صَدَّقَكُمْ وَهُدِىَ مَنِ اعْتَصَمَ بِكُمْ ، مَنِ اتَّبَعَكُمْ فَالْجَنَّةُ مَأواهُ وَمَنْ خالَفَكُمْ فَالنّارُ مَثْوايهُ وَمَنْ جَحَدَكُمْ كافِرٌ وَمَنْ حارَبَكُمْ مُشْرِكٌ وَمَنْ رَدَّ عَلَيْكُمْ فى اَسْفَلِ دَرْك مِنَ الْجَحيمِ .  

أَشْهَدُ اَنَّ هذا سابِقٌ لَكُمْ فيما مَضى وَجارٍ لَكُمْ فيما بَقِىَ وَاَنَّ اَرْواحَكُمْ وَنُورَكُمْ وَطينَتَكُمْ واحِدَةٌ طابَتْ وَطَهُرَتْ بَعْضُها مِنْ بَعْض خَلَقَكُمُ اللهُ اَنْواراً فَجَعَلَكُمْ بِعَرْشِهِ مُحْدِقينَ حَتّى مَنَّ عَلَيْنا بِكُمْ فَجَعَلَكُمْ فى بُيُوت اَذِنَ اللهُ اَنْ تُرْفَعَ وَيُذْكَرَ فيهَا اسْمُهُ وَجَعَلَ صَلَواتِنا عَلَيْكُمْ وَما خَصَّنا بِهِ مِنْ وِلايَتِكُمْ طيباً لِخَلْقِنا وَطَهارَةً لاَِنْفُسِنا وَتَزْكِيَةً لَنا وَكَفّارَةً لِذُنُوبِنا ، فَكُنّا عِنْدَهُ مُسَلِّمينَ بِفَضْلِكُمْ وَمَعْرُوفينَ بِتَصْديقِنا اِيّاكُمْ ، فَبَلَغَ اللهُ بِكُمْ اَشْرَفَ مَحَلِّ الْمُكَرَّمينَ وَاَعْلى مَنازِلِ الْمُقَرَّبينَ وَاَرْفَعَ دَرَجاتِ الْمُرْسَلينَ حَيْثُ لا يَلْحَقُهُ لاحِقٌ وَلا يَفُوقُهُ فائِقٌ وَلا يَسْبِقُهُ سابِقٌ وَلا يَطْمَعُ فى اِدْراكِهِ طامِعٌ حَتّى لا يَبْقى مَلَكٌ مُقَرَّبٌ وَلا نَبِىٌّ مُرْسَلٌ وَلا صِدّيقٌ وَلا شَهيدٌ وَلا عالِمٌ وَلا جاهِلٌ وَلا دَنِىٌّ وَلا فاضِلٌ وَلا مُؤْمِنٌ صالِحٌ وَلا فِاجِرٌ طالِحٌ وَلاجَبّارٌ عَنيدٌ وَلا شَيْطانٌ مَريدٌ وَلا خَلْقٌ فيما بَيْنَ ذلِكَ شَهيدٌ اِلاّ عَرَّفَهُمْ جَلالَةَ اَمْرِكُمْ وَعِظَمَ خَطَرِكُمْ وَكِبَرَ شَأنِكُمْ وَتَمامَ نُورِكُمْ وَصِدْقَ مَقاعِدِكُمْ وَثَباتَ مَقامِكُمْ وَشَرَفَ مَحَلِّكُمْ وَمَنْزِلَتِكُمْ عِنْدَهُ وَكَرامَتَكُمْ عَلَيْهِ وَخاصَّتَكُمْ لَدَيْهِ وَقُرْبَ مَنْزِلَتِكُمْ مِنْهُ . بِاَبى اَنْتُمْ وَاُمّى وَاَهْلى وَمالى وَاُسْرَتى اُشْهِدُ اللهَ وَاُشْهِدُكُمْ اَنّى مُؤْمِنٌ بِكُمْ وَبِما آمَنْتُمْ بِهِ كافِرٌ بِعَدُوِّكُمْ وَبِما كَفَرْتُمْ بِهِ مُسْتَبْصِرٌ بِشَأنِكُمْ وَبِضَلالَةِ مَنْ خالَفَكُمْ مُوالٍ لَكُمْ وَلاَِوْلِيائِكُمْ مُبْغِضٌ لاَِعْدائِكُمْ وَمُعادٍ لَهُمْ سِلْمٌ لِمَنْ سالَمَكُمْ وَحَرْبٌ لِمَنْ حارَبَكُمْ مُحَقِّقٌ لِما حَقَّقْتُمْ مُبْطِلٌ لِما اَبْطَلْتُمْ مُطيعٌ لَكُمْ عارِفٌ بِحَقِّكُمْ مُقِرٌّ بِفَضْلِكُمْ مُحْتَمِلٌ لِعِلْمِكُمْ مُحْتَجِبٌ بِذِمَّتِكُمْ مُعْتَرِفٌ بِكُمْ مُؤْمِنٌ بِاِيابِكُمْ مُصَدِّقٌ بِرَجْعَتِكُمْ مُنْتَظِرٌ لاَِمْرِكُمْ مُرْتَقِبٌ لِدَوْلَتِكُمْ آخِذٌ بِقَوْلِكُمْ عامِلٌ بِاَمْرِكُمْ مُسْتَجيرٌ بِكُمْ زائِرٌ لَكُمْ لائِذٌ عائِذٌ بِقُبُورِكُمْ مُسْتَشْفِعٌ اِلَى اللهِ عَزَّوَجَلَّ بِكُمْ وَمُتَقَرِّبٌ بِكُمْ اِلَيْهِ وَمُقَدِّمُكُمْ اَمامَ طَلِبَتى وَحَوائِجى وَاِرادَتى فى كُلِّ اَحْوالي وَاُمُورى مُؤْمِنٌ بِسِرِّكُمْ وَعَلانِيَتِكُمْ وَشاهِدِكُمْ وَغائِبِكُمْ وَاَوَّلِكُمْ وَآخِرِكُمْ وَمُفَوِّضٌ فى ذلِكَ كُلِّهِ اِلَيْكُمْ وَمُسَلِّمٌ فيهِ مَعَكُمْ ، وَقَلْبى لَكُمْ مُسَلِّمٌ وَرَأيى لَكُمْ تَبَعٌ وَنُصْرَتى لَكُمْ مُعَدَّةٌ حَتّى يُحْيِىَ اللهُ تَعالى دينَهُ بِكُمْ وَيَرُدَّكُمْ فى اَيّامِهِ وَيُظْهِرَكُمْ لِعَدْلِهِ وَيُمَكِّنَكُمْ فى اَرْضِهِ ، فَمَعَكُمْ مَعَكُمْ لا مَعَ غَيْرِكُمْ آمَنْتُ بِكُمْ وَتَوَلَّيْتُ آخِرَكُمْ بِما تَوَلَّيْتُ بِهِ اَوَّلَكُمْ وَبَرِئْتُ اِلَى اللهِ عَزَّوَجَلَّ مِنْ اَعْدائِكُمْ وَمِنَ الْجِبْتِ وَالطّاغُوتِ وَالشَّياطينِ وَحِزْبِهِمُ الظّالِمينَ لَكُمُ الْجاحِدينَ لِحَقِّكُمْ وَالْمارِقينَ مِنْ وِلايَتِكُمْ وَالْغاصِبينَ لاِرْثِكُمُ الشّاكّينَ فيكُمُ الْمُنْحَرِفينَ عَنْكُمْ وَمِنْ كُلِّ وَليجَةٍ دُونَكُمْ وَكُلِّ مُطاعٍ سِواكُمْ وَمِنَ الاَئِمَّةِ الَّذينَ يَدْعُونَ اِلَى النّارِ ، فَثَبَّتَنِىَ اللهُ اَبَداً ما حَييتُ عَلى مُوالاتِكُمْ وَمَحَبَّتِكُمْ وَدينِكُمْ وَوَفَّقَنى لِطاعَتِكُمْ وَرَزَقَنى شَفاعَتَكُمْ وَجَعَلَنى مِنْ خِيارِ مَواليكُمْ التّابِعينَ لِما دَعَوْتُمْ اِلَيْهِ وَجَعَلَنى مِمَّنْ يَقْتَصُّ آثارَكُمْ وَيَسْلُكُ سَبيلَكُمْ وَيَهْتَدى بِهُداكُمْ وَيُحْشَرُ فى زُمْرَتِكُمْ وَيَكِرُّ فى رَجْعَتِكُمْ وَيُمَلَّكُ فى دَوْلَتِكُـمْ وَيُشَـرَّفُ فى عافِيَتِكُمْ وَيُمَكَّنُ فى اَيّامِكُمْ وَتَقِرُّ عَيْنُهُ غَداً بِرُؤْيَتِكُمْ ، بِاَبى اَنْتُمْ وَاُمّى وَنَفْسى وَاَهْلى وَمالى مَنْ اَرادَ اللهَ بَدَأَ بِكُمْ وَمَنْ وَحَّدَهُ قَبِلَ عَنْكُمْ وَمَنْ قَصَدَهُ تَوَجَّهَ بِكُمْ . مَوالِىَّ لا اُحْصى ثَنائَكُمْ وَلا اَبْلُغُ مِنَ الْمَدْحِ كُنْهَكُمْ وَمِنَ الْوَصْفِ قَدْرَكُمْ وَاَنْتُمْ نُورُ الاَخْيارِ وَهُداةُ الاَبْرارِ وَحُجَجُ الْجَبّارِ ، بِكُمْ فَتَحَ اللهُ وَبِكُمْ يَخْتِمُ وَبِكُمْ يُنَزِّلُ الْغَيْثَ وَبِكُمْ يُمْسِكُ السَّماءَ اَنْ تَقَعَ عَلَى الاَرْضِ اِلاّ بِاِذْنِهِ وَبِكُمْ يُنَفِّسُ الْهَمَّ وَيَكْشِفُ الضُّرَّ ، وَعِنْدَكُمْ ما نَزَلَتْ بِهِ رُسُلُهُ وَهَبَطَتْ بِهِ مَلائِكَتُهُ وَاِلى جَدِّكُمْ (وإن كانت الزّيارة لأمير المؤمنين عليه السلام فعوض وَاِلى جَدِّكُمْ قُل: وَاِلى اَخيكَ) بُعِثَ الرُّوحُ الاَمينُ ، آتاكُمُ اللهُ ما لَمْ يُؤْتِ اَحَداً مِنَ الْعالَمينَ ، طَأطَاَ كُلُّ شَريفٍ لِشَرَفِكُمْ وَبَخَعَ كُلُّ مُتَكَبِّرٍ لِطاعَتِكُمْ وَخَضَعَ كُلُّ جَبّارٍ لِفَضْلِكُمْ وَذَلَّ كُلُّ شَىْءٍ لَكُمْ وَاَشْرَقَتِ الاَرْضُ بِنُورِكُمْ وَفازَ الْفائِزُونَ بِوِلايَتِكُمْ ، بِكُمْ يُسْلَكُ اِلَى الرِّضْوانِ وَعَلى مَنْ جَحَدَ وِلايَتَكُمْ غَضَبُ الرَّحْمنِ . بِاَبى اَنْتُمْ وَاُمّى وَنَفسى وَاَهْلى وَمالى ذِكْرُكُمْ فِى الذّاكِرينَ وَاَسْماؤُكُمْ فِى الاَسْماءِ وَاَجْسادُكُمْ فِى الاَجْسادِ وَاَرْواحُكُمْ فِى الاَْرْواحِ وَاَنْفُسُكُمْ فِى النُّفُوسِ وَآثارُكُمْ فِى الاْثارِ وَقُبُورُكُمْ فِى الْقُبُورِ ، فَما اَحْلى اَسْمائَكُمْ وَاَكْرَمَ اَنْفُسَكُمْ وَاَعْظَمَ شَأنَكُمْ وَاَجَلَّ خَطَرَكُمْ وَاَوْفى عَهْدَكُمْ وَاَصْدَقَ وَعْدَكُمْ ، كَلامُكُمْ نُورٌ وَاَمْرُكُمْ رُشْدٌ وَوَصِيَّتُكُمُ التَّقْوى وَفِعْلُكُمُ الْخَيْرُ وَعادَتُكُمُ الاِحْسانُ وَسَجِيَّتُكُمُ الْكَرَمُ وَشَأنُكُمُ الْحَقُّ وَالصِّدْقُ وَالرِّفْقُ وَقَوْلُكُمْ حُكْمٌ وَحَتْمٌ وَرَأيُكُمْ عِلْمٌ وَحِلْمٌ وَحَزْمٌ ، اِنْ ذُكِرَ الْخَيْرُ كُنْتُمْ اَوَّلَهُ وَاَصْلَهُ وَفَرْعَهُ وَمَعْدِنَهُ وَمَأويهُ وَمُنْتَهاهُ . بِاَبى اَنْتُمْ وَاُمّى وَنَفْسى كَيْفَ اَصِفُ حُسْنَ ثَنائِكُمْ وَاُحْصى جَميلَ بَلائِكُمْ وَبِكُمْ اَخْرَجَنَا اللهُ مِنَ الذُّلِّ وَفَرَّجَ عَنّا غَمَراتِ الْكُرُوبِ وَاَنْقَذَنا مِنْ شَفا جُرُفِ الْهَلَكاتِ وَمِنَ النّارِ ، بِاَبى اَنْتُمْ وَاُمّى وَنَفْسى بِمُوالاتِكُمْ عَلَّمَنَا اللهُ مَعالِمَ دِينِنا وَاَصْلَحَ ماكانَ فَسَدَ مِنْ دُنْيانا وَبِمُوالاتِكُمْ تَمَّتِ الْكَلِمَةُ وَعَظُمَتِ النِّعْمَةُ وَائْتَلَفَتِ الْفُرْقَةُ وَبِمُوالاتِكُمْ تُقْبَلُ الطّاعَةُ الْمُفْتَرَضَةُ وَلَكُمُ الْمَوَدَّةُ الْواجِبَةُ وَالدَّرَجاتُ الرَّفيعَةُ وَالْمَقامُ الَمحْمُودُ وَالْمَكانُ الْمَعْلُومُ عِنْدَ اللهِ عَزَّوَجَلَّ وَالْجاهُ الْعَظيمُ وَالشَّأنُ الْكَبيرُ وَالشَّفاعَةُ الْمَقْبُولَةُ . رَبَّنا آمَنّا بِما اَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنا مَعَ الشّاهِدينَ ، رَبَّنا لا تُزِغْ قُلُوبَنا بَعْدَ اِذْ هَدَيْتَنا وَهَبْ لَنا مِنْ لَدُنْكَ رَحْمَةً اِنَّكَ اَنْتَ الْوَهّابُ ، سُبْحانَ رَبِّنا اِنْ كانَ وَعْدُ رَبِّنا لَمَفْعُولاً . يا وَلِىَّ اللهِ اِنَّ بَيْنى وَبيْنَ اللهِ عَزَّوَجَلَّ ذُنُوباً لا يَأتى عَلَيْها اِلاّ رِضاكُمْ فَبِحَقِّ مَنِ ائْتَمَنَكُمْ عَلى سِرِّهِ وَاسْتَرْعاكُمْ اَمْرَ خَلْقِهِ وَقَرَنَ طاعَتَكُمْ بِطاعَتِهِ لَمَّا اسْتَوْهَبْتُمْ ذُنُوبى وَكُنْتُمْ شُفَعائى ، فَاِنّى لَكُمْ مُطيعٌ مَنْ اَطاعَكُمْ فَقَدْ اَطاعَ اللهَ وَمَنْ عَصاكُمْ فَقَدْ عَصَى اللهَ وَمَنْ اَحَبَّكُمْ فَقَدْ اَحَبَّ اللهَ وَمَنْ اَبْغَضَكُمْ فَقَدْ اَبْغَضَ اللهَ . اَللّـهُمَّ اِنّى لَوْ وَجَدْتُ شُفَعاءَ اَقْرَبَ اِلَيْكَ مِنْ مُحَمَّدٍ وَاَهْلِ بَيْتِهِ الاَخْيارِ الاَئِمَّةِ الاَبْرارِ لَجَعَلْتُهُمْ شُفَعائي ، فَبِحَقِّهِمُ الَّذى اَوْجَبْتَ لَهُمْ عَلَيْكَ اَسْاَلُكَ اَنْ تُدْخِلَنى فى جُمْلَةِ الْعارِفينَ بِهِمْ وَبِحَقِّهِمْ وَفى زُمْرَةِ الْمَرْحُومينَ بِشَفاعَتِهِمْ اِنَّكَ اَرْحَمُ الرّاحِمينَ ، وَصَلَّى اللهُ عَلى مُحَمَّدٍ وَآلِهِ الطّاهِرينَ وَسَلَّمَ تَسْليماً كَثيراً وَحَسْبُنَا اللهُ وَنِعْـمَ الْوَكيلُ .''',
    ),
  ];

  static List<IslamicOccasion> getCustomOccasions(HijriDate date, List<IslamicOccasion> defaults) {
    int monthNumber = date.month.index + 1;
    if (monthNumber == 2 || monthNumber == 3 || monthNumber == 4 || monthNumber == 5) {
      final ourEvents = events.where((e) => e.day == date.day && e.month == monthNumber);
      if (ourEvents.isNotEmpty) {
        return ourEvents.map((e) => IslamicOccasion(
          day: e.day,
          month: e.month,
          arabicName: e.title,
          englishName: e.title,
          type: e.isMartyrdom ? OccasionType.martyrdom : OccasionType.religious,
        )).toList();
      }
      return []; // Return empty if we override the whole month and there is no event for this day.
    }
    return defaults;
  }

  static List<HijriEvent> events = [
    // ==========================================
    // شهر محرم الحرام (1)
    // ==========================================
    HijriEvent(
      day: 1,
      month: 1,
      title: "رأس السنة الهجرية",
      description:
          "بداية العام الهجري الجديد، وتخيم الحزن ببدء شهر العزاء والمصاب على سيد الشهداء الحسين (ع).",
      recommendedActs:
          "الصوم (يكفر ذنوب سنة)، وقراءة دعاء أول محرم المأثور، والتوجه لمجالس العزاء.",
    ),
    HijriEvent(
      day: 2,
      month: 1,
      title: "وصول الإمام الحسين (ع) إلى كربلاء",
      description:
          "ذكرى نزول ركب الإمام الحسين (ع) وأهل بيته وأصحابه الأوفياء أرض كربلاء عام 61 هـ.",
      recommendedActs:
          "الإكثار من الصلاة على محمد وآل محمد، والبدء في استذكار آلام ومصائب كربلاء.",
    ),
    HijriEvent(
      day: 3,
      month: 1,
      title: "نزول الإمام الحسين (ع) في نينوى",
      description:
          "ذكرى نزول الإمام الحسين (ع) في أرض نينوى بكربلاء، حيث قال: هذه كربلاء، كرب وبلاء.",
      recommendedActs:
          "استذكار مواقف الإمام الحسين (ع) وأصحابه الأوفياء، والإكثار من الدعاء.",
    ),
    HijriEvent(
      day: 6,
      month: 1,
      title: "شهادة حبيب بن مظاهر الأسدي (رض)",
      description:
          "ذكرى استشهاد الصحابي الجليل حبيب بن مظاهر الأسدي، من أنصار الإمام الحسين (ع) الأوفياء وحامل رايته في كربلاء.",
      recommendedActs:
          "قراءة سيرة حبيب بن مظاهر واستلهام الوفاء والثبات على الحق من مواقفه البطولية.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 7,
      month: 1,
      title: "منع الماء عن معسكر الإمام الحسين (ع)",
      description:
          "ذكرى منع معسكر يزيد الماء عن الحسين وأهل بيته وأطفاله وعياله في أرض الطف بكربلاء.",
      recommendedActs:
          "استذكار عطش أطفال الحسين والمواساة، والتضرع بالدعاء وقراءة المأثور من الأدعية.",
    ),
    HijriEvent(
      day: 8,
      month: 1,
      title: "شهادة القاسم بن الحسن (ع) - يوم التروية",
      description:
          "يوم التروية، وذكرى استشهاد القاسم بن الإمام الحسن المجتبى (ع) عريس كربلاء وهو شاب يافع في واقعة الطف.",
      recommendedActs:
          "البكاء ومواساة أهل البيت (ع) واستذكار تضحية القاسم الشاب في نصرة الحق.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 9,
      month: 1,
      title: "شهادة الحر بن يزيد الرياحي (رض)",
      description:
          "ذكرى توبة واستشهاد الحر بن يزيد الرياحي الذي التحق بمعسكر الإمام الحسين (ع) وقاتل بين يديه حتى نال الشهادة.",
      recommendedActs:
          "التأمل في قصة التوبة والعودة للحق، والدعاء بالثبات على الولاية.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 10,
      month: 1,
      title: "عاشوراء الحسين (ع)",
      description:
          "ذكرى شهادة أبي الأحرار الإمام الحسين بن علي وأهل بيته وأصحابه (عليهم السلام) في كربلاء عام 61 هـ. وفيه استشهد علي الأكبر وعبد الله الرضيع والعباس (ع) وجميع الأنصار.",
      recommendedActs:
          "زيارة عاشوراء، إقامة مجالس العزاء، البكاء، الإمساك عن الطعام والشراب حزناً دون نية الصوم، والتعزية.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 11,
      month: 1,
      title: "سبي أهل بيت الحسين (ع)",
      description:
          "ذكرى سبي عيال الإمام الحسين (ع) من نساء وأطفال بعد واقعة كربلاء، وحرق الخيام، وأخذهم أسرى إلى الكوفة.",
      recommendedActs:
          "البكاء ومواساة أهل البيت (ع) واستذكار ما جرى على السيدة زينب والإمام السجاد (ع).",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 13,
      month: 1,
      title: "دفن شهداء كربلاء",
      description:
          "ذكرى دفن أجساد شهداء كربلاء الطاهرة على يد قبيلة بني أسد بإرشاد الإمام السجاد (ع).",
      recommendedActs:
          "زيارة الشهداء وقراءة الفاتحة على أرواحهم الطاهرة والدعاء لهم.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 24,
      month: 1,
      title: "شهادة رشيد الهجري (رض)",
      description:
          "ذكرى استشهاد الصحابي الجليل رشيد الهجري، من أصحاب أمير المؤمنين والإمام الحسن والإمام الحسين (ع)، قطع عبيد الله بن زياد يديه ورجليه ولسانه لثباته على حب علي (ع).",
      recommendedActs:
          "استذكار صبر وركوع وثبات رشيد الهجري على خط الولاية والتضحية في سبيل الحق.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 25,
      month: 1,
      title: "شهادة الإمام السجاد (ع)",
      description:
          "ذكرى استشهاد سيد الساجدين وزين العابدين الإمام علي بن الحسين (عليهما السلام) بالسم بسنة 95 هـ.",
      recommendedActs:
          "زيارة الإمام السجاد (ع)، التصدق، وقراءة الأدعية من الصحيفة السجادية المباركة.",
      isMartyrdom: true,
    ),

    // ==========================================
    // شهر صفر الخير (2)
    // ==========================================
    HijriEvent(
      day: 1,
      month: 2,
      title: "واقعة معركة صفين سنة ٣٧هـ",
      description: "واقعة معركة صفين سنة ٣٧هـ",
      recommendedActs: "",
    ),
    HijriEvent(
      day: 2,
      month: 2,
      title: "شهادة زيد بن علي بن الحسين (عليه السلام) سنة ١٢١هـ",
      description: "شهادة زيد بن علي بن الحسين (عليه السلام) سنة ١٢١هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 3,
      month: 2,
      title: "ولادة الإمام محمد الباقر ( عليه السلام) سنة ٥٧ هـ على رواية",
      description:
          "ولادة الإمام محمد الباقر ( عليه السلام) سنة ٥٧ هـ على رواية",
      recommendedActs: "",
    ),
    HijriEvent(
      day: 5,
      month: 2,
      title: "شهادة السيدة رقية بنت الإمام الحسين (عليهما السلام) سنة ٦١هـ في خربة الشام بعد أن احظر لها رأس ابيها الشريف",
      description:
          "شهادة السيدة رقية بنت الإمام الحسين (عليهما السلام) سنة ٦١هـ في خربة الشام بعد أن احظر لها رأس ابيها الشريف",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 7,
      month: 2,
      title: "شهادة سبط الرسول الاكرم الإمام الحسن بن علي المجتى (عليهما السلام) مسموماً عام 50 هـ.",
      description:
          "شهادة سبط الرسول الاكرم الإمام الحسن بن علي المجتى (عليهما السلام) مسموماً عام 50 هـ.",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 8,
      month: 2,
      title: "وفاة الصحابي الجليل سلمان المحمدي الفارسي (رضوان الله عليه) سنة ٣٥هـ",
      description:
          "وفاة الصحابي الجليل سلمان المحمدي الفارسي (رضوان الله عليه) سنة ٣٥هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 9,
      month: 2,
      title: "شهادة الصحابي الجليل عمار بن ياسر (رضوان الله عليه) في معركة صفين سنة ٣٧هـ",
      description:
          "شهادة الصحابي الجليل عمار بن ياسر (رضوان الله عليه) في معركة صفين سنة ٣٧هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 17,
      month: 2,
      title: "شهادة الإمام علي بن موسى الرضا (عليهما السلام) مسموماً على رواية سنة ٢٠٣هـ",
      description:
          "شهادة الإمام علي بن موسى الرضا (عليهما السلام) مسموماً على رواية سنة ٢٠٣هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 20,
      month: 2,
      title: "عودة السبايا من آل بيت النبي ( عليهم السلام) مع الرؤوس الشريفة إلى أرض كربلاء سنة ٦١هـ",
      description:
          "عودة السبايا من آل بيت النبي (عليهم السلام) مع الرؤوس الشريفة إلى أرض كربلاء سنة ٦١هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 28,
      month: 2,
      title: "شهادة خاتم الأنبياء والمرسلين النبي الاعظم محمد (صلى الله عليه واله وسلم) سنة ١١هـ",
      description:
          "شهادة خاتم الأنبياء والمرسلين النبي الاعظم محمد (صلى الله عليه واله وسلم) سنة ١١هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    // ==========================================
    // شهر ربيع الأول (3)
    // ==========================================
    HijriEvent(
      day: 1,
      month: 3,
      title: "مبيت أمير المؤمنين الامام علي (عليه السلام) في فراش النبي الأكرم محمد (صلى الله عليه واله وسلم) وهجرة النبي الى المدينة المنورة",
      description:
          "مبيت أمير المؤمنين الامام علي (عليه السلام) في فراش النبي الأكرم محمد (صلى الله عليه واله وسلم) وهجرة النبي الى المدينة المنورة",
      recommendedActs: "استذكار تضحية الإمام علي (ع) وشجاعته في ليلة المبيت، والصلاة على محمد وآل محمد.",
    ),
    HijriEvent(
      day: 3,
      month: 3,
      title: "إحراق الكعبة المشرفة بالمنجنيق بأمر من حصين بن نمير قائد جيش يزيد سنة 64هـ",
      description:
          "إحراق الكعبة المشرفة بالمنجنيق بأمر من حصين بن نمير قائد جيش يزيد سنة 64هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 4,
      month: 3,
      title: "خروج رسول الله محمد (صلى الله عليه واله وسلم) من غار ثور متوجها الى المدينة المنورة في السنة الأولى من الهجرة",
      description:
          "خروج رسول الله محمد (صلى الله عليه واله وسلم) من غار ثور متوجها الى المدينة المنورة في السنة الأولى من الهجرة",
      recommendedActs: "",
    ),
    HijriEvent(
      day: 5,
      month: 3,
      title: "وفاة السيدة سكينة بنت الإمام الحسين (عليهما السلام) سنة ١١٧هـ",
      description:
          "وفاة السيدة سكينة بنت الإمام الحسين (عليهما السلام) سنة ١١٧هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 8,
      month: 3,
      title: "شهادة الإمام الحسن العسكري (عليه السلام) على رواية سنة ٢٦٠هـ",
      description:
          "شهادة الإمام الحسن العسكري (عليه السلام) على رواية سنة ٢٦٠هـ",
      recommendedActs: "زيارة الإمام العسكري (ع)، وتعزية ابنه الحجة القائم المهدي (عج) في مصابه الصعب.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 9,
      month: 3,
      title: "بدء إمامة الحجة القائم (عج)",
      description:
          "عيد الغدير الثاني، ذكرى تتويج الإمام المهدي المنتظر (عج) بالولاية والإمامة الإلهية وتوليه أمر العباد.",
      recommendedActs:
          "الإكثار من الدعاء بتعجيل الفرج، قراءة دعاء العهد، التصدق حباً وسلامة للإمام المهدي (عج).",
    ),
    HijriEvent(
      day: 10,
      month: 3,
      title: "زواج النبي الأكرم محمد (صلي الله عليه واله وسلم من السيدة خديجة الكبرى ( عليها السلام) سنة ٢٨ قبل الهجرة",
      description:
          "زواج النبي الأكرم محمد (صلي الله عليه واله وسلم من السيدة خديجة الكبرى ( عليها السلام) سنة ٢٨ قبل الهجرة",
      recommendedActs: "",
    ),
    HijriEvent(
      day: 12,
      month: 3,
      title: "المولد النبوي الشريف (عند أهل السنة)",
      description:
          "ذكرى ميلاد النبي الأكرم محمد (ص) على رواية أهل السنة وأسبوع الوحدة الإسلامية.",
      recommendedActs: "إظهار الفرح والسرور والتصدق وتعزيز الوحدة الإسلامية.",
    ),
    HijriEvent(
      day: 17,
      month: 3,
      title: "ولادة سيد الرسل والمخلوقات النبي الاعظم محمد ( صلى الله عليه واله وسلم) سنة 53 قبل الهجرة وولادة الامام جعفر الصادق عليه السلام",
      description:
          "ولادة سيد الرسل والمخلوقات النبي الاعظم محمد ( صلى الله عليه واله وسلم) سنة 53 قبل الهجرة وولادة الامام جعفر الصادق عليه السلام",
      recommendedActs:
          "الغسل، الصوم، زيارة النبي (ص) عن قرب أو بعد، التصدق، وإظهار الفرح وسرور أهل البيت.",
    ),
    HijriEvent(
      day: 22,
      month: 3,
      title: "غزوة بني النضير سنة ٤هـ",
      description:
          "غزوة بني النضير سنة ٤هـ",
      recommendedActs: "",
    ),
    HijriEvent(
      day: 25,
      month: 3,
      title: "استشهاد سعيد بن جبير (رضوان الله عليه على يد الحجاج سنة ٩٥هـ",
      description:
          "استشهاد سعيد بن جبير (رضوان الله عليه على يد الحجاج سنة ٩٥هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 26,
      month: 3,
      title: "إبرام معاهدة الصلح بين الإمام الحسن (عليه السلام) ومعاوية بن أبي سفيان سنة ٤١ هـ",
      description:
          "إبرام معاهدة الصلح بين الإمام الحسن (عليه السلام) ومعاوية بن أبي سفيان سنة ٤١ هـ",
      recommendedActs: "",
    ),

    // ==========================================
    // شهر ربيع الثاني (4)
    // ==========================================
    HijriEvent(
      day: 8,
      month: 4,
      title: "شهادة سيدة نساء العالمين فاطمة الزهراء (عليها السلام) سنة ١١هـ على رواية",
      description: "شهادة سيدة نساء العالمين فاطمة الزهراء (عليها السلام) سنة ١١هـ على رواية",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 10,
      month: 4,
      title: "ولادة الإمام الحسن العسكري (عليه السلام) سنة ٢٣٢هـ على رواية",
      description: "ولادة الإمام الحسن العسكري (عليه السلام) سنة ٢٣٢هـ على رواية",
      recommendedActs: "",
    ),
    HijriEvent(
      day: 10,
      month: 4,
      title: "وفاة السيدة فاطمة المعصومة بنت الإمام موسى الكاظم ( عليهما السلام) سنة ٢٠١هـ على رواية",
      description: "وفاة السيدة فاطمة المعصومة بنت الإمام موسى الكاظم ( عليهما السلام) سنة ٢٠١هـ على رواية",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 14,
      month: 4,
      title: "خروج المختار الثقفي (رضوان الله عليه ) في الكوفة للأخذ بثأر الإمام الحسين (عليه السلام) سنة ٦٦هـ",
      description: "خروج المختار الثقفي (رضوان الله عليه ) في الكوفة للأخذ بثأر الإمام الحسين (عليه السلام) سنة ٦٦هـ",
      recommendedActs: "",
    ),

    // ==========================================
    // شهر جمادى الأولى (5)
    // ==========================================
    HijriEvent(
      day: 5,
      month: 5,
      title: "ولادة السيدة زينب الكبرى بنت امير المؤمنين الإمام علي (عليهما السلام) سنة ٥هـ",
      description: "ولادة السيدة زينب الكبرى بنت امير المؤمنين الإمام علي (عليهما السلام) سنة ٥هـ",
      recommendedActs: "",
    ),
    HijriEvent(
      day: 6,
      month: 5,
      title: "حرب مؤته واستشهاد جعفر بن أبي طالب (عليه السلام) سنة ٨هـ",
      description: "حرب مؤته واستشهاد جعفر بن أبي طالب (عليه السلام) سنة ٨هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 10,
      month: 5,
      title: "واقعة الجمل سنة ٣٦هـ",
      description: "واقعة الجمل سنة ٣٦هـ",
      recommendedActs: "",
    ),
    HijriEvent(
      day: 13,
      month: 5,
      title: "شهادة سيدة نساء العالمين فاطمة الزهراء ( عليها السلام) سنة الهـ على رواية",
      description: "شهادة سيدة نساء العالمين فاطمة الزهراء ( عليها السلام) سنة الهـ على رواية",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 15,
      month: 5,
      title: "فتح البصرة على يد أمير المؤمنين الامام علي (عليه السلام) سنة ٣٦هـ",
      description: "فتح البصرة على يد أمير المؤمنين الامام علي (عليه السلام) سنة ٣٦هـ",
      recommendedActs: "",
    ),
    HijriEvent(
      day: 19,
      month: 5,
      title: "شهادة زيد بن صوحان رضوان الله عليه) في حرب الجمل سنة ٣٦هـ",
      description: "شهادة زيد بن صوحان رضوان الله عليه) في حرب الجمل سنة ٣٦هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 22,
      month: 5,
      title: "وفاة القاسم بن الإمام موسى الكاظم (عليهما السلام) سنة ١٩٢هـ على رواية",
      description: "وفاة القاسم بن الإمام موسى الكاظم (عليهما السلام) سنة ١٩٢هـ على رواية",
      recommendedActs: "",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 30,
      month: 5,
      title: "وفاة محمد بن عثمان بن سعيد الخلاني (رضوان الله عليه) السفير الثاني للإمام المهدي المنتظر (عجل الله فرجه الشريف ) سنة ٣٠٤هـ",
      description: "وفاة محمد بن عثمان بن سعيد الخلاني (رضوان الله عليه) السفير الثاني للإمام المهدي المنتظر (عجل الله فرجه الشريف ) سنة ٣٠٤هـ",
      recommendedActs: "",
      isMartyrdom: true,
    ),

    // ==========================================
    // شهر جمادى الآخرة (6)
    // ==========================================
    HijriEvent(
      day: 3,
      month: 6,
      title: "شهادة السيدة فاطمة الزهراء (ع) - الرواية الشهيرة",
      description:
          "الأيام الفاطمية الثانية والشهيرة، ذكرى شهادة سيدة نساء العالمين الصديقة الكبرى فاطمة الزهراء (ع) بعد معاناة من الظلم بعد أبيها (ص).",
      recommendedActs:
          "زيارة السيدة الزهراء المخصوصة، البكاء وإقامة العزاء، إطعام الطعام مواساة وتضامناً.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 20,
      month: 6,
      title: "مولد السيدة فاطمة الزهراء (ع)",
      description:
          "ذكرى ولادة سيدة نساء العالمين من الأولين والآخرين أم أبيها فاطمة الزهراء (عليها السلام) سنة 5 بعد البعثة.",
      recommendedActs:
          "الصوم، الغسل، التصدق، الفرح وتقديم التهاني والهدية للوالدين والمؤمنات.",
    ),
    HijriEvent(
      day: 22,
      month: 6,
      title: "شهادة كميل بن زياد النخعي (رض)",
      description:
          "ذكرى استشهاد التابعي الجليل كميل بن زياد النخعي صاحب أمير المؤمنين (ع) وراوي دعاء كميل الشريف على يد الحجاج.",
      recommendedActs:
          "قراءة دعاء كميل المبارك واستذكار سيرة هذا العالم الرباني الشجاع.",
      isMartyrdom: true,
    ),

    // ==========================================
    // شهر رجب الأصب (7)
    // ==========================================
    HijriEvent(
      day: 1,
      month: 7,
      title: "مولد الإمام محمد الباقر (ع)",
      description:
          "ذكرى ولادة باقر علوم الأولين والآخرين الإمام محمد بن علي الباقر (عليهما السلام) بالمدينة المنورة سنة 57 هـ.",
      recommendedActs:
          "الدعاء والأعمال العبادية العامة لشهر رجب، والصوم لابتداء الشهر الأصب العظيم.",
    ),
    HijriEvent(
      day: 3,
      month: 7,
      title: "شهادة الإمام علي الهادي (ع)",
      description:
          "ذكرى شهادة عاشر أئمة أهل البيت الإمام علي بن محمد الهادي (عليه السلام) مسموماً بسر من رأى عام 254 هـ.",
      recommendedActs:
          "زيارة الإمام علي الهادي (ع)، وإقامة مجالس الحزن لتوضيح علمه وجهاده المبارك.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 10,
      month: 7,
      title: "مولد الإمام محمد الجواد (ع)",
      description:
          "ذكرى ولادة تاسع أئمة الهدى الإمام محمد بن علي الجواد (عليه السلام) باب المراد سنة 195 هـ.",
      recommendedActs:
          "تقديم الصدقة، طلب التوفيق وتيسير الحوائج ببركة باب المراد الجواد (ع) الفياضة.",
    ),
    HijriEvent(
      day: 12,
      month: 7,
      title: "وفاة أبي طالب (ع) عم النبي (ص)",
      description:
          "ذكرى وفاة ناصر الإسلام وحامي النبي (ص) أبي طالب بن عبد المطلب (ع) كافل الرسول ومؤمن قريش.",
      recommendedActs:
          "استذكار مواقف أبي طالب (ع) في نصرة الإسلام والدفاع عن النبي (ص).",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 13,
      month: 7,
      title: "ميلاد أمير المؤمنين علي (ع)",
      description:
          "ذكرى ولادة أسد الله الغالب الإمام علي بن أبي طالب (عليه السلام) وليد الكعبة الشريفة وسيد الأوصياء.",
      recommendedActs:
          "الغسل، الصوم، التصدق، وزيارة أمين الله للوليد المبارك والتوسل والإبتهاج الفخم.",
    ),
    HijriEvent(
      day: 15,
      month: 7,
      title: "وفاة السيدة زينب الكبرى (ع) - رواية ثانية",
      description:
          "ذكرى وفاة بطلة كربلاء السيدة زينب بنت أمير المؤمنين (ع) على رواية أخرى.",
      recommendedActs:
          "زيارة السيدة زينب (ع) واستذكار خطبها الخالدة ومواقفها البطولية.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 24,
      month: 7,
      title: "فتح خيبر على يد أمير المؤمنين (ع)",
      description:
          "ذكرى فتح حصن خيبر على يد الإمام علي بن أبي طالب (ع) بعد أن عجز عنه غيره، وقلع باب الحصن.",
      recommendedActs:
          "استذكار شجاعة أمير المؤمنين (ع) وقوته الإلهية، والإكثار من الصلاة على محمد وآل محمد.",
    ),
    HijriEvent(
      day: 25,
      month: 7,
      title: "شهادة الإمام موسى الكاظم (ع)",
      description:
          "ذكرى استشهاد باب الحوائج الإمام موسى بن جعفر الكاظم (ع) مظلوماً ومسموماً بقعر السجون عام 183 هـ.",
      recommendedActs:
          "زيارة الإمام الكاظم (ع) المخصوصة، التوجه بالدعاء والتوسل، إقامة مجالس العزاء المهيبة.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 27,
      month: 7,
      title: "عيد المبعث النبوي الشريف",
      description:
          "يوم البعثة النبوية الشريفة المباركة ونزول الوحي جبرائيل (ع) لأول مرة بالرسالة السماوية والقرآن على محمد (ص).",
      recommendedActs:
          "الغسل، الصوم (يعادل صوم 60 سنة)، كثرة الصلاة على محمد وآل محمد، وزيارة أمير المؤمنين (ع).",
    ),
    HijriEvent(
      day: 28,
      month: 7,
      title: "خروج الإمام الحسين (ع) من المدينة",
      description:
          "ذكرى خروج الإمام الحسين (ع) من المدينة المنورة متوجهاً إلى مكة المكرمة رافضاً البيعة ليزيد.",
      recommendedActs:
          "استذكار موقف الإمام الحسين (ع) في رفض الظلم والاستبداد والدعاء.",
    ),

    // ==========================================
    // شهر شعبان المعظم (8)
    // ==========================================
    HijriEvent(
      day: 1,
      month: 8,
      title: "مولد الإمام الحسين (ع) - رواية ثانية",
      description:
          "ذكرى ولادة الإمام الحسين (ع) على رواية أخرى، وبداية شهر شعبان المعظم.",
      recommendedActs: "الصوم والدعاء والتصدق في أول شهر شعبان المبارك.",
    ),
    HijriEvent(
      day: 3,
      month: 8,
      title: "مولد الإمام الحسين (ع)",
      description:
          "ذكرى ولادة سيد الشهداء وريحانة الرسول الأكرم الإمام الحسين بن علي (عليهما السلام) بالمدينة المنورة عام 4 هـ.",
      recommendedActs:
          "الصوم، زيارة الإمام الحسين (ع)، الفرح ولبس الثياب النظيفة والتصدق بنية التوفيق.",
    ),
    HijriEvent(
      day: 4,
      month: 8,
      title: "مولد قمر بني هاشم العباس (ع)",
      description:
          "ذكرى ولادة ساقي عطاشى كربلاء ورمز الوفاء والإباء أبي الفضل العباس بن أمير المؤمنين (عليهما السلام) عام 26 هـ.",
      recommendedActs:
          "إظهار الفرح وحضور مجالس التهاني، استلهام التضحية والوفاء للأخ العقائدي الحسين (ع).",
    ),
    HijriEvent(
      day: 5,
      month: 8,
      title: "مولد الإمام علي بن الحسين السجاد (ع)",
      description:
          "ذكرى ولادة زين العابدين وسيد الساجدين الإمام علي بن الحسين (عليهما السلام) عام 38 هـ.",
      recommendedActs:
          "قراءة أدعية الصحيفة السجادية، المناجاة الخمس عشرة، والتصدق لإعانة الفقراء.",
    ),
    HijriEvent(
      day: 11,
      month: 8,
      title: "مولد علي الأكبر بن الحسين (ع)",
      description:
          "ذكرى ولادة علي الأكبر بن الإمام الحسين (ع) أشبه الناس خَلقاً وخُلقاً ومنطقاً برسول الله (ص).",
      recommendedActs:
          "إظهار الفرح واستذكار سيرة علي الأكبر (ع) وشهادته البطولية في كربلاء.",
    ),
    HijriEvent(
      day: 15,
      month: 8,
      title: "ميلاد الإمام المهدي المنتظر (عج)",
      description:
          "ليلة النصف من شعبان، ذكرى ولادة منقذ البشرية الإمام الحجة بن الحسن العسكري (أرواحنا لتراب مقدمه الفداء) عام 255 هـ.",
      recommendedActs:
          "إحياء هذه الليلة بالعبادة والصلاة، قراءة زيارة الإمام الحسين (ع)، قراءة دعاء كميل، والصوم في يومها.",
    ),

    // ==========================================
    // شهر رمضان المبارك (9)
    // ==========================================
    HijriEvent(
      day: 1,
      month: 9,
      title: "بداية شهر رمضان المبارك",
      description:
          "أول يوم من شهر الله الأعظم، شهر الصيام والقيام ونزول القرآن الكريم وشهر المغفرة والرحمة.",
      recommendedActs:
          "النية الخالصة للصيام، قراءة دعاء دخول شهر رمضان، والبدء بتلاوة القرآن الكريم.",
    ),
    HijriEvent(
      day: 10,
      month: 9,
      title: "وفاة السيدة خديجة الكبرى (ع)",
      description:
          "ذكرى وفاة أم المؤمنين السيدة خديجة بنت خويلد (ع) زوجة النبي (ص) وأول من آمن به من النساء.",
      recommendedActs:
          "استذكار فضائل السيدة خديجة (ع) وتضحياتها في سبيل الإسلام والدعاء.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 15,
      month: 9,
      title: "مولد الإمام الحسن المجتبى (ع)",
      description:
          "ذكرى ولادة سبط المصطفى الأكبر كريم أهل البيت الإمام الحسن بن علي (عليهما السلام) بالمدينة المنورة سنة 3 هـ.",
      recommendedActs:
          "إطعام الصائمين، التصدق بنسبة أعلى، التوسل بكريم أهل البيت لقضاء حوائج المعوزين.",
    ),
    HijriEvent(
      day: 17,
      month: 9,
      title: "معركة بدر الكبرى",
      description:
          "ذكرى انتصار المسلمين بقيادة النبي (ص) في غزوة بدر الكبرى أول معركة فاصلة في تاريخ الإسلام سنة 2 هـ.",
      recommendedActs:
          "استذكار بطولات أمير المؤمنين (ع) وحمزة (ع) في بدر والشكر لله على نصره.",
    ),
    HijriEvent(
      day: 19,
      month: 9,
      title: "ضربة أمير المؤمنين علي (ع)",
      description:
          "الفجيعة الأولى، ضربة الغدر والخيانة بالسيف المسموم على هامة الإمام علي (ع) في محراب الصلاة بمسجد الكوفة بيد المجرم ابن ملجم.",
      recommendedActs:
          "إحياء ليلة القدر الأولى، البكاء والتألم لمصاب الوصي، الاستغفار، وزيارة أمير المؤمنين (ع).",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 21,
      month: 9,
      title: "شهادة أمير المؤمنين الإمام علي (ع)",
      description:
          "رحيل العدالة الإنسانية والوصي الطاهر، ذكرى شهادة الإمام علي بن أبي طالب (عليه السلام) متأثراً بجراحة السيف المسموم.",
      recommendedActs:
          "إحياء ليلة القدر الثانية، إقامة مجالس العزاء، التصدق لليتامى مواساة لأيتام علي (ع).",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 22,
      month: 9,
      title: "شهادة ميثم التمار (رض)",
      description:
          "ذكرى استشهاد الصحابي الجليل ميثم التمار (رضوان الله عليه) صاحب أمير المؤمنين (ع) ومن خيرة أصحابه، صُلب على جذع نخلة في الكوفة بأمر ابن زياد لعنه الله لأنه أبى أن يتبرأ من الإمام علي (ع).",
      recommendedActs:
          "استذكار ثبات ميثم التمار (رض) على الولاية وعدم تبرئه من أمير المؤمنين (ع) حتى الشهادة، والتأسي بإخلاصه.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 23,
      month: 9,
      title: "ليلة القدر المباركة العظيمة",
      description:
          "ليلة القدر الكبرى والنهائية المرجوة، التي تتنزل فيها الملائكة وتكتب مقادير الخلائق طوال العام القادم.",
      recommendedActs:
          "الغسل، إحياء الليل بالدعاء والصلوات، قراءة سورة القدر والعنكبوت والروم، ودعاء الجوشن الكبير.",
    ),

    // ==========================================
    // شهر شوال المكرم (10)
    // ==========================================
    HijriEvent(
      day: 1,
      month: 10,
      title: "عيد الفطر المبارك",
      description:
          "يوم الجائزة الكبرى والبهجة والحمد لله على إتمام صيام شهر رمضان المبارك والعبادة فيه.",
      recommendedActs:
          "صلاة العيد، دفع زكاة الفطرة لمستحقيها (واجبة)، التكبير، صلة الأرحام والبهجة.",
    ),
    HijriEvent(
      day: 8,
      month: 10,
      title: "هدم قبور أئمة البقيع (ع)",
      description:
          "ذكرى هدم قبور أئمة البقيع الأربعة: الإمام الحسن المجتبى والإمام السجاد والإمام الباقر والإمام الصادق (ع) على يد الوهابيين عام 1344 هـ.",
      recommendedActs:
          "إقامة مجالس العزاء واستنكار هذه الجريمة والدعاء لإعادة بناء قبور الأئمة (ع).",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 15,
      month: 10,
      title: "شهادة سيدنا حمزة بن عبد المطلب (ع)",
      description:
          "ذكرى استشهاد أسد الله وأسد رسوله سيد الشهداء حمزة بن عبد المطلب (ع) عم النبي (ص) في غزوة أحد سنة 3 هـ.",
      recommendedActs:
          "استذكار شجاعة حمزة (ع) وتضحيته في نصرة الإسلام، والدعاء.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 15,
      month: 10,
      title: "وفاة السيد عبد العظيم الحسني (ع)",
      description:
          "ذكرى وفاة العالم الجليل والمحدث الورع عبد العظيم الحسني (شاه عبد العظيم) صاحب مقام الري، الذي قال فيه الإمام الهادي (ع): من زار قبره وجبت له الجنة.",
      recommendedActs:
          "زيارة السيد عبد العظيم الحسني (ع) عن بعد، وتلاوة القرآن الكريم حباً ووفاءً له.",
    ),
    HijriEvent(
      day: 25,
      month: 10,
      title: "شهادة الإمام جعفر بن محمد الصادق (ع)",
      description:
          "ذكرى استشهاد رئيس المذهب الجعفري الإمام جعفر بن محمد الصادق (عليهما السلام) بالسم عام 148 هـ بالبقيع.",
      recommendedActs:
          "زيارة الإمام الصادق (ع)، التثقف بمناظراته وأحاديثه الفقهية، وإقامة مجالس الحزن.",
      isMartyrdom: true,
    ),

    // ==========================================
    // شهر ذو القعدة الحرام (11)
    // ==========================================
    HijriEvent(
      day: 1,
      month: 11,
      title: "مولد السيدة فاطمة المعصومة (ع)",
      description:
          "ذكرى ولادة كريمة أهل البيت السيدة فاطمة المعصومة بنت الإمام الكاظم (عليهما السلام) عام 173 هـ.",
      recommendedActs:
          "تقديم الصدقة، وإبداء الفرح، وزيارة كريمة أهل البيت عن بعد أو قرب بنية الشفاعة المضمونة.",
    ),
    HijriEvent(
      day: 11,
      month: 11,
      title: "مولد الإمام علي بن موسى الرضا (ع)",
      description:
          "ذكرى ولادة ثامن الأئمة الأطهار الإمام علي بن موسى الرضا (عليهما السلام) بالمدينة المنورة سنة 148 هـ.",
      recommendedActs:
          "إقامة احتفالات البهجة والسرور وتبيين كراماته ومناظراته العقائدية، وإدخال السرور على العوائل.",
    ),
    HijriEvent(
      day: 21,
      month: 11,
      title: "شهادة حجر بن عدي الكندي (رض)",
      description:
          "ذكرى استشهاد الصحابي الجليل حجر بن عدي الكندي ومجموعة من أصحابه الأوفياء في مرج عذراء بالشام بأمر من معاوية لعنه الله لرفضهم البراءة من أمير المؤمنين (ع).",
      recommendedActs:
          "استذكار صلابة وثبات حجر بن عدي على المبدأ والولاء الصادق لعلي (ع).",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 25,
      month: 11,
      title: "يوم دحو الأرض",
      description:
          "ذكرى بسط الأرض من تحت الكعبة المشرفة، وهو يوم عظيم مستحب فيه الصيام والعبادة.",
      recommendedActs:
          "الصوم (له ثواب عظيم)، الدعاء، وقراءة الأعمال المخصوصة بهذا اليوم المبارك.",
    ),
    HijriEvent(
      day: 25,
      month: 11,
      title: "شهادة سعيد بن جبير (رض)",
      description:
          "ذكرى استشهاد التابعي الجليل وعالم الأمة سعيد بن جبير رضوان الله عليه، تلميذ الإمام السجاد (ع)، على يد الطاغية الحجاج بن يوسف الثقفي لتمسكه بولاية أهل البيت.",
      recommendedActs:
          "استذكار مواقف سعيد بن جبير وشجاعته العلمية والجهادية في وجه الظالمين.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 29,
      month: 11,
      title: "شهادة الإمام محمد الجواد (ع)",
      description:
          "ذكرى استشهاد شباب الأئمة باب المراد الإمام محمد بن علي الجواد (ع) بالسم ببغداد عام 220 هـ عن عمر 25 سنة.",
      recommendedActs:
          "زيارة الإمام الجواد (ع) المخصوصة، قراءة تعازي ومجالس الحزن وتبيين شجاعته وعلمه المبكر.",
      isMartyrdom: true,
    ),

    // ==========================================
    // شهر ذو الحجة الحرام (12)
    // ==========================================
    HijriEvent(
      day: 1,
      month: 12,
      title: "زواج النورين (علي والزهراء عليهما السلام)",
      description:
          "اليوم المبارك والأثري السعيد، ذكرى اقتران وزواج أمير المؤمنين علي بن أبي طالب من الصديقة فاطمة الزهراء (ع).",
      recommendedActs:
          "الصوم، الصدقة ببركة الزواج المبارك، الإكثار من الصلاة على محمد وآل محمد لطلب التوفيق العائلي.",
    ),
    HijriEvent(
      day: 7,
      month: 12,
      title: "شهادة الإمام محمد الباقر (ع)",
      description:
          "ذكرى استشهاد باقر علم النبيين الإمام محمد بن علي الباقر (عليهما السلام) بالسم بالمدينة المنورة عام 114 هـ.",
      recommendedActs:
          "زيارة الإمام الباقر (ع)، إقامة العزاء تبياناً لعلمه الغزير وجهوده بتثبيت دعائم الفقه الشيعي.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 8,
      month: 12,
      title: "خروج الإمام الحسين (ع) من مكة",
      description:
          "ذكرى خروج الإمام الحسين (ع) من مكة المكرمة متوجهاً إلى العراق يوم التروية عام 60 هـ.",
      recommendedActs:
          "استذكار موقف الإمام الحسين (ع) وعزيمته الراسخة في مواجهة الظلم.",
    ),
    HijriEvent(
      day: 9,
      month: 12,
      title: "شهادة مسلم بن عقيل (ع) وهانئ بن عروة",
      description:
          "ذكرى استشهاد سفير الحسين الوفي والثقة مسلم بن عقيل وهانئ بن عروة (عليهما السلام) في أرض الكوفة عام 60 هـ.",
      recommendedActs:
          "زيارة مسلم بن عقيل المخصوصة، المجالس العزائية، الدعاء بالتثبيت والاستقامة على الولاية.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 10,
      month: 12,
      title: "عيد الأضحى المبارك",
      description:
          "أحد أعياد المسلمين الكبرى العظيمة، ويوم النحر والتضحية والتقرب إلى الله بامتياز.",
      recommendedActs:
          "الغسل، صلاة العيد، الأضحية للمستطيع، زيارة الإمام الحسين (ع) المخصوصة بيوم الأضحى.",
    ),
    HijriEvent(
      day: 15,
      month: 12,
      title: "مولد الإمام علي الهادي (ع)",
      description:
          "ذكرى ولادة عاشر الأئمة الميامين الإمام علي بن محمد الهادي (عليهما السلام) بالمدينة المنورة سنة 212 هـ.",
      recommendedActs:
          "التصدق، الإنشاد والمدائح بأخلاقه وفضائله، قراءة الزيارة الجامعة الكبيرة المأثورة عنه.",
    ),
    HijriEvent(
      day: 18,
      month: 12,
      title: "عيد الغدير الأغر",
      description:
          "يوم الغدير الأغر، يوم تنصيب النبي (ص) لعلي بن أبي طالب (ع) إماماً وخليفة للمسلمين في غدير خم عام 10 هـ.",
      recommendedActs:
          "الصوم (كفارة 60 سنة)، الغسل، زيارة أمير المؤمنين (ع) المخصوصة باليوم، قراءة دعاء الندبة، المؤاخاة، وإطعام المؤمنين.",
    ),
    HijriEvent(
      day: 22,
      month: 12,
      title: "شهادة ميثم التمار (رض)",
      description:
          "ذكرى استشهاد الصحابي الجليل ميثم التمار (رضوان الله عليه) صاحب أمير المؤمنين (ع) ومن خيرة أصحابه، صُلب على جذع نخلة في الكوفة بأمر ابن زياد لعنه الله لأنه أبى أن يتبرأ من الإمام علي (ع).",
      recommendedActs:
          "استذكار ثبات ميثم التمار (رض) على الولاية وعدم تبرئه من أمير المؤمنين (ع) حتى الشهادة، والتأسي بإخلاصه.",
      isMartyrdom: true,
    ),
    HijriEvent(
      day: 24,
      month: 12,
      title: "يوم المباهلة والتصدق بالخاتم",
      description:
          "ذكرى مفاخرة النبي (ص) نصارى نجران بأهل بيته (ع) ونزول آية المباهلة، ويوم تصدق الإمام علي (ع) بخاتمه أثناء الركوع.",
      recommendedActs:
          "الغسل، الصوم، التصدق بنية التضامن والتعاون ومساعدة الفقراء، وقراءة دعاء المباهلة العظيم.",
    ),
    HijriEvent(
      day: 25,
      month: 12,
      title: "وفاة أبي ذر الغفاري (رض)",
      description:
          "ذكرى وفاة الصحابي الجليل جندب بن جنادة (أبو ذر الغفاري) رضوان الله عليه، رابع أركان أصحاب الكساء وأحد الأركان الأربعة، توفي وحيداً منفياً في الربذة بأمر عثمان.",
      recommendedActs:
          "استذكار جهاده وقوله للحق في وجه الباطل، وصدقه الذي شهد له به النبي (ص).",
    ),
    HijriEvent(
      day: 26,
      month: 12,
      title: "شهادة ولدي مسلم بن عقيل (ع)",
      description:
          "ذكرى استشهاد طفلي سفير الحسين مسلم بن عقيل (محمد وإبراهيم عليهما السلام) مظلومين وظمآنين قرب الكوفة.",
      recommendedActs:
          "إقامة مجالس العزاء، الحزن لمصابهما الصعب، والمواساة لأهل البيت (عليهم السلام).",
      isMartyrdom: true,
    ),
  ];

  // =========================================================================
  // الأدعية اليومية والتعقيبات (المرحّلة من الواجهات للوصول المشترك والموحد)
  // =========================================================================

  static final List<Dua> dailyDuas = [
    Dua(
      title: 'دعاء يوم السبت',
      benefits: 'الاستعصام بالله والتحرز من كيد الحاسدين',
      text: '''بِسْمِ الله الرَّحْمَنِ الرَّحِيمِ

بِسْمِ اللّهِ كَلِمَةِ الْمُعْتَصِمِينَ وَمَقَالَةِ الْمُتَحَرِّزِينَ وَأَعُوذُ بِاللّهِ تَعَالَى مِنْ جَوْرِ الْجَائِرِينَ وَكَيْدِ الْحَاسِدِينَ وَبَغْيِ الظَّالِمِينَ وَأَحْمَدُهُ فَوْقَ حَمْدِ الْحَامِدِينَ اَللَّهُمَّ أَنْتَ الْوَاحِدُ بِلا شَرِيكٍ وَالْمَلِكُ بِلا تَمْلِيكٍ لَا تُضَادُّ فِي حُكْمِكَ وَلَا تُنَازَعُ فِي مُلْكِكَ أَسْأَلُكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَآلِهِ عَبْدِكَ وَرَسُولِكَ وَأَنْ تُوزِعَنِي مِنْ شُكْرِ نُعْمَاكَ مَا تَبْلُغُ بِي غَايَةَ رِضَاكَ وَأَنْ تُعِينَنِي عَلَى طَاعَتِكَ وَلُزُومِ عِبَادَتِكَ وَاسْتِحْقَاقِ مَثُوبَتِكَ بِلُطْفِ عِنَايَتِكَ وَتَرْحَمَنِي وَتَصُدَّنِي عَنْ مَعَاصِيكَ مَا أَحْيَيْتَنِي وَتُوَفِّقَنِي لِمَا يَنْفَعُنِي مَا أَبْقَيْتَنِي وَأَنْ تَشْرَحَ بِكِتَابِكَ صَدْرِي وَتَحُطَّ بِتِلَاوَتِهِ وِزْرِي وَتَمْنَحَنِي السَّلَامَةَ فِي دِينِي وَنَفْسِي وَلَا تُوحِشَ بِي أَهْلَ أُنْسِي وَتُتِمَّ إِحْسَانَكَ فِيمَا بَقِيَ مِنْ عُمُرِي كَمَا أَحْسَنْتَ فِيمَا مَضَى مِنْهُ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dua(
      title: 'دعاء يوم الأحد',
      benefits: 'التوكل والالتجاء إلى فضل الله وعدله',
      text: '''بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ

بِسْمِ اللهِ الَّذِي لاَ أَرْجُو إِلاَّ فَضْلَهُ وَلاَ أَخْشَى إِلاَّ عَدْلَهُ وَلا أَعْتَمِدُ إِلاَّ قَوْلَهُ وَلا أُمْسِكُ إِلاَّ بِحَبْلِهِ بِكَ أَسْتَجِيرُ يَا ذَا الْعَفْوِ وَالرِّضْوَانِ مِنَ الظُّلْمِ وَالْعُدْوَانِ وَمِنْ غِيَرِ الزَّمَانِ وَتَوَاتُرِ الْأَحْزَانِ وَمِنْ طَوَارِقِ الْحَدَثَانِ وَمِنِ انْقِضَاءِ الْمُدَّةِ قَبْلَ التَّأَهُّبِ وَالْعُدَّةِ وَإِيَّاكَ أَسْتَرْشِدُ لِمَا فِيهِ الصَّلَاحُ وَالْإِصْلَاحُ وَبِكَ أَسْتَعِينُ فِيمَا يَقْتَرِنُ بِهِ النَّجَاحُ وَالْإِنْجَاحُ وَإِيَّاكَ أَرْغَبُ فِي لِبَاسِ الْعَافِيَةِ وَتَمَامِهَا وَشُمُولِ السَّلَامَةِ وَدَوَامِهَا وَأَعُوذُ بِكَ يَا رَبِّ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَحْتَرِزُ بِسُلْطَانِكَ مِنْ جَوْرِ السَّلَاطِينِ فَتَقَبَّلْ مَا كَانَ مِنْ صَلَاتِي وَصَوْمِي وَاجْعَلْ غَدِي وَمَا بَعْدَهُ أَفْضَلَ مِنْ سَاعَتِي وَيَوْمِي وَأَعِزَّنِي فِي عَشِيرَتِي وَقَوْمِي وَاحْفَظْنِي فِي يَقْظَتِي وَنَوْمِي فَأَنْتَ اللَّهُ خَيْرٌ حَافِظًا وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ اَللَّهُمَّ إِنِّي أَبْرَأُ إِلَيْكَ فِي يَوْمِي هَذَا وَفِي مَا بَعْدَهُ مِنَ الْآحَادِ مِنَ الشِّرْكِ وَالْإِلْحَادِ وَأُخْلِصُ لَكَ دُعَائِي تَعَرُّضًا لِلْإِجَابَةِ وَأُقِيمُ عَلَى طَاعَتِكَ رَجَاءً لِلْإِثَابَةِ فَصَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ خَيْرِ خَلْقِكَ الدَّاعِي إِلَى حَقِّكَ وَأَعِزَّنِي بِعِزِّكَ الَّذِي لَا يُضَامُ وَاحْفَظْنِي بِعَيْنِكَ الَّتِي لَا تَنَامُ وَاخْتِمْ بِالِانْقِطَاعِ إِلَيْكَ أَمْرِي وَبِالْمَغْفِرَةِ عُمْرِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ''',
    ),
    Dua(
      title: 'دعاء يوم الإثنين',
      benefits: 'الحمد والثناء على نعم الله وطلب المغفرة',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

الْحَمْدُ لِلَّهِ الَّذِي لَمْ يُشْهِدْ أَحَداً حِينَ فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ وَلَا اتَّخَذَ مُعِيناً حِينَ بَرَأَ النَّسَمَاتِ وَلَمْ يُشَارَكْ فِي الإِلَهِيَّةِ وَلَمْ يُظَاهَرْ فِي الْوَحْدَانِيَّةِ كَلَّتِ الْأَلْسُنُ عَنْ غَايَةِ صِفَتِهِ وَالْعُقُولُ عَنْ كُنْهِ مَعْرِفَتِهِ وَتَوَاضَعَتِ الْجَبَابِرَةُ لِهَيْبَتِهِ وَعَنَتِ الْوُجُوهُ لِخَشْيَتِهِ وَانْقَادَ كُلُّ عَظِيمٍ لِعَظَمَتِهِ فَلَكَ الْحَمْدُ مُتَوَاتِراً مُتَّسِقاً وَمُتَوَالِياً مُسْتَوْسِقاً وَصَلَوَاتُهُ عَلَى رَسُولِهِ أَبَداً وَسَلَامُهُ دَائِماً سَرْمَداً اللَّهُمَّ اجْعَلْ أَوَّلَ يَوْمِي هَذَا صَلَاحاً وَأَوْسَطَهُ فَلَاحاً وَآخِرَهُ نَجَاحاً وَأَعُوذُ بِكَ مِنْ يَوْمٍ أَوَّلُهُ فَزَعٌ وَأَوْسَطُهُ جَزَعٌ وَآخِرُهُ وَجَعٌ اللَّهُمَّ إِنِّي أَسْتَغْفِرُكَ لِكُلِّ نَذْرٍ نَذَرْتُهُ وَكُلِّ وَعْدٍ وَعَدْتُهُ وَكُلِّ عَهْدٍ عَاهَدْتُهُ ثُمَّ لَمْ أَفِ بِهِ وَأَسْأَلُكَ فِي مَظَالِمِ عِبَادِكَ عِنْدِي فَأَيُّمَا عَبْدٍ مِنْ عَبِيدِكَ أَوْ أَمَةٍ مِنْ إِمَائِكَ كَانَتْ لَهُ قِبَلِي مَظْلَمَةٌ ظَلَمْتُهَا إِيَّاهُ فِي نَفْسِهِ أَوْ فِي عِرْضِهِ أَوْ فِي مَالِهِ أَوْ فِي أَهْلِهِ وَوَلَدِهِ أَوْ غِيبَةٌ اغْتَبْتُهُ بِهَا أَوْ تَحَامُلٌ عَلَيْهِ بِمَيْلٍ أَوْ هَوًى أَوْ أَنَفَةٍ أَوْ حَمِيَّةٍ أَوْ رِيَاءٍ أَوْ عَصَبِيَّةٍ غَائِباً كَانَ أَوْ شَاهِداً وَحَيّاً كَانَ أَوْ مَيِّتاً فَقَصُرَتْ يَدِي وَضَاقَ وُسْعِي عَنْ رَدِّهَا إِلَيْهِ وَالتَّحَلُّلِ مِنْهُ فَأَسْأَلُكَ يَا مَنْ يَمْلِكُ الْحَاجَاتِ وَهِيَ مُسْتَجِيبَةٌ لِمَشِيئَتِهِ وَمُسْرِعَةٌ إِلَى إِرَادَتِهِ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَنْ تُرْضِيَهُ عَنِّي بِمَا شِئْتَ وَتَهَبَ لِي مِنْ عِنْدِكَ رَحْمَةً إِنَّهُ لَا تَنْقُصُكَ الْمَغْفِرَةُ وَلَا تَضُرُّكَ الْمَوْهِبَةُ يَا أَرْحَمَ الرَّاحِمِينَ اللَّهُمَّ أَوْلِنِي فِي كُلِّ يَوْمِ اثْنَيْنِ نِعْمَتَيْنِ مِنْكَ ثِنْتَيْنِ سَعَادَةً فِي أَوَّلِهِ بِطَاعَتِكَ وَنِعْمَةً فِي آخِرِهِ بِمَغْفِرَتِكَ يَا مَنْ هُوَ الإِلَهُ وَلَا يَغْفِرُ الذُّنُوبَ سِوَاهُ''',
    ),
    Dua(
      title: 'دعاء يوم الثلاثاء',
      benefits: 'الاستعاذة من شر الشيطان والنفس الأمارة بالسوء',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

الْحَمْدُ لِلَّهِ وَالْحَمْدُ حَقَّهُ كَمَا يَسْتَحِقُّهُ حَمْداً كَثِيراً وَأَعُوذُ بِهِ مِنْ شَرِّ نَفْسِي إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ إِلَّا مَا رَحِمَ رَبِّي وَأَعُوذُ بِهِ مِنْ شَرِّ الشَّيْطَانِ الَّذِي يَزِيدَنِي ذَنْباً إِلَى ذَنْبِي وَأَحْتَرِزُ بِهِ مِنْ كُلِّ جَبَّارٍ فَاجِرٍ وَسُلْطَانٍ جَائِرٍ وَعَدُوٍّ قَاهِرٍ اللَّهُمَّ اجْعَلْنِي مِنْ جُنْدِكَ فَإِنَّ جُنْدَكَ هُمُ الْغَالِبُونَ وَاجْعَلْنِي مِنْ حِزْبِكَ فَإِنَّ حِزْبَكَ هُمُ الْمُفْلِحُونَ وَاجْعَلْنِي مِنْ أَوْلِيَائِكَ فَإِنَّ أَوْلِيَاءَكَ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ اللَّهُمَّ أَصْلِحْ لِي دِينِي فَإِنَّهُ عِصْمَةُ أَمْرِي وَأَصْلِحْ لِي آخِرَتِي فَإِنَّهَا دَارُ مَقَرِّي وَإِلَيْهَا مِنْ مُجَاوَرَةِ اللِّقَاءِ مَفَرِّي وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَالْوَفَاةَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ خَاتَمِ النَّبِيِّينَ وَتَمَامِ عِدَّةِ الْمُرْسَلِينَ وَعَلَى آلِهِ الطَّيِّبِينَ الطَّاهِرِينَ وَأَصْحَابِهِ الْمُنْتَجَبِينَ وَهَبْ لِي فِي الثُّلَاثَاءِ ثَلَاثاً لَا تَدَعْ لِي ذَنْباً إِلَّا غَفَرْتَهُ وَلَا غَمّاً إِلَّا أَذْهَبْتَهُ وَلَا عَدُوّاً إِلَّا دَفَعْتَهُ بِبِسْمِ اللَّهِ خَيْرِ الْأَسْمَاءِ بِسْمِ اللَّهِ رَبِّ الْأَرْضِ وَالسَّمَاءِ أَسْتَدْفِعُ كُلَّ مَكْرُوهٍ أَوَّلُهُ سَخَطُهُ وَأَسْتَجْلِبُ كُلَّ مَحْبُوبٍ أَوَّلُهُ رِضَاهُ فَاخْتِمْ لِي مِنْكَ بِالْغُفْرَانِ يَا وَلِيَّ الْإِحْسَانِ''',
    ),
    Dua(
      title: 'دعاء يوم الأربعاء',
      benefits: 'الحمد والثناء على الله والتوسل برسوله',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ اللَّيْلَ لِبَاساً وَالنَّوْمَ سُبَاتاً وَجَعَلَ النَّهَارَ نُشُوراً لَكَ الْحَمْدُ أَنْ بَعَثْتَنِي مِنْ مَرْقَدِي وَلَوْ شِئْتَ جَعَلْتَهُ سَرْمَداً حَمْداً دَائِماً لَا يَنْقَطِعُ أَبَداً وَلَا يُحْصِي لَهُ الْخَلَائِقُ عَدَداً اللَّهُمَّ لَكَ الْحَمْدُ أَنْ خَلَقْتَ فَسَوَّيْتَ وَقَدَّرْتَ وَقَضَيْتَ وَأَمَتَّ وَأَحْيَيْتَ وَأَمْرَضْتَ وَشَفَيْتَ وَعَافَيْتَ وَأَبْلَيْتَ وَعَلَى الْعَرْشِ اسْتَوَيْتَ وَعَلَى الْمُلْكِ احْتَوَيْتَ أَدْعُوكَ دُعَاءَ مَنْ ضَعُفَتْ وَسِيلَتُهُ وَانْقَطَعَتْ حِيلَتُهُ وَاقْتَرَبَ أَجَلُهُ وَتَدَانَى فِي الدُّنْيَا أَمَلُهُ وَاشْتَدَّتْ إِلَى رَحْمَتِكَ فَاقَتُهُ وَعَظُمَتْ لِتَفْرِيطِهِ حَسْرَتُهُ وَكَثُرَتْ زَلَّتُهُ وَعَثْرَتُهُ وَخَلُصَتْ لِوَجْهِكَ تَوْبَتُهُ فَصَلِّ عَلَى مُحَمَّدٍ خَاتَمِ النَّبِيِّينَ وَعَلَى أَهْلِ بَيْتِهِ الطَّيِّبِينَ الطَّاهِرِينَ وَارْزُقْنِي شَفَاعَةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَلَا تَحْرِمْنِي صُحْبَتَهُ إِنَّكَ أَنْتَ أَرْحَمُ الرَّاحِمِينَ اللَّهُمَّ اقْضِ لِي فِي الْأَرْبِعَاءِ أَرْبَعاً اجْعَلْ قُوَّتِي فِي طَاعَتِكَ وَنَشَاطِي فِي عِبَادَتِكَ وَرَغْبَتِي فِي ثَوَابِكَ وَزُهْدِي فِيمَا يُوجِبُ لِي أَلِيمَ عِقَابِكَ إِنَّكَ لَطِيفٌ لِمَا تَشَاءُ''',
    ),
    Dua(
      title: 'دعاء يوم الخميس',
      benefits: 'طلب الخير والتوفيق والاستعاذة من السيئات',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ اللَّيْلَ مُظْلِماً بِقُدْرَتِهِ وَجَاءَ بِالنَّهَارِ مُبْصِراً بِرَحْمَتِهِ وَكَسَانِي ضِيَاءَهُ وَأَنَا فِي نِعْمَتِهِ اللَّهُمَّ فَكَمَا أَبْقَيْتَنِي لَهُ فَأَبْقِنِي لِأَمْثَالِهِ وَصَلِّ عَلَى النَّبِيِّ مُحَمَّدٍ وَآلِهِ وَلَا تَفْجَعْنِي فِيهِ وَفِي غَيْرِهِ مِنَ اللَّيَالِي وَالْأَيَّامِ بِارْتِكَابِ الْمَحَارِمِ وَاكْتِسَابِ الْمَآثِمِ وَارْزُقْنِي خَيْرَهُ وَخَيْرَ مَا فِيهِ وَخَيْرَ مَا بَعْدَهُ وَاصْرِفْ عَنِّي شَرَّهُ وَشَرَّ مَا فِيهِ وَشَرَّ مَا بَعْدَهُ اللَّهُمَّ إِنِّي بِذِمَّةِ الْإِسْلَامِ أَتَوَسَّلُ إِلَيْكَ وَبِحُرْمَةِ الْقُرْآنِ أَعْتَمِدُ عَلَيْكَ وَبِمُحَمَّدٍ الْمُصْطَفَى صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ أَسْتَشْفِعُ لَدَيْكَ فَاعْرِفِ اللَّهُمَّ ذِمَّتِي الَّتِي رَجَوْتُ بِهَا قَضَاءَ حَاجَتِي يَا أَرْحَمَ الرَّاحِمِينَ اللَّهُمَّ اقْضِ لِي فِي الْخَمِيسِ خَمْساً لَا يَتَّسِعُ لَهَا إِلَّا كَرَمُكَ وَلَا يُطِيقُهَا إِلَّا نِعَمُكَ سَلَامَةً أَقْوَى بِهَا عَلَى طَاعَتِكَ وَعِبَادَةً أَسْتَحِقُّ بِهَا جَزِيلَ مَثُوبَتِكَ وَسَعَةً فِي الْحَالِ مِنَ الرِّزْقِ الْحَلَالِ وَأَنْ تُؤَمِّنَنِي فِي مَوَاقِفِ الْخَوْفِ بِأَمْنِكَ وَتَجْعَلَنِي مِنْ طَوَارِقِ الْهُمُومِ وَالْغُمُومِ فِي حِصْنِكَ وَصَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلْ تَوَكُّلِي بِهِ شَافِعاً يَوْمَ الْقِيَامَةِ نَافِعاً إِنَّكَ أَنْتَ أَرْحَمُ الرَّاحِمِينَ''',
    ),
    Dua(
      title: 'دعاء يوم الجمعة',
      benefits: 'الحمد والثناء على الله والثبات على الدين',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

الْحَمْدُ لِلَّهِ الْأَوَّلِ قَبْلَ الْإِنْشَاءِ وَالْإِحْيَاءِ وَالْآخِرِ بَعْدَ فَنَاءِ الْأَشْيَاءِ الْعَلِيمِ الَّذِي لَا يَنْسَى مَنْ ذَكَرَهُ وَلَا يَنْقُصُ مَنْ شَكَرَهُ وَلَا يَخِيبُ مَنْ دَعَاهُ وَلَا يَقْطَعُ رَجَاءَ مَنْ رَجَاهُ اللَّهُمَّ إِنِّي أُشْهِدُكَ وَكَفَى بِكَ شَهِيداً وَأُشْهِدُ جَمِيعَ مَلَائِكَتِكَ وَسُكَّانَ سَمَاوَاتِكَ وَحَمَلَةَ عَرْشِكَ وَمَنْ بَعَثْتَ مِنْ أَنْبِيَائِكَ وَرُسُلِكَ وَأَنْشَأْتَ مِنْ أَصْنَافِ خَلْقِكَ أَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ وَلَا عَدِيلَ وَلَا خُلْفَ لِقَوْلِكَ وَلَا تَبْدِيلَ وَأَنَّ مُحَمَّداً صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ عَبْدُكَ وَرَسُولُكَ أَدَّى مَا حَمَّلْتَهُ إِلَى الْعِبَادِ وَجَاهَدَ فِي اللَّهِ عَزَّ وَجَلَّ حَقَّ الْجِهَادِ وَأَنَّهُ بَشَّرَ بِمَا هُوَ حَقٌّ مِنَ الثَّوَابِ وَأَنْذَرَ بِمَا هُوَ صِدْقٌ مِنَ الْعِقَابِ اللَّهُمَّ ثَبِّتْنِي عَلَى دِينِكَ مَا أَحْيَيْتَنِي وَلَا تُزِغْ قَلْبِي بَعْدَ إِذْ هَدَيْتَنِي وَهَبْ لِي مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ وَاجْعَلْنِي مِنْ أَتْبَاعِهِ وَشِيعَتِهِ وَاحْشُرْنِي فِي زُمْرَتِهِ وَوَفِّقْنِي لِأَدَاءِ فَرْضِ الْجُمُعَاتِ وَمَا أَوْجَبْتَ عَلَيَّ فِيهَا مِنَ الطَّاعَاتِ وَقَسَمْتَ لِأَهْلِهَا مِنَ الْعَطَاءِ فِي يَوْمِ الْجَزَاءِ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ''',
    ),
  ];

  static final List<Dua> prayerDuas = [
    Dua(
      title: 'تعقيب صلاة الصبح',
      benefits: 'يُستحب قراءته بعد صلاة الفجر',
      text: '''اَللّـهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ

وتقول عشر مرات

اَللّـهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ الْأَوْصِيَاءِ الرَّاضِينَ الْمَرْضِيِّينَ بِأَفْضَلِ صَلَوَاتِكَ وَبَارِكْ عَلَيْهِمْ بِأَفْضَلِ بَرَكَاتِكَ وَالسَّلَامُ عَلَيْهِمْ وَعَلَى أَرْوَاحِهِمْ وَأَجْسَادِهِمْ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ

وهذه الصلاة واردة يوم الجمعة أيضاً عصراً بفضل عظيم

وقل أيضاً

اَللَّـهُمَّ أَحْيِنِي عَلَى مَا أَحْيَيْتَ عَلَيْهِ عَلِيَّ بْنَ أَبِي طَالِبٍ وَأَمِتْنِي عَلَى مَا مَاتَ عَلَيْهِ عَلِيُّ بْنُ أَبِي طَالِبٍ عَلَيْهِ السَّلَامُ

وقل مائة مرة

أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ

ومائة مرة

أَسْأَلُ اللَّهَ الْعَافِيَةَ

ومائة مرة

أَسْتَجِيرُ بِاللَّهِ مِنَ النَّارِ

ومائة مرة

وَأَسْأَلُهُ الْجَنَّةَ

ومائة مرة

أَسْأَلُ اللَّهَ الْحُورَ الْعِينَ

ومائة مرة

لَا إِلَهَ إِلَّا اللَّهُ الْمَلِكُ الْحَقُّ الْمُبِينُ

ومائة مرة

سورة التوحيد

ومائة مرة

صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ

ومائة مرة

سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ

ومائة مرة

مَا شَاءَ اللَّهُ كَانَ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ

ثم قل

أَصْبَحْتُ اللّـهُمَّ مُعْتَصِماً بِذِمَامِكَ الْمَنِيعِ الَّذِي لَا يُطَاوَلُ وَلَا يُحَاوَلُ مِنْ شَرِّ كُلِّ غَاشِمٍ وَطَارِقٍ مِنْ سَائِرِ مَنْ خَلَقْتَ وَمَا خَلَقْتَ مِنْ خَلْقِكَ الصَّامِتِ وَالنَّاطِقِ فِي جُنَّةٍ مِنْ كُلِّ مَخُوفٍ بِلِبَاسِ سَابِغَةِ وَلَاءِ أَهْلِ بَيْتِ نَبِيِّكَ مُحْتَجِباً مِنْ كُلِّ قَاصِدٍ لِي إِلَى أَذِيَّةٍ بِجِدَارٍ حَصِينِ الْإِخْلَاصِ فِي الِاعْتِرَافِ بِحَقِّهِمْ وَالتَّمَسُّكِ بِحَبْلِهِمْ مُوقِناً أَنَّ الْحَقَّ لَهُمْ وَمَعَهُمْ وَفِيهِمْ وَبِهِمْ أُوَالِي مَنْ وَالَوْا وَأُجَانِبُ مَنْ جَانَبُوا فَأَعِذْنِي اللّـهُمَّ بِهِمْ مِنْ شَرِّ كُلِّ مَا أَتَّقِيهِ يَا عَظِيمُ حَجَزْتُ الْأَعَادِيَ عَنِّي بِبَدِيعِ السَّمَوَاتِ وَالْأَرْضِ إِنَّا جَعَلْنَا مِنْ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ''',
    ),
    Dua(
      title: 'تعقيب صلاة الظهر',
      benefits: 'يُستحب قراءته بعد صلاة الظهر',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ


لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْكَرِيمُ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ اَللّـهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ اَللَّـهُمَّ لَا تَدَعْ لِي ذَنْباً إِلَّا غَفَرْتَهُ وَلَا هَمًّا إِلَّا فَرَّجْتَهُ وَلَا سُقْماً إِلَّا شَفَيْتَهُ وَلَا عَيْباً إِلَّا سَتَرْتَهُ وَلَا رِزْقاً إِلَّا بَسَطْتَهُ وَلَا خَوْفاً إِلَّا آمَنْتَهُ وَلَا سُوءاً إِلَّا صَرَفْتَهُ وَلَا حَاجَةً هِيَ لَكَ رِضًا وَلِيَ فِيهَا صَلَاحٌ إِلَّا قَضَيْتَهَا يَا أَرْحَمَ الرَّاحِمِينَ آمِينَ رَبَّ الْعَالَمِينَ

وتقول عشر مرات

بِاللَّهِ اعْتَصَمْتُ وَبِاللَّهِ أَثِقُ وَعَلَى اللَّهِ أَتَوَكَّلُ

ثم تقول

اَللّـهُمَّ إِنْ عَظُمَتْ ذُنُوبِي فَأَنْتَ أَعْظَمُ وَإِنْ كَبُرَ تَفْرِيطِي فَأَنْتَ أَكْبَرُ وَإِنْ دَامَ بُخْلِي فَأَنْتَ أَجْوَدُ اَللّـهُمَّ اغْفِرْ لِي عَظِيمَ ذُنُوبِي بِعَظِيمِ عَفْوِكَ وَكَثِيرَ تَفْرِيطِي بِظَاهِرِ كَرَمِكَ وَاقْمَعْ بُخْلِي بِفَضْلِ جُودِكَ اَللّـهُمَّ مَا بِنَا مِنْ نِعْمَةٍ فَمِنْكَ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ''',
    ),
    Dua(
      title: 'تعقيب صلاة العصر',
      benefits: 'يُستحب قراءته بعد صلاة العصر',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ


أَسْتَغْفِرُ اللَّهَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ الرَّحْمَنُ الرَّحِيمُ ذُو الْجَلَالِ وَالْإِكْرَامِ وَأَسْأَلُهُ أَنْ يَتُوبَ عَلَيَّ تَوْبَةَ عَبْدٍ ذَلِيلٍ خَاضِعٍ فَقِيرٍ بَائِسٍ مِسْكِينٍ مُسْتَكِينٍ مُسْتَجِيرٍ لَا يَمْلِكُ لِنَفْسِهِ نَفْعاً وَلَا ضَرّاً وَلَا مَوْتاً وَلَا حَيَاةً وَلَا نُشُوراً

ثم تقول

اَللّـهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ نَفْسٍ لَا تَشْبَعُ وَمِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ صَلَاةٍ لَا تُرْفَعُ وَمِنْ دُعَاءٍ لَا يُسْمَعُ اَللّـهُمَّ إِنِّي أَسْأَلُكَ الْيُسْرَ بَعْدَ الْعُسْرِ وَالْفَرَجَ بَعْدَ الْكَرْبِ وَالرَّخَاءَ بَعْدَ الشِّدَّةِ اَللّـهُمَّ مَا بِنَا مِنْ نِعْمَةٍ فَمِنْكَ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ

وعن الصادق عليه السلام قال

من استغفر الله تعالى بعد صلاة العصر سبعين مرة غفر الله له سبعمئة ذنب

وروي عن الإمام محمد التقي عليه السلام قال

من قرأ إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ بعد العصر عشر مرات مرت له على مثل أعمال الخلائق في ذلك اليوم

ويستحب دعاء العشرات في كل صباح ومساء وأفضل أوقاته بعد العصر يوم الجمعة وسيأتي الدعاء فيما بعد''',
    ),
    Dua(
      title: 'تعقيب صلاة المغرب',
      benefits: 'يُستحب قراءته بعد صلاة المغرب',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ


إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيماً

اَللّـهُمَّ صَلِّ عَلَى مُحَمَّدٍ النَّبِيِّ وَعَلَى ذُرِّيَّتِهِ وَعَلَى أَهْلِ بَيْتِهِ

ثم تقول سبع مرات

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ

وثلاث مرات

الْحَمْدُ لِلَّهِ الَّذِي يَفْعَلُ مَا يَشَاءُ وَلَا يَفْعَلُ مَا يَشَاءُ غَيْرُهُ

ثم قل

سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ اغْفِرْ لِي ذُنُوبِي كُلَّهَا جَمِيعاً فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ كُلَّهَا جَمِيعاً إِلَّا أَنْتَ

ثم تُصَلِّي نافلة المغرب وهي أربع ركعات بسلامين ولا تتكلم بينهما بشيء وقال الشيخ روي أنه يقرأ في الركعة الأولى سورة قُلْ يَا أَيُّهَا الْكَافِرُونَ وفي الثانية قُلْ هُوَ اللَّهُ أَحَدٌ ويقرأ في الأخريين ما شاء وروي أن الإمام علي النقي عليه السلام كان يقرأ في الركعة الثالثة سورة الحمد وأول سورة الحديد إلى وَهُوَ عَلِيمٌ بِذَاتِ الصُّدُورِ وفي الرابعة الحمد وآخر سورة الحشر أي من لَوْ أَنْزَلْنَا هَذَا الْقُرْآنَ إلى آخر السورة

ويستحب أن تقول في السجدة الأخيرة من النوافل في كل ليلة سيما في ليلة الجمعة سبع مرات

اَللّـهُمَّ إِنِّي أَسْأَلُكَ بِوَجْهِكَ الْكَرِيمِ وَاسْمِكَ الْعَظِيمِ وَمُلْكِكَ الْقَدِيمِ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَآلِهِ وَأَنْ تَغْفِرَ لِي ذَنْبِيَ الْعَظِيمَ إِنَّهُ لَا يَغْفِرُ الْعَظِيمَ إِلَّا الْعَظِيمُ

فإذا فرغت من النافلة فعقب بما شئت وتقول عشراً

مَا شَاءَ اللَّهُ لَا قُوَّةَ إِلَّا بِاللَّهِ أَسْتَغْفِرُ اللَّهَ

ثم تقول

اَللّـهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالنَّجَاةَ مِنَ النَّارِ وَمِنْ كُلِّ بَلِيَّةٍ وَالْفَوْزَ بِالْجَنَّةِ وَالرِّضْوَانِ فِي دَارِ السَّلَامِ وَجِوَارِ نَبِيِّكَ مُحَمَّدٍ عَلَيْهِ وَآلِهِ السَّلَامُ اَللّـهُمَّ مَا بِنَا مِنْ نِعْمَةٍ فَمِنْكَ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ

وتصلي الغفيلة بين المغرب والعشاء وهي ركعتان تقرأ بعد الحمد في الأولى

وَذَا النُّونِ إِذْ ذَهَبَ مُغَاضِباً فَظَنَّ أَنْ لَنْ نَقْدِرَ عَلَيْهِ فَنَادَى فِي الظُّلُمَاتِ أَنْ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ فَاسْتَجَبْنَا لَهُ وَنَجَّيْنَاهُ مِنَ الْغَمِّ وَكَذَلِكَ نُنْجِي الْمُؤْمِنِينَ

وفي الثانية

وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ لَا يَعْلَمُهَا إِلَّا هُوَ وَيَعْلَمُ مَا فِي الْبَرِّ وَالْبَحْرِ وَمَا تَسْقُطُ مِنْ وَرَقَةٍ إِلَّا يَعْلَمُهَا وَلَا حَبَّةٍ فِي ظُلُمَاتِ الْأَرْضِ وَلَا رَطْبٍ وَلَا يَابِسٍ إِلَّا فِي كِتَابٍ مُبِينٍ

ثم تأخذ يديك للقنوت وتقول

اَللَّـهُمَّ إِنِّي أَسْأَلُكَ بِمَفَاتِيحِ الْغَيْبِ الَّتِي لَا يَعْلَمُهَا إِلَّا أَنْتَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَآلِهِ وَأَنْ تَفْعَلَ بِي كَذَا وَكَذَا

وتذكر حاجتك عوض هذه الكلمة ثم تقول

اَللَّـهُمَّ أَنْتَ وَلِيُّ نِعْمَتِي وَالْقَادِرُ عَلَى طَلِبَتِي تَعْلَمُ حَاجَتِي فَأَسْأَلُكَ بِحَقِّ مُحَمَّدٍ وَآلِهِ عَلَيْهِ وَعَلَيْهِمُ السَّلَامُ لَمَّا قَضَيْتَهَا لِي

وتسأل حاجتك فقد روي أن من أتى بهذه الصلاة وسأل الله حاجته أعطاه الله ما سأل''',
    ),
    Dua(
      title: 'تعقيب صلاة العشاء',
      benefits: 'يُستحب قراءته بعد صلاة العشاء',
      text: '''بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

اَللَّـهُمَّ إِنَّهُ لَيْسَ لِي عِلْمٌ بِمَوْضِعِ رِزْقِي وَإِنَّمَا أَطْلُبُهُ بِخَطَرَاتٍ تَخْطُرُ عَلَى قَلْبِي فَأَجُولُ فِي طَلَبِهِ الْبُلْدَانَ فَأَنَا فِيمَا أَنَا طَالِبٌ كَالْحَيْرَانِ لَا أَدْرِي أَفِي سَهْلٍ هُوَ أَمْ فِي جَبَلٍ أَمْ فِي أَرْضٍ أَمْ فِي سَمَاءٍ أَمْ فِي بَرٍّ أَمْ فِي بَحْرٍ وَعَلَى يَدَيْ مَنْ وَمِنْ قِبَلِ مَنْ وَقَدْ عَلِمْتُ أَنَّ عِلْمَهُ عِنْدَكَ وَأَسْبَابَهُ بِيَدِكَ وَأَنْتَ الَّذِي تَقْسِمُهُ بِلُطْفِكَ وَتُسَبِّبُهُ بِرَحْمَتِكَ اَللَّـهُمَّ فَصَلِّ عَلَى مُحَمَّدٍ وَآلِهِ وَاجْعَلْ يَا رَبِّ رِزْقَكَ لِي وَاسِعاً وَمَطْلَبَهُ سَهْلًا وَمَأْخَذَهُ قَرِيباً وَلَا تُعَنِّنِي بِطَلَبِ مَا لَمْ تُقَدِّرْ لِي فِيهِ رِزْقاً فَإِنَّكَ غَنِيٌّ عَنْ عَذَابِي وَأَنَا فَقِيرٌ إِلَى رَحْمَتِكَ فَصَلِّ عَلَى مُحَمَّدٍ وَآلِهِ وَجُدْ عَلَى عَبْدِكَ بِفَضْلِكَ إِنَّكَ ذُو فَضْلٍ عَظِيمٍ

أقول

هذا من أدعية الرزق ويستحب أيضاً أن يقرأ عقيب العشاء سورة إِنَّا أَنْزَلْنَاهُ سبع مرات وأن يقرأ في الوتيرة وهي الركعتان جالساً بعد العشاء مائة آية من القرآن ويستحب أن يعتاض عن مائة الآية سورة إِذَا وَقَعَتِ الْوَاقِعَةُ في ركعة وسورة قُلْ هُوَ اللَّهُ أَحَدٌ في الركعة الأخرى''',
    ),
  ];

  static final List<Ziyarat> specialZiyarats = [
    Ziyarat(
      title: 'زيارة النبي الأكرم صلى الله عليه وآل وسلم',
      benefits: 'زيارة النبي محمد (ص)',
      text: '''بسم الله الرحمن الرحيم 

أَشْهَدُ أَن لَّا إِلَـهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ وَأَشْهَدُ أَنَّهُ سَيِّدُ الأَوَّلِينَ وَالآخِرِينَ وَأَنَّهُ سَيِّدُ الأَنْبِيَاءِ وَالْمُرْسَلِينَ اَللَّـهُمَّ صَلِّ عَلَيْهِ وَعَلَى أَهْلِ بَيْتِهِ الأَئِمَّةِ الطَّيِّبِينَ ثمّ قل اَلسَّلامُ عَلَيْكَ يَا رَسُولَ اللهِ اَلسَّلامُ عَلَيْكَ يَا خَلِيلَ اللهِ اَلسَّلامُ عَلَيْكَ يا نَبِيَّ اللهِ اَلسَّلامُ عَلَيْكَ يا صَفِيَّ اللهِ اَلسَّلامُ عَلَيْكَ يَا رَحْمَةَ اللهِ اَلسَّلامُ عَلَيْكَ يَا خِيَرَةَ اللهِ اَلسَّلامُ عَلَيْكَ يَا حَبِيبَ اللهِ اَلسَّلامُ عَلَيْكَ يَا نَجِيبَ اللهِ اَلسَّلامُ عَلَيْكَ يَا خاتَمَ النَّبِيِّينَ اَلسَّلامُ عَلَيْكَ يَا سَيِّدَ الْمُرْسَلِينَ اَلسَّلامُ عَلَيْكَ يَا قائِماً بِالْقِسْطِ اَلسَّلامُ عَلَيْكَ يَا فاتِحَ الْخَيْرِ اَلسَّلامُ عَلَيْكَ يَا مَعْدِنَ الْوَحْيِ وَالتَّنْزيلِ اَلسَّلامُ عَلَيْكَ يا مُبَلِّغاً عَنِ اللهِ اَلسَّلامُ عَلَيْكَ أَيُّهَا السِّرَاجُ الْمُنِيرُ اَلسَّلامُ عَلَيْكَ يَا مُبَشِّرُ اَلسَّلامُ عَلَيْكَ يَا نَذيرُ اَلسَّلامُ عَلَيْكَ يَا مُنْذِرُ اَلسَّلامُ عَلَيْكَ يَا نُورَ اللهِ الَّذِي يُسْتَضَاءُ بِهِ اَلسَّلامُ عَلَيْكَ وَعَلَى أَهْلِ بَيْتِكَ الطَّيِّبِينَ الطَّاهِرِينَ الْهَادِينَ الْمَهْدِيِّينَ اَلسَّلامُ عَلَيْكَ وَعَلى جَدِّكَ عَبْدِ الْمُطَّلِبِ وَعَلَى أَبِيكَ عِبْدِ اللهِ اَلسَّلامُ عَلَى أُمِّكَ آمِنَةَ بِنْتِ وَهَبٍ اَلسَّلامُ عَلَى عَمِّكَ حَمْزَةَ سَيِّدِ الشُّهَداءِ اَلسَّلامُ عَلَى عَمِّكَ وَكَفِيلِكَ أَبِي طَالِبٍ اَلسَّلامُ عَلَى ابْنِ عَمِّكَ جَعْفَرٍ الطَّيَّارِ فِي جِنَانِ الْخُلْدِ اَلسَّلامُ عَلَيْكَ يَا مُحَمَّدُ اَلسَّلامُ عَلَيْكَ يَا أَحْمَدُ اَلسَّلامُ عَلَيْكَ يَا حُجَّةَ اللهِ عَلَى الأَوَّلِينَ وَالآخِرِينَ وَالسَّابِقَ إِلَى طَاعَةِ رَبِّ الْعْالَمِينَ وَالْمُهَيْمِنَ عَلَى رُسُلِهِ وَالْخَاتَمَ لأَنْبِيَائِهِ وَالشَّاهِدَ عَلى خَلْقِهِ وَالشَّفِيعَ إِلَيْهِ وَالْمَكِينَ لَدَيْهِ وَالْمُطَاعَ فِي مَلَكُوتِهِ الأَحْمَدَ مِنَ الأَوْصَافِ الْمُحَمَّدَ لِسَائِرِ الأَشْرَافِ الْكَرِيمَ عِنْدَ الرَّبِّ وَالْمُكَلَّمَ مِن وَّراءِ الْحُجُبِ الْفَائِزَ بِالسِّبَاقِ وَالْفَائِتَ عَنِ اللِّحَاقِ تَسْلِيمَ عَارِفٍ بِحَقِّكَ مُعْتَرِفٍ بِالتَّقْصِيرِ فِي قِيَامِهِ بِوَاجِبِكَ غَيْرِ مُنْكَرٍ مَا انْتَهَى إِلَيْهِ مِنْ فَضْلِكَ مُوقِنٍ بِالْمَزِيدَاتِ مِن رَّبِّكَ مُؤْمِنٍ بِالْكِتَابِ الْمُنْزَلِ عَلَيْكَ مُحَلِّلٍ حَلالَكَ مُحَرِّمٍ حَرَامَكَ أَشْهَدُ يَا رَسُولَ اللهِ مَعَ كُلِّ شَاهِدٍ وَأَتَحَمَّلُهَا عَنْ كُلِّ جَاحِدٍ أَنَّكَ قَدْ بَلَّغْتَ رِسَالاتِ رَبِّكَ وَنَصَحْتَ لأُمَّتِكَ وَجاهَدتَّ في سَبِيلِ رَبِّكَ وصَدَعْتَ بِأَمْرِهِ وَاحْتَمَلْتَ الأَذَى في جَنْبِهِ وَدَعَوْتَ إِلَى سَبِيلِهِ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ الْجَمِيلَةِ وَأَدَّيْتَ الْحَقَّ الَّذي كَانَ عَلَيْكَ وَأَنَّكَ قَدْ رَؤُفْتَ بِالْمُؤْمِنِينَ وَغَلُظْتَ عَلَى الْكَافِرينَ وَعَبَدتَّ اللهَ مُخْلِصاً حَتَّى أَتَاكَ الْيَقِينُ فَبَلَغَ اللهُ بِكَ أَشْرَفَ مَحَلِّ الْمُكَرَّمِينَ وَأَعْلَى مَنَازِلِ الْمُقَرَّبِينَ وَأَرْفَعَ دَرَجَاتِ الْمُرْسَلِينَ حَيْثُ لا يَلْحَقُكَ لَاحِقٌ وَلا يَفُوقُكَ فَائِقٌ وَلا يَسْبِقُكَ سَابِقٌ وَلا يَطْمَعُ فِي إِدْرَاكِكَ طَامِعٌ اَلْحَمْدُ للهِ الَّذِي اسْتَنْقَذَنَا بِكَ مِنَ الْهَلَكَةِ وَهَدَانَا بِكَ مِنَ الضَّلالَةِ وَنوَّرَنَا بِكَ مِنَ الظُّلْمَةِ فَجَزَاكَ اللهُ يَا رَسُولَ اللهِ مِن مَّبْعُوثٍ أَفْضَلَ مَا جَازَى نَبِيًَا عَنْ أُمِّتِهِ وَرَسُولاً عَمَّنْ أُرْسِلَ إِلَيْهِ بَأِي أَنْتَ وَأُمِّي يَا رَسُولَ اللهِ زُرْتُكَ عَارِفاً بِحَقِّكَ مُقِرًّا بِفَضْلِكَ مُسْتَبْصِراً بِضَلالَةِ مَنْ خَالَفَكَ وَخَالَفَ أَهْلَ بَيْتِكَ عَارِفاً بِالْهُدَى الَّذِي أَنْتَ عَلَيْهِ بِأَبِي أَنْتَ وَأُمِّي وَنَفْسِي وَأَهْلِي وَمَالِي وَوَلَدِي أَنَا أُصَلِّي عَلَيْكَ كَمَا صَلَّى اللهُ عَلَيْكَ وَصَلَّى عَلَيْكَ مَلائِكَتُهُ وَأَنْبِيَاؤُهُ وَرُسُلُهُ صَلاةً مُّتَتَابِعَةً وَافِرَةً مُّتَواصِلَةً لاَ انْقِطَاعَ لَهَا وَلا أَمَدَ وَلا أَجَلَ صَلَّى اللهُ عَلَيْكَ وَعَلَى أَهْلِ بَيْتِكَ الطَّيِّبِينَ الطَّاهِرِينَ كَمَا أَنْتُمْ أَهْلُهُ

ثمّ ابسط كفّيك وقل اَللَّـهُمَّ اجْعَلْ جَوَامِعَ صَلَوَاتِكَ وَنَوَامِيَ بَرَكَاتِكَ وَفَوَاضِلَ خَيْرَاتِكَ وَشَرَائِفَ تَحِيَّاتِكَ وَتَسْلِيمَاتِكَ وَكَرَامَاتِكَ وَرَحْمَاتِكَ وَصَلَوَاتِ مَلائِكَتِكَ الْمُقَرَّبِينَ وَأَنْبِيَائِكَ الْمُرْسَلِينَ وَأَئِمَّتِكَ الْمُنْتَجَبِينَ وَعِبَادِكَ الصَّالِحِينَ وَأَهْلِ السَّمَاوَاتِ وَالأَرَضِينَ وَمَنْ سَبَّحَ لَكَ يَا رَبَّ الْعَالَمِينَ مِنَ الأَوَّلِينَ وَالآخِرِينَ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ وَشاهِدِكَ وَنَبِيِّكَ وَنَذِيرِكَ وَأَمِينِكَ وَمَكِينِكَ وَنَجِيِّكَ وَنَجِيبِكَ وَحَبِيبِكَ وَخَلِيلِكَ وَصَفِيِّكَ وَصَفْوَتِكَ وَخَاصَّتِكَ وَخَالِصَتِكَ وَرَحْمَتِكَ وَخَيْرِ خِيَرَتِكَ مِنْ خَلْقِكَ نَبِيِّ الرَّحْمَةِ وَخَازِنِ الْمَغْفِرَةِ وَقَائِدِ الْخَيْرِ وَالْبَرَكَةِ وَمُنْقِذِ الْعِبَادِ مِنَ الْهَلَكَةِ بِإِذْنِكَ وَدَاعِيهِمْ إِلَى دِينِكَ الْقَيِّمِ بِأَمْرِكَ أَوَّلِ النَّبِيِّينَ مِيثَاقاً وَآخِرِهِمْ مَبْعَثاً الَّذِي غَمَسْتَهُ فِي بَحْرِ الْفَضِيلَةِ وَالْمَنْزِلَةِ الْجَلِيلَةِ وَالدَّرَجَةِ الرَّفِيعَةِ وَالْمَرْتَبَةِ الْخَطِيرَةِ وَأَوْدَعْتَهُ الأَصْلابَ الطَّاهِرَةَ وَنَقَلْتَهُ مِنْهَا إِلَى الأَرْحَامِ الْمُطَهَّرَةِ لُطْفاً مِّنْكَ لَهُ وَتَحَنُّناً مِّنْكَ عَلَيْهِ إِذْ وَكَّلْتَ لِصَوْنِهِ وَحِرَاسَتِهِ وَحِفْظِهِ وَحِيَاطَتِهِ مِنْ قُدْرَتِكَ عَيْناً عاصِمَةً حَجَبْتَ بِهَا عَنْهُ مَدَانِسَ الْعَهْرِ وَمَعايِبَ السِّفَاحِ حَتَّى رَفَعْتَ بِهِ نَوَاظِرَ الْعِبَادِ وَأَحْيَيْتَ بِهِ مَيْتَ الْبِلادِ بِأَنْ كَشَفْتَ عَن نُّورِ وِلادَتِهِ ظُلَمَ الأَسْتَارِ وَأَلْبَسْتَ حَرَمَكَ بِهِ حُلَلَ الأَنْوَارِ اَللَّـهُمَّ فَكَمَا خَصَصْتَهُ بِشَرَفِ هَذِهِ الْمَرْتَبَةِ الْكَرِيمَةِ وَذُخْرِ هَذِهِ الْمَنْقَبَةِ الْعَظِيْمَة صَلِّ عَلَيْهِ كَمَا وَفَى بِعَهْدِكَ وَبَلَّغَ رِسَالاتِكَ وَقاتَلَ أَهْلَ الْجُحُودِ عَلَى تَوْحِيدِكَ وَقَطَعَ رَحِمَ الْكُفْرِ فِي إِعْزَازِ دِينِكَ وَلَبِسَ ثَوْبَ الْبَلْوَى في مُجَاهَدَةِ أَعْدَائِكَ وَأَوْجَبْتَ لَهُ بِكُلِّ أَذًى مَّسَّهُ أَوْ كَيْدٍ أَحَسَّ بِهِ مِنَ الْفِئَةِ الَّتِي حَاوَلَتْ قَتْلَهُ فَضِيلَةً تَفُوقُ الْفَضائِلَ وَيَمْلِكُ بِهَا الْجَزِيلَ مِن نَّوالِكَ وَقَدْ أَسَرَّ الْحَسْرَةَ وَأَخْفَى الزَّفْرَةَ وَتَجَرَّعَ الْغُصَّةَ وَلَمْ يَتَخَطَّ مَا مَثَّلَ لَهُ وَحْيُكَ اَللَّـهُمَّ صَلِّ عَلَيْهِ وَعَلَى أَهْلِ بَيْتِهِ صَلاةً تَرْضَاهَا لَهُمْ وَبَلِّغْهُمْ مِنَّا تَحِيَّةً كَثيرَةً وَّسَلاماً وَآتِنَا مِن لَّدُنْكَ فِي مُوَالاتِهِمْ فَضْلاً وَّإِحْسَاناً وَرَحْمَةً وَّغُفْرَاناً إِنَّكَ ذُو الْفَضْلِ الْعَظيمِ''',
    ),
    Ziyarat(
      title: 'زيارة أمير المؤمنين عليه السلام',
      benefits: 'زيارة أمير المؤمنين (ع)',
      text: '''بسم الله الرحمن الرحيم

اَلسَّلامُ عَلَيْكَ يَا أَمِينَ اللهِ فِي أَرْضِهِ وَحُجَّتَهُ عَلَى عِبَادِهِ أَشْهَدُ أَنَّكَ جاهَدتَّ فِي اللهِ حَقَّ جِهَادِهِ وَعَمِلْتَ بِكِتَابِهِ وَاتَّبَعْتَ سُنَنَ نَبِيِّهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ حَتَّى دَعَاكَ اللهُ إِلَى جِوَارِهِ فَقَبَضَكَ إِلَيْهِ بِاخْتِيَارِهِ وَأَلْزَمَ أَعْدَاءَكَ الْحُجَّةَ مَعَ مَا لَكَ مِنَ الْحُجَجِ الْبَالِغَةِ عَلَى جَمِيع خَلْقِهِ اَللَّهُمَّ فَاجْعَلْ نَفْسِي مُطْمَئِنَّةً بِقَدَرِكَ رَاضِيَةً بِقَضَائِكَ مُولَعَةً بِذِكْرِكَ وَدُعَائِكَ مُحِبَّةً لِّصَفْوَةِ أَوْلِيَائِكَ مَحْبُوبَةً فِي أَرْضِكَ وَسَمَائِكَ صَابِرَةً عَلَى نُزُولِ بَلائِكَ شاكِرَةً لِّفَوَاضِلِ نَعْمَائِكَ ذاكِرَةً لِّسَوَابِغِ آلائِكَ مُشْتَاقَةً إِلَى فَرْحَةِ لِقَائِكَ مُتَزَوِّدَةً التَّقْوَى لِيَوْمِ جَزَائِكَ مُسْتَنّةً بِسُنَنِ أَوْلِيَائِكَ مُفَارِقةً لِّأَخْلاقِ أَعْدَائِكَ مَشْغُولَةً عَنِ الدُّنْيَا بِحَمْدِكَ وَثَنَائِكَ اَللَّهُمَّ إِنَّ قُلُوبَ الْمُخْبِتِينَ إِلَيْكَ وَالِهَةٌ وَّسُبُلَ الرَّاغِبِينَ إِلَيْكَ شَارِعَةٌ وَّأَعْلامَ الْقَاصِدِينَ إِلَيْكَ وَاضِحَةٌ وَّأَفْئِدَةَ الْعَارِفِينَ مِنْكَ فَازِعَةٌ وَّأَصْوَاتَ الدَّاعِينَ إِلَيْكَ صَاعِدَةٌ وَّأَبْوَابَ الإِجابَةِ لَهُم مُّفَتَّحَةٌ وَّدَعْوَةَ مَن نَّاجَاكَ مُسْتَجَابَةٌ وَّتَوْبَةَ مَنْ أَنَابَ إِلَيْكَ مَقْبُولَةٌ وَعَبْرَةَ مَنْ بَكَى مِنْ خَوْفِكَ مَرْحُومَةٌ وَّالإِغَاثَةَ لِمَنِ اسْتَغَاثَ بِكَ مَوْجُودَةٌ وّالإِعَانَةَ لِمَنِ اسْتَعَانَ بِكَ مَبْذُولَةٌ وَّعِدَاتِكَ لِعِبَادِكَ مُنْجَزَةٌ وَّزَلَلَ مَنِ اسْتَقَالَكَ مُقَالَةٌ وَّأَعْمَالَ الْعَامِلِينَ لَدَيْكَ مَحْفُوظَةٌ وَّأَرْزَاقَكَ إِلَى الْخَلائِقِ مِن لَّدُنْكَ نَازِلَةٌ وَّعَوَائِدَ الْمَزِيدِ إِلَيْهِمْ واصِلَةٌ وَّذُنُوبَ الْمُسْتَغْفِرينَ مَغْفُورَةٌ وَّحَوائِجَ خَلْقِكَ عِنْدَكَ مَقْضِيَّةٌ وَّجَوَائِزَ السَّائِلِينَ عِنْدَكَ مُوَفَّرَةٌ وَّعَوائِدَ الْمَزيدِ مُتَواتِرَةٌ وَّمَوَائِدَ الْمُسْتَطْعِمِينَ مُعَدَّةٌ وَّمَنَاهِلَ الظِّمَاءِ مُتْرَعَةٌ اَللّهُمَّ فَاسْتَجِبْ دُعَائِي وَاقْبَلْ ثَنَائِي وَاجْمَعْ بَيْنِي وَبَيْنَ أَوْلِيَائِي بِحَقِّ مُحَمَّدٍ وَعَلِيٍّ وَّفَاطِمَةَ وَالْحَسَنِ وَالْحُسَيْنِ إِنَّكَ وَلِيُّ نَعْمَائِي وَمُنْتَهَى مُنَايَ وَغَايَةُ رَجَائِي فِي مُنْقَلَبِي وَمَثْوَايَ''',
    ),
    Ziyarat(
      title: 'زيارة السيدة الزهراء عليها السلام',
      benefits: 'زيارة فاطمة الزهراء (ع)',
      text: '''بسم الله الرحمن الرحيم 

يَا مُمْتَحَنَةُ امْتَحَنَكِ اللهُ الَّذِي خَلَقَكِ قَبْلَ أَن يَّخْلُقَكِ فَوَجَدَكِ لِمَا امْتَحَنَكِ صَابِرَةً وَزَعَمْنَا أَنَّا لَكِ أَوْلِيَاءُ وَمُصَدِّقُونَ وَصَابِرُونَ لِكُلِّ مَا أَتَى بِهِ أَبُوكِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَأَتَى بِهِ وَصِيُّهُ فَإِِنَّا نَسْأَلَكِ إِنْ كُنَّا صَدَّقْنَاكِ إِلَّا أَلْحَقْتِنَا بِتَصْدِيقِنَا لَهُمَا لِنُبَشِّرَ أَنْفُسَنَا بِأَنَّا قَدْ طَهُرْنا بِوِلايَتِكِ اَلسَّلامُ عَلَيْكِ يَا بِنْتَ رَسُولِ اللهِ اَلسَّلامُ عَلَيْكِ يَا بِنْتَ نَبِيِّ اللهِ اَلسَّلامُ عَلَيْكِ يَا بِنْتَ حَبِيبِ اللهِ اَلسَّلامُ عَلَيْكِ يَا بِنْتَ خَلِيلِ اللهِ اَلسَّلامُ عَلَيْكِ يَا بِنْتَ صَفِيِّ اللهِ اَلسَّلامُ عَلَيْكِ يَا بِنْتَ أَمِينِ اللهِ اَلسَّلامُ عَلَيْكِ يَا بِنْتَ خَيْرِ خَلْقِ اللهِ اَلسَّلامُ عَلَيْكِ يا بِنْتَ أَفْضَلِ أَنْبِياءِ اللهِ وَرُسُلِهِ وَمَلائِكَتِهِ اَلسَّلامُ عَلَيْكِ يَا بِنْتَ خَيْرِ الْبَرِيَّةِ اَلسَّلامُ عَلَيْكِ يَا سَيِّدَةَ نِسَاءِ العَالَمِينَ مِنَ الأوَّلِينَ وَالآخِرِينَ اَلسَّلامُ عَلَيْكِ يا زَوْجَةَ وَلِيِّ اللهِ وَخَيْرِ الخَلْقِ بَعْدَ رَسُولِ اللهِ اَلسَّلامُ عَلَيْكِ يَا أُمَّ الْحَسَنِ وَالْحُسَيْنِ سَيِّدَيْ شَبَابِ أَهْلِ الْجَنَّةِ اَلسَّلامُ عَلَيْكِ أَيَّتُهَا الصِّدِّيقَةُ الشَّهِيدَةُ اَلسَّلامُ عَلَيْكِ أَيَّتُهَا الرَّضِيَّةُ المَرْضِيَّةُ اَلسَّلامُ عَلَيْكِ أَيَّتُهَا الْفَاضِلَةُ الزَّكِيَّةُ اَلسَّلامُ عَلَيْكِ أَيَّتُهَا الْحَوْراءُ الإِنْسِيَّةُ اَلسَّلامُ عَلَيْكِ أَيَّتُهَا التَّقِيَّةُ النَّقِيَّةُ اَلسَّلامُ عَلَيْكِ أَيَّتُهَا المُحَدَّثَةُ العَلِيمَةُ اَلسَّلامُ عَلَيْكِ أَيَّتُهَا الْمَظْلُومَةُ الْمَغْصُوبَةُ اَلسَّلامُ عَلَيْكِ أَيَّتُهَا الْمُضْطَهَدَةُ الْمَقْهُورَةُ السَّلامُ عَلَيْكِ يَا فَاطِمَةُ بِنْتَ رَسُولِ اللهِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ''',
    ),
    Ziyarat(
      title: 'زيارة الإمام الحسين عليه السلام',
      benefits: 'زيارة الإمام الحسين (ع)',
      text: '''بسم الله الرحمن الرحيم

اَلسَّلامُ عَلَيْكَ يَا وَارِثَ آدَمَ صَفوَةِ اللهِ اَلسَّلامُ عَلَيْكَ يَا وَارِثَ نُوحٍ نَّبِيِّ اللهِ اَلسَّلامُ عَلَيْكَ يَا وَارِثَ إِبرَاهِيمَ خَلِيلِ اللهِ اَلسَّلامُ عَلَيْكَ يَا وَارِثَ مُوسَى كَلِيمِ اللهِ اَلسَّلامُ عَلَيْكَ يَا وَارِثَ عِيسَى رُوحِ اللهِ اَلسَّلامُ عَلَيْكَ يَا وَارِثَ مُحَمَّدٍ حَبِيبِ اللهِ اَلسّّلامُ عَلَيْكَ يَا وَارِثَ أَمِيرِ المُؤمِنِينَ وَلِيِّ اللهِ اَلسَّلامُ عَلَيْكَ يَابْنَ مُحمَّدٍ المُصْطَفَى اَلسَّلامُ عَلَيْكَ يَابنَ عَليٍّ المُرْتَضَى اَلسَّلامُ عَلَيْكَ يَابْنَ فاطِمَةَ الزَّهْرَاءِ اَلسَّلامُ عَلَيْكَ يَابْنَ خَدِيجَةَ الْكُبْرَى اَلسَّلامُ عَلَيْكَ يَا ثَارَ اللهِ وَابْنَ ثَأْرِهِ وَالْوِتْرَ الْمُوْتُورَ أَشهَدُ أَنَّكَ قَدْ أَقَمْتَ الصَّلاةَ وَآتَيْتَ الزَّكَاةَ وَأمَرْتَ بِالْمَعرُوفِ وَنَهَيْتَ عَنِ المُنْكَرِ وَأَطَعْتَ اللهَ وَرَسُولَهُ حَتَّى أَتَاكَ الْيَقِينُ فَلَعَنَ اللهُ أُمَّةً قَتَلَتْكَ وَلَعَنَ اللهُ أُمَّةً ظَلَمَتْكَ وَلَعَنَ اللهُ أُمَّةً سَمِعَتِ بِذَلِكَ فَرَضِيَتْ بِهِ يَا مَولايَ يَا أَبَا عَبدِ اللهِ أَشْهَدُ أَنَّكَ كُنْتَ نُوراً فِي الأَصْلابِ الشَّامِخَةِ وَالأَرْحَامِ المُطَهَّرَةِ لَمْ تُنَجّسْكَ الْجَاهِلِيَّةُ بِأَنْجَاسِهَا وَلَمْ تُلْبِسْكَ مِن مُّدْلَهِمَّاتِ ثِيَابِهَا وَأَشْهَدُ أَنَّكَ مِنْ دَعَائِمِ الدِّينِ وَأَرْكَانِ الْمُؤمِنِينَ وَأَشْهَدُ أَنَّكَ الإِمَامُ البَرُّ التَّقِيُّ الرَّضِيُّ الزَّكِيُّ الْهَادِيُ الْمَهْدِيُّ وَأَشهَدُ أنَّ الأَئِمَّةَ مِن وُّلْدِكَ كَلِمَةُ التَّقْوَى وَأَعْلامُ الْهُدَى وَالْعُرْوَةُ الْوُثْقَى وَالْحُجَّةُ عَلَى أَهْلِ الدُّنيَا وَأُشهِدُ اللهَ وَمَلائِكَتَهُ وأَنْبِيَاءَهُ وَرُسُلَهُ أَنِّي بِكُم مُؤمِنٌ وَّبِإِيَابِكُمْ مُوْقِنٌ بِشَرَائِعِ دِينِي وَخوَاتِيمِ عَمَلِي وَقَلْبِي لِقَلْبِكُم سِلْمٌ وَأَمْرِي لِأَمْرِكُم مُتَّبِعٌ صَلَوَاتُ اللهِ عَلَيْكُم وَعَلَى أَرْوَاحِكُم وَعَلَى أَجْسَادِكُم وَعَلَى أَجْسَامِكُم وَعَلَى شَاهِدكُم وَعَلَى غَائِبِكُم وَعَلَى ظَاهِرِكُمْ وَعَلَى بَاطِنِكُمْ بِأَبِي أَنْتَ وَأُمِّي يَابْنَ رَسُولِ اللهِ بِأَبِي أَنْتَ وَأُمِّي يَا أَبَا عَبْدِ اللهِ لَقَدْ عَظُمَتِ الرَّزِيَّةُ وَجَلَّتِ الْمُصِيبَةُ بِكَ عَلَيْنَا وَعَلَى جَميعِ أَهْلِ السَّمَاوَاتِ والْأَرْضِ فَلَعَنَ اللهُ أُمَّةً أَسْرَجَتْ وَأَلْجَمَتْ وَتَهَيَّأَتْ لِقِتَالِكَ يَا مَوْلايَ يَا أَبَا عَبْدِ اللهِ قَصَدتُّ حَرَمَكَ وَأَتَيْتُ إِلَى مَشْهَدِكَ أَسْألُ اللهَ بِالشَّأْنِ الَّذي لَكَ عِنْدَهُ وبِالْمَحَلِّ الَّذِي لَكَ لَدَيْهِ أَن يُّصَلِّيَ عَلَى مُحَمَّدٍ وَّآلِ مُحَمَّدٍ وَأَن يَّجْعَلَنِي مَعَكُمْ فِي الدُّنْيَا وَالْآخِرَةِ

ثمّ قم وصِرْ إلى عند رجلَيْ القبر وقفْ عند رأس عليّ بن الحسين عليه السلام وقل اَلسَّلامُ عَلَيْكَ يابْنَ رَسُولِ اللهِ اَلسَّلامُ عَلَيْكَ يابْنَ نَبِيِّ اللهِ اَلسَّلامُ عَلَيْكَ يابْنَ أَمِيرِ الْمُؤْمِنِينَ اَلسَّلامُ عَلَيْكَ يابْنَ الْحُسَيْنِ الشَّهِيدِ اَلسَّلامُ عَلَيْكَ أَيُّهَا الشَّهِيدُ السَّلامُ عَلَيْكَ أَيُّهَا الْمَظْلُومُ وَابْنُ الْمَظْلُومُ لَعَنَ اللهُ أُمَّةً قَتَلَتْكَ وَلَعَنَ اللهُ أُمَّةً ظَلَمَتْكَ وَلَعَنَ اللهُ أُمَّةً سَمِعَتْ بِذلِكَ فَرَضِيَتْ بِهِ

ثم انكب على القبر وقل اَلسَّلامُ عَلَيْكَ يَا وَلِيَّ اللهِ وَابْنَ وَلِيِّهِ لَقَدْ عَظُمَتِ الْمُصِيبَةُ وَجَلَّتِ الرَّزِيَّةُ بِكَ عَلَيْنَا وَعَلَى جَمِيعِ الْمُسْلِمِينَ فَلَعَنَ اللهُ أُمَّةً قَتَلَتْكَ وَأَبْرَأُ إِلَى اللهِ وَإِلَيْكَ مِنْهُمْ  

ثمّ توجّه إلى الشهداء وقل اَلسَّلامُ عَلَيْكُمْ يَا أَوْلِيَاءَ اللهِ وَأَحِبَّاءَهُ اَلسَّلامُ عَلَيْكُمْ يَا أَصْفِيَاءَ اللهِ وَأَوِدَّاءَهُ اَلسَّلامُ عَلَيْكُمْ يَا أَنْصَارَ دِينِ اللهِ اَلسَّلامُ عَلَيْكُمْ يَا أَنْصَارَ رَسُولِ اللهِ اَلسَّلامُ عَلَيْكُمْ يَا أَنْصَارَ أَمِيرِ الْمُؤْمِنِينَ اَلسَّلامُ عَلَيْكُمْ يَا أَنْصَارَ فاطِمَةَ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ اَلسَّلامُ عَلَيْكُمْ يَا أَنْصارَ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيٍّ الْوَلِيِّ النَّاصِحِ اَلسَّلامُ عَلَيْكُمْ يَا أَنْصَارَ أَبِي عَبْدِ اللهِ بِأَبِي أَنْتُمْ وَأُمِّي طِبْتُمْ وَطَابَتِ الأَرْضُ الَّتِي فِيهَا دُفِنْتُمْ وَفُزْتُمْ فَوْزاً عَظِيماً فَيَا لَيْتَنِي كُنْتُ مَعَكُمْ فَأَفُوزَ مَعَكُمْ''',
    ),
    Ziyarat(
      title: 'زيارة العباس عليه السلام',
      benefits: 'زيارة أبي الفضل العباس (ع)',
      text: '''بسم الله الرحمن الرحيم

سَلامُ اللهِ وَسَلامُ مَلائِكَتِهِ الْمُقَرَّبِينَ وَأَنْبِيَائِهِ الْمُرْسَلِينَ وَعِبَادِهِ الصَّالِحِينَ وَجَمِيعِ الشُّهَداءِ وَالصِّدِّيقِينَ وَالزَّاكِيَاتُ الطَّيِّبَاتُ فِيمَا تَغْتَدِي وَتَرُوحُ عَلَيْكَ يَابْنَ أَمِيرِ الْمُؤْمِنِينَ أَشْهَدُ لَكَ بِالتَّسْلِيمِ وَالتَّصْدِيقِ وَالْوَفَاءِ وَالنَّصِيحَةِ لِخَلَفِ النَّبِيِّ الْمُرْسَلِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَالسِّبْطِ الْمُنْتَجَبِ وَالدَّلِيلِ الْعَالِمِ وَالْوَصِيِّ الْمُبَلِّغِ وَالْمَظْلُومِ الْمُهْتَضَمِ فَجَزَاكَ اللهُ عَن رَّسُولِهِ وَعَنْ أَمِيرِ الْمُؤْمِنينَ وَعَنْ فَاطِمَةَ والْحَسَنِ وَالْحُسَيْنِ صَلَوَاتُ اللهِ عَلَيْهِمْ أَفْضَلَ الْجَزاءِ بِمَا صَبَرْتَ وَاحْتَسَبْتَ وَأَعَنْتَ فَنِعْمَ عُقْبَى الدَّارِ لَعَنَ اللهُ مَنْ قَتَلَكَ وَلَعَنَ اللهُ مَنْ جَهِلَ حَقَّكَ وَاسْتَخَفَّ بِحُرْمَتِكَ وَلَعَنَ اللهُ مَنْ حَالَ بَيْنَكَ وَبَيْنَ مَاءِ الْفُرَاتِ أَشْهَدُ أَنَّكَ قُتِلْتَ مَظْلُوماً وَأَنَّ اللهَ مُنْجِزٌ لَّكُم مَّا وَعَدَكُمْ جِئْتُكَ يَابْنَ أَمِيرِ اْلُمْؤْمِنينَ وَافِداً إِلَيْكُمْ وَقَلْبِي مُسَلِّمٌ لَّكُمْ وَتابِعٌ وَأَنَا لَكُمْ تَابِعٌ وَنُصْرَتِي لَكُم مُّعَدَّةٌ حَتّى يَحْكُمَ اللهُ وَهُوَ خَيْرُ الْحَاكِمِينَ فَمَعَكُمْ مَعَكُمْ لا مَعَ عَدُوِّكُمْ إِنِّي بِكُمْ وَبِإِيَابِكُمْ مِنَ الْمُؤْمِنينَ وَبِمَنْ خَالَفَكُمْ وَقَتَلَكُمْ مِنَ الْكَافَرِينَ قَتَلَ اللهُ أُمَّةً قَتَلَتْكُمْ بِالأَيْدِي وَالأَلْسُنِ

ثمّ ادخل فانكبّ على القبر وقل اَلسَّلامُ عَلَيْكَ أَيُّهَا الْعَبْدُ الصَّالِحُ الْمُطِيعُ للهِ وَلِرَسُولِهِ وَلِأَميرِ الْمُؤْمِنينَ وَالْحَسَنِ والْحُسَيْنِ صَلَّى اللهُ عَلَيْهِمْ وَسَلَّمَ اَلسَّلامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ وَمَغْفِرَتُهُ وَرِضْوَانُهُ وَعَلَى رُوحِكَ وَبَدَنِكَ أَشْهَدُ وأُشْهِدُ اللهَ أَنَّكَ مَضَيْتَ عَلَى مَا مَضَى بِهِ الْبَدْرِيُّونَ وَالْمُجَاهِدُونَ فِي سَبيلِ اللهِ الْمُنَاصِحُونَ لَهُ فِي جِهَادِ أَعْدَائِهِ الْمُبَالِغُونَ فِي نُصْرَةِ أَوْلِيَائِهِ الذَّابُّونَ عَنْ أَحِبَّائِهِ فَجَزاكَ اللهُ أَفْضَلَ الْجَزاءِ وَأَكْثَرَ الْجَزاءِ وَأَوْفَرَ الْجَزَاءِ وَأَوْفَى جَزاءِ أَحَدٍ مِمَّن وَّفَى بِبَيْعَتِهِ وَاسْتَجابَ لَهُ دَعْوَتَهُ وَأَطَاعَ وُلاةَ أَمْرِهِ أَشْهَدُ أَنَّكَ قَدْ بَالَغْتَ فِي النَّصِيحَةِ وَأَعْطَيْتَ غايَةَ الْمَجْهُودِ فَبَعَثَكَ اللهُ فِي الشُّهَداءِ وَجَعَلَ رُوحَكَ مَعَ أَرْوَاحِ السُّعَداءِ وَأَعْطَاكَ مِنْ جِنَانِهِ أَفْسَحَهَا مَنْزِلاً وَّأَفْضَلَهَا غُرَفاً وَّرَفَعَ ذِكْرَكَ فِي عِلِّيِّينَ وَحَشَرَكَ مَعَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَداءِ وَالصَّالِحِينَ وَحَسُنَ أُولَئِكَ رَفِيقاً أَشْهَدُ أَنَّكَ لَمْ تَهِن وَّلَمْ تَنْكُلْ وَأَنَّكَ مَضَيْتَ عَلَى بَصِيرَةٍ مِنْ أَمْرِكَ مُقْتَدِرِياً بِالصَّالِحِينَ وَمُتَّبِعاً لِّلنَّبِيِّينَ فَجَمَعَ اللهُ بَيْنَنَا وَبَيْنَكَ وَبَيْنَ رَسُولِهِ وَأَوْلِيَائِهِ فِي مَنَازِلِ الْمُخْبِتِينَ فَإِنَّهُ أَرْحَمُ الرَّاحِمِينَ

ثمّ صرْ إلى الرأس الشريف وصلّ ركعتين وادعُ بهذا الدعاء اَللَّـهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَّآلِ مُحَمَّدٍ وَّلا تَدَعْ لِي فِي هذَا الْمَكَانِ الْمُكَرَّمِ وَالْمَشْهَدِ الْمُعَظَّمِ ذَنْباً إِلَّا غَفَرْتَهُ وَلا هَمًّا إِلَّا فَرَّجَتَهُ وَلا مَرَضاً إِلَّا شَفَيْتَهُ وَلا عَيْباً إِلَّا سَتَرْتَهُ وَلا رِزْقاً إِلَّا بَسَطتَّهُ وَلا خَوْفاً إِلَّا آمَنْتَهُ وَلا شَمْلاً إِلَّا جَمَعْتَهُ وَلا غائِباً إِلَّا حَفِظْتَهُ وَأَدْنَيْتَهُ وَلا حَاجَةً مِّنْ حَوَائِجِ الدُّنْيَا وَالآخِرَةِ لَكَ فِيهَا رِضًى وَلِيَ فِيهَا صَلاحٌ إِلَّا قَضَيْتَها يَا أَرْحَمَ الرَّاحِمِينَ

ثمّ عُدْ إلى جهة الرّجلَيْن وقُلْ اَلسَّلامُ عَلَيْكَ يَا أَبَا الْفَضْلِ الْعَبَّاسَ بْنَ أَمِيرِ الْمُؤْمِنينَ اَلسَّلامُ عَلَيْكَ يَابْنَ سَيِّدِ الْوَصِيِّينَ اَلسَّلامُ عَلَيْكَ يَابْنَ أَوَّلِ الْقَوْمِ إِسْلاماً وَّأَقْدَمِهِمْ إِيْمَاناً وَّأَقْوَمِهِمْ بِدِينِ اللهِ وَأَحْوَطِهِمْ عَلَى الإِسْلامِ أَشْهَدُ لَقَدْ نَصَحْتَ للهِ وَلِرَسُولِهِ وَلِأَخيكَ فَنِعْمَ الأَخُ الْمُواسي فَلَعَنَ اللهُ أُمَّةً قَتَلَتْكَ وَلَعَنَ اللهُ أُمَّةً ظَلَمَتْكَ وَلَعَنَ اللهُ أُمَّةً اسْتَحَلَّتْ مِنْكَ الْمَحَارِمَ وَانْتَهَكَتْ حُرْمَةَ الإِسْلامِ فَنِعْمَ الصَّابِرُ الْمُجَاهِدُ الْمُحَامِي النَّاصِرُ وَالأَخُ الدَّافِعُ عَنْ أَخِيهِ الْمُجيبُ إِلَى طَاعَةِ رَبِّهِ الرَّاغِبُ فِيمَا زَهِدَ فِيهِ غَيْرُهُ مِنَ الثَّوَابِ الْجَزِيلِ وَالثَّنَاءِ الْجَمِيلِ وَأَلْحَقَكَ اللهُ بِدَرَجَةِ آبَائِكَ فِي جَنَّاتِ النَّعِيمِ اَللَّـهُمَّ إِنِّي تَعَرَّضْتُ لِزِيَارَةِ أَوْلِيَائِكَ رَغْبَةً فِي ثَوَابِكَ وَرَجَاءً لِّمَغْفِرَتِكَ وَجَزيلِ إِحْسَانِكَ فَأَسْأَلُكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَّآلِهِ الطَّاهِرِينَ وَأَنْ تَجْعَلَ رِزْقِي بِهِمْ دَارًّا وَّعَيْشِي بِهِمْ قَارًّا وَّزِيَارَتِي بِهِمْ مَقْبُولَةً وَّحَيَاتِي بِهِمْ طَيِّبَةً وَّأَدْرِجْنِي إِدْرَاجَ الْمُكْرَمِينَ وَاجْعَلْنِي مِمَّن يَّنْقَلِبُ مِنْ زِيَارَةِ مَشَاهِدِ أَحِبَّائِكَ مُفْلِحاً مُّنْجِحاً قَدِ اسْتَوْجَبَ غُفْرَانَ الذُّنُوبِ وَسَتْرَ الْعُيُوبِ وَكَشْفَ الْكُرُوبِ إِنَّكَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَةِ''',
    ),
    Ziyarat(
      title: 'زيارة السيدة زينب عليها السلام',
      benefits: 'زيارة السيدة زينب الكبرى (ع)',
      text: '''بسم الله الرحمن الرحيم

اَلسَّلامُ عَلَيْكِ يَا بِنْتَ سَيِّدِ الأَنْبِيَاءِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ صَاحِبِ الْحَوْضِ وَاللِّوَاءِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ مَنْ عُرِجَ بِهِ إِلَى السَّماءِ وَوَصَلَ إِلَى مَقَامِ قَابِ قَوْسَيْنِ أَوْ أَدْنَى ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ نَبِيِّ الْهُدَى وَسَيِّدِ الْوَرَى وَمُنْقِذِ الْعِبَادِ مِنَ الرَّدَى ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ صَاحِبِ الْخُلُقِ الْعَظِيمِ وَالشَّرَفِ الْعَمِيمِ وَالآيَاتِ وَالذِّكْرِ الْحَكِيمِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ صَاحِبِ الْمَقَامِ الْمَحْمُودِ وَالْحَوْضِ الْمَوْرُودِ وَاللِّوآءِ الْمَشْهُودِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ مَنْهَجِ دِينِ الإِسْلامِ وَصَاحِبِ الْقِبْلَةِ وَالْقُرْآنِ وَعَلَمِ الصِّدْقِ وَالْحَقِّ وَاْلإِحْسانِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ صَفْوَةِ الأَنْبِيَاءِ وَعَلَمِ الأَتْقِيَاءِ وَمَشْهُورِ الذِّكْرِ فِي السَّمَاءِ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ .

اَلسَّلامُ عَلَيْكِ يَا بِنْتَ خَيْرِ خَلْقِ اللهِ وَسَيِّدِ خَلْقِهِ وَأَوَّلِ الْعَدَدِ قَبْلَ إِيجَادِ أَرْضِهِ وَسَمَاوَاتِهِ ، وَآخِرِ اْلأَبَدِ بَعْدَ فَنَاءِ الدُّنْيَا وَأَهْلِهِ الَّذِي رُوحُهُ نُسْخَةُ اللَّاهُوتِ وَصُورَتُهُ نُسْخَةُ الْمُلْكِ وَالْمَلَكُوتِ وَقَلْبُهُ خِزَانَةُ الْحَيِّ الَّذِي لا يَمُوتُ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ الْمُظَلَّلِ بِالْغَمَامِ سَيِّدِ الْكَوْنَيْنِ وَمَوْلَى الثَّقَلَيْنِ وَشَفِيعِ الأُمَّةِ يَوْمَ الْمَحْشَرِ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ سَيِّدِ اْلأَوْصِيَاءِ ، اَلسَّلامُ عَلَيْكَ يَا بِنْتَ إِمَامِ الأَتْقِيَاءِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ رُكْنِ الأَوْلِيَاءِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ عِمَادِ اْلأَصْفِيَاءِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ يَعْسُوبِ الدِّينِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ أَمِيرِ الْمُؤْمِنِينِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ سَيِّدِ الْوَصِيِّينَ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ قَائِدِ الْبَرَرَةِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ قَامِعِ الْكَفَرَةِ وَالْفَجَرَةِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ وَارِثِ النَّبِيِّينَ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ خَلِيفَةِ سَيِّدِ الْمُرْسِلِينَ ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ ضِيَاءِ الدِّينِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ النَّبَإِ الْعَظِيمِ عَلَى الْيَقِينِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ مَنْ حِسَابُ النَّاسِ عَلَيْهِ وَالْكَوْثَرُ فِي يَدَيْهِ وَالْنَصُّ يَوْمَ الْغَدِيرِ عَلَيْهِ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ .

اَلسَّلامُ عَلَيْكِ يَا بِنْتَ مَنْ قَادَ زِمَامَ نَاقَتِهَا جِبْرَائِيلُ وَشَارَكَها فِي مُصَابِهَا إِسْرَافِيلُ وَغَضِبَ بِسَبَبِهَا الرَّبُّ الْجَلِيلُ وَبَكَى لِمُصَابِهَا إِبْرَاهِيمُ الْخَلِيلُ وَنُوحٌ وَّمُوسَى الْكَلِيمُ فِي كَرْبَلاءِ الْحُسَيْنِ الشَّهِيدِ الْغَرِيبِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ الْبُدُورِ السَّوَاطِعِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ الشُّمُوسِ الطَّوَالِعِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ زَمْزَمَ وَالصَّفا ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ مَكَّةَ وَمِنًى ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ مَنْ حُمِلَ عَلَى الْبُرَاقِ فِي الْهَوَاءِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ مَنْ أُسْرِيَ بِهِ مِنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الأَقْصَى ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ مَنْ ضَرَبَ بِالسَّيْفَيْنِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ مَنْ صَلَّى الْقِبْلَتَيْنِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ الْمُصْطَفَى ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ عَلِيٍّ الْمُرْتَضى ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ فَاطِمَةَ الزَّهْرَاءِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ خَدِيجَةَ الْكُبْرَى ، اَلسَّلامُ عَلَيْكِ وَعَلَى جَدِّكِ مُحَمَّدٍ الْمُخْتَارِ ، اَلسَّلامُ عَلَيْكِ وَعَلَى أَبِيكِ حَيْدَرِ الْكَرَّارِ ، اَلسَّلامُ عَلَيْكِ وَعَلَى السَّادَاتِ اْلأَطْهَارِ الأَخْيَارِ وَهُمْ حُجَجُ اللهِ عَلَى الأَقْطَارِ ، سَادَاتُ الأَرْضِ وَالسَّمَاءِ مِنْ أَخِيكِ الْحُسَيْنِ الشَّهِيدِ الْعَطْشَانِ الظَّمْآنِ ، وَهُوَ أَبُو التِّسْعَةِ الأَطْهَارِ وَهُمْ حُجَجُ اللهِ فِي الشَّرْقِ وَالْغَرْبِ وَالأَرْضِ وَالسَّمَاءِ ، الَّذِينَ حُبُّهُمْ فَرْضٌ عَلَى أَعْنَاقِ كُلِّ الْخَلائِقِ الْمَخْلُوقِينَ لِلْخَالِقِ الْقَادِرِ السُّبْحَانِ .

اَلسَّلامُ عَلَيْكِ يَا بِنْتَ وَلِيِّ اللهِ الأَعْظَمِ ، اَلسَّلامُ عَلَيْكِ يَا بِنْتَ وَلِيِّ اللهِ الْمُعَظَّمِ ، اَلسَّلامُ عَلَيْكِ يَا عَمَّةَ وَلِيِّ اللهِ الْمُكَرَّمِ ، اَلسَّلامُ عَلَيْكِ يَا أُمَّ الْمَصَايِبِ يَا زَيْنَبُ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ ، اَلسَّلامُ عَلَيْكِ أَيَّتُهَا الصِّدِّيقَةُ الْمَرْضِيَّةُ ، اَلسَّلامُ عَلَيْكِ أَيَّتُهَا الْفَاضِلَةُ الرَّشِيدَةُ ، اَلسَّلامُ عَلَيْكِ أَيَّتُهَا التَّقِيَّةِ النَّقِيَّةِ ، اَلسَّلامُ عَلَيْكِ يَا مَنْ ظَهَرَتْ مَحَبَّتُهَا لِلْحُسَيْنِ الْمَظْلُومِ فِي مَوَارِدَ عَدِيدَةٍ وَتَحَمَّلَتِ الْمَصَايِبَ الْمُحْرِقَةَ لِلْقُلُوبِ مَعَ تَحَمُّلاتٍ شَدِيدَةٍ ، اَلسَّلامُ عَلَيْكِ يَا مَنْ حَفِظَتْ الإِمَامَ فِي يَوْمِ عاشُورَاءِ فِي قَتْلِهِ وَبَذَلَتْ نَفْسَهَا فِي نَجَاةِ زَيْنِ الْعَابِدِينَ عَلَيْهِ السَّلامُ فِي مَجْلِسِ أَشْقَى اْلأَشْقِيَاءِ وَنَطَقَتْ كَنُطْقِ عَلِيٍّ عَلَيْهِ السَّلامُ فِي سِكَكِ الْكُوفَةِ وَحَوْلَهَا كَثِيرٌ مِنَ اْلأَعْدَاءِ ، اَلسَّلامُ عَلَيْكِ يَا مَن نَّطَحَتْ جَبِينَهَا بِمُقَدَّمِ الْمَحْمِلِ إِذْ رَأَتْ رَأْسَ الشُّهَدَاءِ وَيَخْرُجُ الدَّمُ مِنْ تَحْتِ قِنَاعِهَا وَمِنْ مَحْمِلِهَا بِحَيْثُ يَرَى مِنْ حَوْلِهَا اْلأَعْدَاءُ ، اَلسَّلامُ عَلَيْكِ يَا تَالِيَ الْمَعْصُومِ ، اَلسَّلامُ عَلَيْكِ يَا مُمْتَحَنَةُ فِي تَحَمُّلاتِ الْمَصَايِبِ كَالْحُسَينِ المَظْلُومِ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ ، اَلسَّلامُ عَلَيْكِ أَيَّتُهَا الْبَعِيدَةُ الْمُتَحَيِّرَةُ فِي خَرَابَةِ الشَّامِ ، اَلسَّلامُ عَلَيْكِ أَيَّتُهَا الْمُتَحَيِّرَةُ فِي وُقُوفِكِ عَلَى جَسَدِ سَيِّدِ الشُّهَدَاءِ وَخَاطَبْتِ جَدَّكِ رَسُولَ اللهِ بِهَذَا النِّدَاءِ : صَلَّى عَلَيْكَ مَلِيكُ السَّمَاءِ ، هَذَا حُسَيْنٌ بِالْعَراءِ مَسْلُوبَ الْعِمَامَةِ وَالرِّدَاءِ مُقَطَّعَ اْلأَعْضَاءِ وَبَناتُكَ سَبَايَا وَإِلَى اللهِ الْمُشْتَكَى ، وَقُلْتِ : يا مُحَمَّدُ ، هذا حُسَيْنٌ تَسْفِي عَلَيْهِ رِيحُ الصَّبَا ، مَجْذُوذَ الرَّأْسِ مِنَ الْقَفَا ، قَتِيلَ أَوْلادِ الْبَغَايَا ، واحُزْنَاهْ عَلَيْكَ يَا أَبَا عَبْدِ اللهِ ، اَلسَّلامُ عَلَى مَنْ تَهَيَّجَ قَلْبُهَا لِلْحُسَيْنِ الْمَظْلُومِ الْعُرْيَانِ الْمَطْرُوحِ عَلَى الثَّرَى ، وَقالَتْ بِصَوْتٍ حَزِينٍ : بِأَبِي مَن نَّفْسِي لَهُ الْفِدَاءِ ، بِأَبِي الْمَهْمُومُ حَتَّى قَضَى ، بِأَبِي الْعَطْشَانُ حَتَّى مَضَى ، بِأَبِي مَنْ شَيْبَتُهُ تَقْطُرُ بِالدَِّماءِ ، اَلسَّلامُ عَلَى مَنْ بَكَتْ عَلَى جَسَدِ أَخِيهَا بَيْنَ الْقَتْلَى حَتَّى بَكَى لبُكَائِهَا كُلُّ عَدُوٍّ وَّصَدِيقٍ ، وَرَأَى النَّاسُ دُمُوعَ الْخَيْلِ تَنْحَدِرُ عَلَى حَوَافِرِهَا عَلَى التَّحْقِيقِ ، اَلسَّلامُ عَلَى مَنْ تَكَلَّفَتْ وَجَمَعَتْ فِي عَصْرِ عاشُورَاءَ بَنَاتِ رَسُولِ اللهِ وَأَطْفالَ الْحُسَيْنِ ، وَقَامَتْ لَهَا الْقِيَامَةُ فِي شَهَادَةِ الطِّفْلَيْنِ الْغَرِيبَيْنِ الْمَظْلُومَيْنِ ، اَلسَّلامُ عَلَى مَن لَّمْ تَنَمْ عَيْنُهَا لأَجْلِ حِرَاسَةِ آل اللهِ فِي طَفِّ نِيْنَوى ، وَسَارَتْ أَسِيرةً بِيَدِ الأَعْدَاءِ ، اَلسَّلامُ عَلَى مَنْ رَّكِبَتْ بَعِيراً بغَيْرِ وِطَاءٍ وَنَادَتْ أَخَاهَا أَبَا الْفَضْلِ بِهذَا النِّدَاءِ : أَخِي أَبَا الْفَضْلِ أَنْتَ الَّذِي رَكَّبْتَنِي إِذَ أَرَدتُّ الْخُرُوجَ مِنَ الْمَدِينَةِ ، اَلسَّلامُ عَلَى مَنْ خَطَبَتْ فِي مَيْدَانِ الْكُوفَةِ بُخُطْبَةٍ نَّافِعَةٍ حَتَّى سَكَنَتِ اْلأَصْوَاتُ مِنْ كُلِّ ناحِيَةٍ ، اَلسَّلامُ عَلَى مَنِ احْتَجَّتْ فِي مَجْلِسِ ابْنِ زِيَادٍ بِاحْتِجَاجَاتٍ وَاضِحَةٍ وَقَالَتْ فِي جَوابِهِ بِبَيِّنَاتٍ صَادِقَةٍ ، إِذْ قَالَ ابْنُ زِيَادٍ لِزَيْنَبَ سَلامُ اللهِ عَلَيْها : كَيْفَ رَأَيْتِ صُنْعَ اللهِ بِأَخِيكِ الْحُسَيْنِ ؟ فَقَالَتْ : مَا رَأَيْتُ إِلَّا جَمِيلاً ، اَلسَّلامُ عَلَيْكِ يَا أَسِيرةً بِأَيْدِي اْلأَعْدَاءِ فِي الْفَلَوَاتِ وَرَأَيْتِ أَهْلَ الشَّامِ فِي حَالَةِ الْعَيْشِ وَالسُّرُورِ وَنَشْرِ الرَّايَاتِ ، اَلسَّلامُ عَلَى مَنْ شُدَّ الْحَبْلُ عَلَى عَضُدِهَا وَعُنُقِ اْلإِمَامِ زَيْنِ الْعَابِدِينَ وَأَدْخَلُوهَا مَعَ سِتَّةِ عَشَرَ نَفَراً مِنْ آلِ رَسُولِ اللهِ وَهُمْ كَاْلأُسَرَاءِ مُقَرَّنِينَ بِالْحَدِيدِ مَظْلُومِينَ ، وَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ عَلَيْهِ السَّلامُ لِيَزِيدَ : يا يَزِيدُ مَا ظَنُّكَ بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ لَوْ رَآنَا عَلَى هذِهِ الْحَالَةِ ؟

ثُمَّ قالَتْ أُمُّ الْمَصَايِبِ زَيْنَبُ لَهُ : ... قائِلاً : فَأَهَلُّوا وَاسْتَهَلُّوا فَرَحاً ثُمَّ قالُوا : يا يَزِيدُ لا تَشَلْ مُنْحَنِياً عَلَى ثَنَايَا أَبِي عَبْدِ اللهِ سَيِّدِ شَبَابِ أَهْلِ الْجَنَّةَ تَنْكُثُهَا بِمِخْصَرَتِكَ ، ثُمَّ قَالَتْ : وَلَئِنْ جَرّتْ عَلَيَّ الدَّوَاهِي مُخَاطَبَتُكَ وَإِنِّي لأَسْتَصْغِرُ قَدْرَكَ وَأَسْتَعْظِمُ تَقْرِيعَكَ وَأَسْتَكْبِرُ تَوْبِيخَكَ ، لكِنَّ الْعُيُونَ عَبْرَى وَالصُّدُورَ حَرَّى ، أَلا فَالْعَجَبُ كُلُّ الْعَجَبِ مِنِ إِقْدَامِكَ لِقَتْلِ حِزْبِ اللهِ النُّجَبَاءِ بِحِزْبِ الشَّيْطَانِ الطُّلَقَاءِ ، وَلَئِنِ اتَّخَذْتَنَا مَغْنَماً لَتَجِدَنَّا وَشِيكاً مَغْرَماً حِينَ لا تَجِدُ إِلاَّ مَا قَدَّمَتْ يَدَاكَ وَمَا رَبُّكَ بِظَلاَّمٍ لِلْعَبيدِ وَإِلَى اللهِ الْمُشْتَكَى وَعَلَيْهِ الْمُعَوَّلُ فِي الشِّدَّةِ وَالرَّخَاءِ ، فَكِدْ كَيْدَكَ وَاسْعَ سَعْيَكَ وَنَاصِبْ جَهْدَكَ ، فَوَاللهِ لا تَمْحُو ذِكْرَنا وَلا تُمِيتُ وَحْيَنَا وَلا تُدْرِكُ أَمَدَنَا وَلَا تَرْحَضُ عَنْكَ عَارَهَا وَهَل رَّأْيُكَ إِلَّا فَنَدٌ ؟ وَّأَيَّامُكَ إِلَّا عَدَدٌ وَجَمْعُكَ إِلَّا بَدَدٌ ؟ يَا يَزِيدُ ، أَمَا سَمِعْتَ قَوْلَ اللهِ تَعَالَى : (( وَلا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللهِ أَمْوَاتاً بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ )) ، وَحَسْبُكَ بِاللهِ حَاكِماً وَبِمُحَمَّدٍ خَصْماً وَبِجَبْرِيلَ عَدُوّاً .

ثُمَّ قَالَتْ : اَلْحَمْدُ لِلَّهِ الَّذِي خَتَمَ لأَوَّلِنَا بِالسَّعَادَةِ وَالْمَغْفِرَةِ وَلآخِرِنَا بِالشَّهادَةِ وَالرَّحْمَةِ إِنَّهُ رَحِيمٌ وَّدُودٌ ، وَهُوَ حَسْبُنا وَنِعْمَ الْوَكِيلُ ، وَصَلَّى اللهُ عَلَى مُحَمَّدٍ وَّآلِهِ وَأَهْلِ بَيْتِهِ الطَّاهِرِينَ الأَئِمَّةِ الْمَعْصُومِينَ ، آمِينَ يا رَبَّ الْعَالَمِينَ .''',
    ),
    Ziyarat(
      title: 'زيارة أم البنين عليها السلام',
      benefits: 'زيارة السيدة أم البنين (ع)',
      text: '''بسم الله الرحمن الرحيم

أَشهَدُ أَن لَّا إِلَهَ إِلَّا اللهُ وَحْدَهُ لاشَرِيكَ لَهُ ، وَأَشْهَدُ أنَّ مُحَمَّدَاً عَبدُهُ وَرَسُولُهُ ، اَلسَّلامُ عَلَيْكَ يَا رَسُولَ الله ، اَلسَّلامُ عَلَيْكَ يَا أَمِيرَ الْمُؤْمِنِين ، اَلسَّلامُ عَلَيْكِ يَا فَاطِمَةَ الزَّهرَاءِ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ ، اَلسَّلامُ عَلَى الْحَسَنِ وَالْحُسَينِ سَيِّدَيْ شَبَابِ أَهْلِ الْجَنَّة ، اَلسَّلامُ عَلَيْكِ يَازَوجَةَ وَصِيِّ رَسُولِ اللهِ ، اَلسَّلامُ عَلَيكِ يَا عَزِيزَةَ الزَّهْرَاءِ عَلَيْهَا السَّلام ، اَلسَّلامُ عَلَيكِ يَا أُمَّ الْبُدُورِ السَّوَاطِع فَاطِمَةَ بِنت حِزَامٍ الْكُلَابِيَّةَ ، الْمُلَقَّبةَ بِـ (( أُمِّ الْبَنِينَ )) وَ (( بَابَ الْحَوَائِجِ )) ، أُشهِدُ اللهَ وَرَسُولهُ أَنَّكِ جَاهَدتِّ فِي سَبِيلِ اللهِ ، إِذ ضَّحّيتِ بِأَوْلَادَكِ دُونَ الْحُسَيْنِ بْنِ بِنْتِ رَسُولِ اللهِ ، وَعَبَدتِّ اللهَ مُخلِصَةً لَّهُ الدِّينَ بِوَلَائكِ لِلأَئِمَّةِ الْمَعْصُومِينَ عَلَيْهِمُ السَّلامُ ، وَصَبَرتِ عَلَى تِلْكَ الرَزِيَّةِ الْعَظِيمَةِ ، وَاحتَسَبْتِ ذَلِكَ عِنْدَ اللهِ رَبِّ الْعَالَمِين ، وَآزَرْتِ الإمَامَ عَليًّا فِي الْمِحَنِ وَالشَّدَائِدِ وَالْمَصَائِبِ ، وَكُنْتِ فِي قِمَّةِ الطَّاعَةِ وَالْوَفَاءِ ، وَأنَّكِ أَحسَنتِ الْكَفَالَة ، وَأَدَّيْتِ الأَمَانَةَ الْكُبْرَى فِي حِفْظِ وَدِيعَتَيِ الزَّهْرَاءِ الْبَتُولِ الْحَسَنِ وَالْحُسَينِ ، وَبَالَغْتِ وَآثَرْتِ وَرَعَيتِ حُجَجَ اللهِ الْمَيَامِينَ ، وَرَغَبْتِ في صِلَةِ أَبنَاءِ رَسُولِ رَبِّ الْعَالَمِينَ ، عَارِفَةً بِحَقِّهِمْ ، مُؤْمِنَةً بِصِدقِهِمْ ، مُشفِقَةً عَلَيهِمْ ، مُؤْثِرَةً هَوَاهُمْ وَحُبَّهُمْ عَلَى أَولَادِكِ السُّعَدَاءِ ، فَسَلامُ اللهِ عَلَيْكِ يَا سَيِّدَتِي يَا أُمَّ الْبَنِينَ مَا دَجَى الَّليلُ وَغَسَقَ ، وَأَضَاءَ النَّهَارُ وَأَشرَقَ ، وَسَقَاكِ اللهُ مِن رَّحِيقٍ مَّخْتُومٍ ، يَومَ لايَنفَعُ مَالٌ وَلابَنُونَ ، فَصِرْتِ قُدْوَةً لِّلْمُؤمِنَاتِ الصَّالِحَاتِ ، لأَنَّكِ كَرِيمَةُ الْخَلائِقِ ، عَالِمَةً مُّعَلَّمَةً ، نَقِيَّةً زَكِيَّةً ، فَرَضِيَ اللهُ عَنْكِ وَأَرْضَاكِ ، وَلَقَدْ أَعْطَاكِ اللهُ مِنَ الْكَرَامَاتِ الْبَاهِرَاتِ ، حَتَّى أَصبَحْتِ بِطَاعَتِكِ للهِ وَلِوَصِيِّ الأَوصِيَاءِ وَحُبِّك لِسَيِّدَةِ النِّسَاءِ الزَّهْرَاءِ ، وَفِدَائِكِ أَوْلادَكِ الأَربَعَةَ لِسَيِّدِ الشُّهَاءِ بَاباً لِّلْحَوَائِج ، فَاشْفَعِي لِي عِنْدَ اللهِ بِغُفْرَانِ ذُنُوبِي وَكَشْفِ ضُرِّي وَقَضَاءِ حَوَائِجِي ، فَإنَّ لَكِ عِندَ اللهِ شَأْناً وَّجَاهاً مَّحمُودَاً ، وَالسَّلامُ عَلَى أَوْلَادِكِ الشُّهَدَاءِ ، الْعَبَّاسِ قَمَرِ بَنِي هَاشِمٍ وبَابِ الْحَوَائِجِ ، وَعَبدِ اللهِ وَعُثْمَانَ وَجَعْفَرٍ ، الَّذِينَ استُشهِدُوا فِي نُصْرَةِ الْحُسَينِ بِكَرْبَلاءَ ، وَالسَّلامُ عَلَى ابنَتِكِ الدُّرَّةِ الزَّاهِرَةِ الطَّاهِرَةِ الرَّضِيَّةِ خَدِيجَةَ ، فَجَزَاكِ اللهُ وَجزَاهُمُ الله جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا ، اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَّآلِ مُحَمَّدٍ .''',
    ),
    Ziyarat(
      title: 'زيارة الإمام موسى بن جعفر عليه السلام',
      benefits: 'زيارة الإمام الكاظم (ع)',
      text: '''بسم الله الرحمن الرحيم

اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَّأَهْلِ بَيْتِهِ ، وَصَلِّ عَلَى مُوسَى بْنِ جَعْفَرٍ وَصِيِّ الأبْرَارِ ، وَإِمَامِ الأَخْيَارِ ، وَعَيْبَةِ الأنْوَارِ ، وَوَارِثِ السَّكِينَةِ وَالْوَقَارِ وَالْحِكَمِ وَالآثَارِ ، الَّذِي كَانَ يُحْيِي اللَّيْلَ بِالسَّهَرِ إِلَى السَّحَرِ بِمُوَاصَلَةِ الِاسْتِغْفَارِ ، حَلِيفِ السَّجْدَةِ الطَّوِيلَةِ وَالدُّمُوعِ الْغَزِيرَةِ ، وَالْمُنَاجَاةِ الْكَثِيرَةِ والضَّرَاعَاتِ الْمُتَّصِلَةِ ، وَمَقَرِّ النُّهَى وَالْعَدْلِ وَالْخَيْرِ ، وَالْفَضْلِ وَالنَّدَى وَالْبَذْلِ وَمَأْلَفِ الْبَلْوَى وَالصَّبْرِ ، وَالْمُضْطَهَدِ بِالظُّلْمِ وَالْمَقْبُورِ بِالْجَوْرِ ، وَالْمُعَذَّبِ فِي قَعْرِ السُّجُونِ وَظُلَمِ الْمَطَامِيرِ ذِي السَّاقِ الْمَرْضُوضِ بِحَلَقِ الْقُيُودِ وَالْجَناَزَةِ الْمُنَادَى عَلَيْهَا بِذُلِّ الِاسْتِخْفَافِ ، وَالوارِدِ عَلَى جَدِّهِ الْمُصْطَفَى وَأَبِيهِ الْمُرْتَضَى وَأُمِّهِ فَاطَمَةَ سَيِّدَةِ النِّسَاءِ بِإِرْثٍ مَّغْصُوبٍ وَوَلاءٍ مَّسْلُوبٍ وَأَمْرٍ مَّغْلُوبٍ وَدَمٍ مَّطْلُوبٍ وَسَمٍّ مَّشْرُوبٍ .

اَللَّهُمَّ وَكَمَا صَبَرَ عَلَى غَلِيظِ الْمِحَنِ وَتَجَرَّعَ غُصَصَ الْكُرَبِ وَاسْتَسْلَمَ لِرِضاكَ وَأَخْلَصَ الطَّاعَةَ لَكَ وَمَحَضَ الْخُشُوعَ وَاسْتَشْعَرَ الْخُضُوعَ وَعَادَى الْبِدْعَةَ وَأَهْلَهَا وَلَمْ يَلْحَقْهُ فِي شيْءٍ مِّنْ أَوَامِرِكَ وَنَوَاهِيكَ لَوْمَةُ لَائِمٍ ؛ صَلِّ عَلَيْهِ صَلاةً نّامِيَةً مُنِيفَةً زَاكِيَةً تُوجِبُ لَهُ بِهَا شَفَاعَةَ أُمَمٍ مِّنْ خَلْقِكَ وَقُرُونٍ مِنْ بَرَايَاكَ وَبَلِّغْهُ عَنَّا تَحِيَّةً وَّسَلاماً ، وَآتِنَا مِن لَّدُنْكَ فِي مُوَالاتِهِ فَضْلاً وَّإحْسَاناً وَمَغْفِرَةً وَّرِضْوَاناً إِنَّكَ ذُو الْفَضْلِ الْعَمِيمِ وَالتَّجَاوُزِ الْعَظِيمِ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ .''',
    ),
    Ziyarat(
      title: 'زيارة الإمام محمد الجواد عليه السلام',
      benefits: 'زيارة الإمام الجواد (ع)',
      text: '''بسم الله الرحمن الرحيم 

اَلسَّلامُ عَلَيْكَ يَا وَلِيَّ اللهِ ، اَلسَّلامُ عَلَيْكَ يَا حُجَّةَ اللهِ ، اَلسَّلامُ عَلَيْكَ يَا نُورَ اللهِ فِي ظُلُمَاتِ الأَرْضِ ، اَلسَّلامُ عَلَيْكَ يَابْنَ رَسُولِ اللهِ ، اَلسَّلامُ عَلَيْكَ وَعَلَى آبَائِكَ ، اَلسَّلامُ عَلَيْكَ وَعَلَى أَبْنَائِكَ ، اَلسَّلامُ عَلَيْكَ وَعَلَى أوْلِيَائِكَ ، أشْهَدُ أَنَّكَ قَدْ أَقَمْتَ الصَّلاةَ وَآتَيْتَ الزَّكَاةَ ، وَأَمَرْتَ بِالْمَعْرُوفِ وَنَهَيْتَ عَنِ الْمُنْكَرِ ، وَتَلَوْتَ الْكِتَابَ حَقَّ تِلاوَتِهِ ، وَجاهَدتَّ فِي اللهِ حَقَّ جِهَادِهِ ، وَصَبَرْتَ عَلَى الأَذَى فِي جَنْبِهِ حَتَّى أَتَاكَ الْيَقِينُ ، أَتَيْتُكَ زَائِراً عَارِفاً بِحَقِّكَ مُوالِياً لِّأَوْلِيَائِكَ مُعَادِياً لِأَعْدَائِكَ فَاشْفَعْ لِي عِنْدَ رَبِّكَ''',
    ),
    Ziyarat(
      title: 'زيارة الإمام علي الهادي عليه السلام',
      benefits: 'زيارة الإمام الهادي (ع)',
      text: '''بسم الله الرحمن الرحيم

اَلسَّلَامُ عَلَيْكَ يَا أَبَا الْحَسَنِ عَلِيَّ بْنَ مُحَمَّدٍ الزَّكِيَّ الرَّاشِدَ النُّورَ الثَّاقِبَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ ، اَلسَّلَامُ عَلَيْكَ يَا صَفِيَّ اللهِ ، اَلسَّلَامُ عَلَيْكَ يَا سِرَّ اللهِ ، اَلسَّلَامُ عَلَيْكَ يَا حَبْلَ اللهِ ، اَلسَّلَامُ عَلَيْكَ يَا آلَ اللهِ ، اَلسَّلَامُ عَلَيْكَ يَا خِيَرةِ اللهِ ، اَلسَّلَامُ عَلَيْكَ يَا صَفْوَةَ اللهِ ، اَلسَّلَامُ عَلَيْكَ يَا أَمِينَ اللهِ ، السَّلَامُ عَلَيْكَ يَا حَقَّ اللهِ ، اَلسَّلَامُ عَلَيْكَ يَا حَبِيبَ اللهِ ، اَلسَّلَامُ عَلَيْكَ يَا نُورَ الأَنْوَارِ ، اَلسَّلَامُ عَلَيْكَ يَا زَيْنَ الأَبْرَارِ ، اَلسَّلَامُ عَلَيْكَ يَا سَلِيلَ الأَخْيَارِ ، اَلسَّلَامُ عَلَيْكَ يَا عُنْصُرَ الأَطْهَارِ ، اَلسَّلَامُ عَلَيْكَ يَا حُجَّةَ الرَّحْمٰنِ ، اَلسَّلَامُ عَلَيْكَ يَا رُكْنَ الإِيمَانِ ، اَلسَّلَامُ عَلَيْكَ يَا مَوْلَىٰ الْمُؤْمِنِينَ ، اَلسَّلَامُ عَلَيْكَ يَا وَلِيَّ الصَّالِحِينَ ، اَلسَّلَامُ عَلَيْكَ يَا عَلَمَ الْهُدَىٰ ، اَلسَّلَامُ عَلَيْكَ يَا حَلِيفَ التُّقَىٰ ، اَلسَّلَامُ عَلَيْكَ يَا عَمُودَ الدِّينِ ، اَلسَّلَامُ عَلَيْكَ يَا بْنَ خَاتَمِ النَّبِيِّينَ ، اَلسَّلَامُ عَلَيْكَ يَا بْنَ سَيِّدِ الْوَصِيِّينَ ، اَلسَّلَامُ عَلَيْكَ يَا بْنَ فَاطِمَةَ الزَّهْرَاءِ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا الأَمِينُ الْوَفِيُّ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا الْعَلَمُ الرَّضِيُّ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا الزَّاهِدُ التَّقِيُّ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا الْحُجَّةُ عَلَىٰ الْخَلْقِ أَجْمَعِينَ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا التَّالِي لِلْقُرْآنِ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا الْمُبَيِّنُ لِلْحَلاَلِ مِنَ الْحَرَامِ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا الْوَلِيُّ النَّاصِحُ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا الطَّرِيقُ الْوَاضِحُ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّجْمُ اللَّائِحُ .

أَشْهَدُ ـ يَا مَوْلاَيَ يَا أَبَا الْحَسَنِ ـ أَنَّكَ حُجَّةُ اللهِ عَلَىٰ خَلْقِهِ ، وَخَلِيفَتُهُ فِي بَرِيَّتِهِ ، وَأَمِينُهُ فِي بِلاَدِهِ ، وَشَاهِدُهُ عَلَىٰ عِبَادِهِ ، وَأَشْهَدُ أَنَّكَ كَلِمَةُ التَّقْوَىٰ ، وَبَابُ الْهُدَىٰ ، وَالْعُرْوَةُ الْوُثْقَىٰ ، وَالْحُجَّةُ عَلَىٰ مَنْ فَوْقَ الأَرْضِ وَمَنْ تَحْتَ الثَّرَىٰ ، وَأَشْهَدُ أَنَّكَ الْمُطَهَّرُ مِنَ الذُّنُوبِ ، الْمُبَرَّأُ مِنَ الْعُيُوبِ ، وَالْمُخْتَصُّ بِكَرَامَةِ اللهِ ، وَالْمَحْبُوُّ بِحُجَّةِ اللهِ ، وَالْمَوْهُوبُ لَهُ كَلِمَةُ اللهِ ، وَالرُّكْنُ الَّذِي يَلْجَأُ إِلَيْهِ الْعِبَادُ ، وَتُحْيَىٰ بِهِ الْبِلاَدُ ، وَأَشْهَدُ يَا مَوْلاَيَ أَنِّي بِكَ وَبِآبَائِكَ وَأَبْنَائِكَ مُوقِنٌ مُّقِرٌّ ، وَلَكُمْ تَابِعٌ فِي ذَاتِ نَفْسِي وَشَرَائِعِ دِينِي وَخَاتِمَةِ عَمَلِي وَمُنْقَلَبِي وَمَثْوَايَ ، وَأَنِّي وَلِيٌّ لِّمَن وَّالاَكُمْ وَعَدُوٌّ لِّمَنْ عَادَاكُم ، مُّؤْمِنٌ بِسِرِّكُمْ وَعَلاَنِيَتِكُمْ ، وَأَوَّلِكُمْ وَآخِرِكُمْ ، بِأَبِي أَنْتَ وَأُمِّي وَالسَّلَامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ .''',
    ),
    Ziyarat(
      title: 'زيارة الإمام الحسن العسكري عليه السلام',
      benefits: 'زيارة الإمام العسكري (ع)',
      text: '''بسم الله الرحمن الرحيم

اَلسَّلامُ عَلَيْكَ يَا مَوْلايَ يَا أَبَا مُحَمَّدٍ الْحَسَنَ بْنَ عَلِيٍّ الْهَادِيَ الْمُهْتَدِيَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ ، اَلسَّلامُ عَلَيْكَ يَا وَلِيَّ اللهِ وَابْنَ أَوْلِيَائِهِ ، اَلسَّلامُ عَلَيْكَ يَا حُجَّةَ اللهِ وَابْنَ حُجَجِهِ ، اَلسَّلامُ عَلَيْكَ يَا صَفِيَّ اللهِ وَابْنَ أَصْفِيَائِهِ ، اَلسَّلامُ عَلَيْكَ يَا خَلِيفَةَ اللهِ وَابْنَ خُلَفَائِهِ وَأَبَا خَلِيفَتِهِ ، اَلسَّلامُ عَلَيْكَ يَا بْنَ خَاتَمِ النَّبِيِّينَ ، اَلسَّلامُ عَلَيْكَ يَا بْنَ سَيِّدِ الْوَصِيِّينَ ، اَلسَّلامُ عَلَيْكَ يَا بْنَ أَمِيرِ الْمُؤْمِنِينَ ، اَلسَّلامُ عَلَيْكَ يَا بْنَ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ ، اَلسَّلامُ عَلَيْكَ يَا ابْنَ الأَئِمَّةِ الْهَادِينَ ، اَلسَّلامُ عَلَيْكَ يَا بْنَ الأَوْصِيَاءِ الرَّاشِدِينَ ، اَلسَّلامُ عَلَيْكَ يَا عِصْمَةَ الْمُتَّقِينَ ، اَلسَّلامُ عَلَيْكَ يَا إِمَامَ الْفَائِزِينَ ، اَلسَّلامُ عَلَيْكَ يَا رُكْنَ الْمُؤْمِنِينَ ، اَلسَّلامُ عَلَيْكَ يا فَرَجَ الْمَلْهُوفِينَ ، اَلسَّلامُ عَلَيْكَ يَا وَارِثَ الْأَنْبِيَاءِ الْمُنْتَجَبِينَ ، اَلسَّلامُ عَلَيْكَ يَا خَازِنَ عِلْمِ وَصِيِّ رَسُولِ اللهِ ، اَلسَّلامُ عَلَيْكَ أَيُّهَا الدَّاعِي بِحُكْمِ اللهِ ، اَلسَّلامُ عَلَيْكَ أَيُّهَا النَّاطِقُ بِكِتَابِ اللهِ ، اَلسَّلامُ عَلَيْكَ يا حُجَّةَ الْحُجَجِ ، اَلسَّلامُ عَلَيْكَ يَا هادِيَ الأُمَمِ ، اَلسَّلامُ عَلَيْكَ يَا وَلِيَّ النِّعَمِ ، اَلسَّلامُ عَلَيْكَ يَا عَيْبَةَ الْعِلْمِ ، اَلسَّلامُ عَلَيْكَ يَا سَفِينَةَ الْحِلْمِ ، اَلسَّلامُ عَلَيْكَ يَا أَبَا الإِمَامِ الْمُنْتَظَرِ ، الظَّاهِرَةِ لِلْعَاقِلِ حُجَّتُهُ ، وَالثَّابِتَةِ فِي الْيَقِينِ مَعْرِفَتُهُ ، الْمُحْتَجَبِ عَنْ أَعْيُنِ الظَّالِمِينَ ، وَالْمُغَيَّبِ عَنْ دَوْلَةِ الْفَاسِقِينَ ، وَالْمُعِيدِ رَبُّنَا بِهِ الإِسْلامَ جَدِيداً بَعْدَ الِانْطِمَاسِ ، وَالْقُرْآنَ غَضًّا بَعْدَ الِانْدِرَاسِ .  

أَشْهَدُ يَا مَوْلايَ أَنَّكَ أَقَمْتَ الصَّلاةَ وَآتَيْتَ الزَّكَاةَ ، وَأَمَرْتَ بِالْمَعْرُوفِ وَنَهَيْتَ عَنِ الْمُنْكَرِ ، وَدَعَوْتَ إِلَى سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ ، وَعَبَدتَّ اللهَ مُخْلِصاً حَتَّى أَتََاكَ الْيَقِينُ ، أَسْأَلُ اللهَ بِالشَّأنِ الَّذِي لَكُمْ عِنْدَهُ أَن يَّتَقَبَّلَ زِيَارَتِي لَكُمْ ، وَيَشْكُرَ سَعْيِي إِلَيْكُمْ ، وَيَسْتَجِيبَ دُعَائِي بِكُمْ ، وَيَجْعَلَنِي مِنْ أَنْصَارِ الْحَقِّ وَأَتْبَاعِهِ وَأَشْيَاعِهِ وَمَوَالِيهِ وَمُحِبِّيهِ ، وَالسَّلامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ''',
    ),
    Ziyarat(
      title: 'زيارة الإمام الرضا عليه السلام',
      benefits: 'زيارة الإمام الرضا (ع)',
      text: '''بسم الله الرحمن الرحيم

اَلسَّلَامُ عَلَيْكَ يَا وَلِيَّ اللَّهِ ، اَلسَّلَامُ عَلَيْكَ يَا حُجَّةَ اللَّهِ ، اَلسَّلَامُ عَلَيْكَ يَا نُورَ اللَّهِ فِي ظُلُمَاتِ الْأَرْضِ ، اَلسَّلَامُ عَلَيْكَ يَا عَمُودَ الدِّينِ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ آدَمَ صَفْوَةِ اللَّهِ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ نُوحٍ نَّبِيِّ اللَّهِ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ إِبْرَاهِيمَ خَلِيلِ اللَّهِ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ إِسْمَاعِيلَ ذَبِيحِ اللَّهِ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ مُوسَى كَلِيمِ اللَّهِ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ عِيسَى رُوحِ اللَّهِ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ مُحَمَّدٍ رَّسُولِ اللَّهِ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ أَمِيرِ الْمُؤْمِنِينَ عَلِيٍّ وَّلِيِّ اللَّهِ ، وَوَصِيِّ رَسُولِ رَبِّ الْعَالَمِينَ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ فَاطِمَةَ الزَّهْرَاءِ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ الْحَسَنِ وَالْحُسَيْنِ سَيِّدَيْ شَبَابِ أَهْلِ الْجَنَّةِ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ عَلِيِّ بْنِ الْحُسَيْنِ زَيْنِ الْعَابِدِينَ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ مُحَمَّدِ بْنِ عَلِيٍّ بَاقِرِ عِلْمِ الْأَوَّلِينَ وَالْآخِرِينَ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ جَعْفَرِ بْنِ مُحَمَّدٍ الصَّادِقِ الْبَارِّ ، اَلسَّلَامُ عَلَيْكَ يَا وَارِثَ مُوسَى بْنِ جَعْفَرٍ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا الصِّدِّيقُ الشَّهِيدُ ، السَّلَامُ عَلَيْكَ أَيُّهَا الْوَصِيُّ الْبَارُّ التَّقِيُّ ، أَشْهَدُ أَنَّكَ قَدْ أَقَمْتَ الصَّلَاةَ ، وَآتَيْتَ الزَّكَاةَ ، وَأَمَرْتَ بِالْمَعْرُوفِ ، وَنَهَيْتَ عَنِ الْمُنْكَرِ ، وَعَبَدتَّ اللَّهَ مُخْلِصاً حَتَّى أَتَاكَ الْيَقِينُ ، اَلسَّلَامُ عَلَيْكَ يَا أَبَا الْحَسَنِ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ .  

ثمَّ تَنْكَبُّ عَلَى الْقَبْرِ وَتَقُولُ :
اَللَّهُمَّ إِلَيْكَ صَمَدتُّ مِنْ أَرْضِي وَقَطَعْتُ الْبِلَادَ رَجَاءَ رَحْمَتِكَ ، فَلَا تُخَيِّبْنِي وَلَا تَرُدَّنِي بِغَيْرِ قَضَاءِ حَاجَتِي ، وَارْحَمْ تَقَلُّبِي عَلَى قَبْرِ ابْنِ أَخِي رَسُولِكَ صَلَوَاتُكَ عَلَيْهِ وَآلِهِ ، بِأَبِي أَنْتَ وَأُمِّي أَتَيْتُكَ زَائِراً وَّافِداً عَائِذاً مِمَّا جَنَيْتُ عَلَى نَفْسِي وَاحْتَطَبْتُ عَلَى ظَهْرِي ، فَكُن لِّي شَافِعاً إِلَى اللَّهِ يَوْمَ فَقْرِي وَفَاقَتِي فَلَكَ عِنْدَ اللَّهِ مَقَامٌ مَّحْمُودٌ وَأَنْتَ عِنْدَهُ وَجِيهٌ .  

ثمَّ تَرْفَعُ يَدَكَ الْيُمْنَى وَتَبْسُطُ الْيُسْرَى عَلَى الْقَبْرِ وَتَقُولُ :
اَللَّهُمَّ إِنِّي أَتَقَرَّبُ إِلَيْكَ بِحُبِّهِمْ ، وَبِوَلَايَتِهِمْ ، أَتَوَلَّى آخِرَهُمْ بِمَا تَوَلَّيْتُ بِهِ أَوَّلَهُمْ ، وَأَبْرَأُ مِنْ كُلِّ وَلِيجَةٍ دُونَهُمْ ، اَللَّهُمَّ الْعَنِ الَّذِينَ بَدَّلُوا نِعْمَتَكَ ، وَاتَّهَمُوا نَبِيَّكَ ، وَجَحَدُوا بِآيَاتِكَ ، وَسَخِرُوا بِإِمَامِكَ ، وَحَمَلُوا النَّاسَ عَلَى أَكْتَافِ آلِ مُحَمَّدٍ ، اَللَّهُمَّ إِنِّي أَتَقَرَّبُ إِلَيْكَ بِاللَّعْنَةِ عَلَيْهِمْ وَالْبَرَاءَةِ مِنْهُمْ فِي الدُّنْيَا وَالْآخِرَةِ يَا رَحْمَنُ .  

ثمَّ تَحَوَّلْ إِلَى عِنْدَ رِجْلَيْهِ عليه السلام وَقُلْ :
صَلَّى اللَّهُ عَلَيْكَ يَا أَبَا الْحَسَنِ ، صَلَّى اللَّهُ عَلَى رُوْحِكَ وَبَدَنِكَ ، صَبَرْتَ وَأَنْتَ الصَّادِقُ الْمُصَدَّقُ ، قَتَلَ اللَّهُ مَنْ قَتَلَكَ بِالْأَيْدِي وَالْأَلْسُنِ .''',
    ),
    Ziyarat(
      title: 'زيارة أئمة البقيع (عليهم السلام)',
      benefits: 'زيارة أئمة البقيع (ع)',
      text: '''بسم الله الرحمن الرحيم 

اَلسَّلامُ عَلَيْكُمْ أَئِمَّةَ الْهُدَى اَلسَّلامُ عَلَيْكُمْ أَهْلَ التَّقْوَى اَلسَّلامُ عَلَيْكُمْ أَيُّهَا الْحُجَجُ عَلَى أَهْلِ الدُّنْيَا اَلسَّلامُ عَلَيْكُمْ أَيُّهَا الْقُوَّامُ فِي الْبَرِيَّةِ بِالْقِسْطِ اَلسَّلامُ عَلَيْكُمْ أَهْلَ الصَّفْوَةِ اَلسَّلامُ عَلَيْكُمْ آلَ رَسُولِ اللهِ اَلسَّلامُ عَلَيْكُمْ أَهْلَ النَّجْوَى أَشْهَدُ أَنَّكُمْ قَدْ بَلَّغْتُمْ وَنَصَحْتُمْ وَصَبَرْتُمْ فِي ذَاتِ اللهِ وَكُذِّبْتُمْ وَأُسِيءَ إِلَيْكُمْ فَغَفَرْتُمْ وَأَشْهَدُ أَنَّكُمُ الأَئِمَّةُ الرَّاشِدُونَ الْمُهْتَدُونَ وَأَنَّ طَاعَتَكُمْ مَفْرُوضَةٌ وَأَنَّ قَوْلَكُمُ الصِّدْقُ وَأَنَّكُمْ دَعَوَتُمْ فَلَمْ تُجَابُوا وَأَمَرْتُمْ فَلَمْ تُطَاعُوا وَأَنَّكُمْ دَعَائِمُ الدِّينِ وَأَرْكَانُ الأَرْضِ لَمْ تَزَالُوا بِعَيْنِ اللهِ يَنْسَخُكُمْ مِنْ أَصْلاَبِ كُلِّ مُطَهَّرٍ وَيَنْقُلُكُمْ مِنْ أَرْحَامِ الْمُطَهَّرَاتِ لَمْ تُدَنِّسْكُمُ الْجَاهِلِيَّةُ الْجَهْلَاءُ وَلَمْ تَشْرَكْ فِيكُمْ فِتَنُ الأَهْوَاءِ طِبْتُمْ وَطَابَ مَنْبَتُكُمْ مَنَّ بِكُمْ عَلَيْنَا دَيَّانُ الدِّينِ فَجَعَلَكُمْ فِي بُيُوتٍ أَذِنَ اللهُ أَنْ تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ وَجَعَلَ صَلاَتَنَا عَلَيْكُمْ رَحْمَةً لَنَا وَكَفَّارَةً لِذُنُوبِنَا إِذِ اخْتَارَكُمُ اللهُ لَنَا وَطَيَّبَ خَلْقَنَا بِمَا مَنَّ عَلَيْنَا مِنْ وِلاَيَتِكُمْ وَكُنَّا عِنْدَهُ مُسَلِمِّينَ بِعِلْمِكُمْ مُعْتَرِفِينَ بِتَصْدِيقِنَا إِيَّاكُمْ وَهَذَا مَقَامُ مَنْ أَسْرَفَ وَأَخْطَأَ وَاسْتَكَانَ وَأَقَرَّ بِمَا جَنَى وَرَجَا بِمَقَامِهِ الْخَلاَصَ وَأَن يَسْتَنْقِذَهُ بِكُمْ مُسْتَنْقِذُ الْهَلَكَى مِنَ الرَّدَى فَكُونُوا لِي شُفَعَاءَ فَقَدْ وَفَدتُّ إِلَيْكُمْ إِذْ رَغِبَ عَنْكُمْ أَهْلُ الدُّنْيَا وَاتَّخَذُوا آيَاتِ اللهِ هُزُوا وَاسْتَكْبَرُوا عَنْهَا

يَا مَنْ هُوَ قَائِمٌ لا يَسْهُو وَدَائِمٌ لا يَلْهُو وَمُحِيطٌ بِكُلِّ شَيْءٍ لَكَ الْمَنُّ بِمَا وَفَّقْتَنِي وَعَرَّفْتَنِي بِمَا أَقَمْتَنِي عَلَيْهِ إِذْ صَدَّ عَنْهُ عِبَادُكَ وَجَهِلُوا مَعْرِفَتَهُ وَاسْتَخَفُّوا بِحَقِّهِ وَمَالُوا إِلَى سِوَاهُ فَكَانَتِ الْمِنَّةُ مِنْكَ عَلَيَّ مَعَ أَقْوَامٍ خَصَصْتَهُمْ بِمَا خَصَصْتَنِي بِهِ فَلَكَ الْحَمْدُ إِذْ كُنْتُ عِنْدَكَ فِي مَقَامِي هَذَا مَذْكُورَا مَكْتُوبَا فَلا تَحْرِمْنِي مَا رَجَوْتُ وَلا تُخَيِّبْنِي فِيمَا دَعَوْتُ بِحُرْمَةِ مُحَمَّدٍ وَآلِهِ الطَّاهِرِينَ وَصَلَّى اللهُ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ''',
    ),
  ];
  static final List<Ziyarat> dailyZiyarats = [
    Ziyarat(
      title: 'زيارة يوم السبت',
      benefits: 'زيارة النبي محمد (ص)',
      text: '''بسم الله الرحمن الرحيم 

أَشهَدُ أَن لَّا إِلَهَ إِلَّا اللهُ وَحْدَهُ لاشَرِيكَ لَهُ وَأَشْهَدُ أَنَّكَ رَسُولُهُ وَأَنَّكَ مُحَمَّدُ بْنُ عَبْدِ اللهِ وَأَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ رِسَالاتِ رَبِّكَ وَنَصَحْتَ لاُمَّتِكَ وَجاهَدتَّ فِي سَبِيلِ اللهِ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ وَأَدَّيْتَ الَّذِي عَلَيْكَ مِنَ الْحَقِّ وَأَنَّكَ قَدْ رَؤُفْتَ بِالْمُؤْمِنِينَ وَغَلُظْتَ عَلَى الْكَافِرِينَ وَعَبَدتَّ اللهَ مُخْلِصاً حَتَّى أَتَاكَ الْيَقِينُ فَبَلَغ اللهُ بِكَ أَشرَفَ مَحَلِّ الْمُكَرَّمِينَ اَلحَمْدُ للهِ الَّذِي اسْتَنْقَذَنَا بِكَ مِنَ الشِّرْكِ وَالضَّلالِ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ وَاجْعَلْ صَلَوَاتِكَ وَصَلَوَاتِ مَلائِكَتِكَ وَأَنْبِيَائِكَ وَالمُرْسَلِينَ وَعِبَادِكَ الصَّالِحِينَ وَأَهْلِ السَّمَاواتِ وَالاَرَضِينَ وَمَنْ سَبَّحَ لَكَ يَا رَبِّ الْعَالَمِينَ مِنَ الأَوَّلِينَ وَالآخِرِينَ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ وَنَبِيِّكَ وَأَمِينِكَ وَنَجِيبِكَ وَحَبِيبِكَ وَصَفِيِّكَ وَصَفْوَتِكَ وَخَاصَّتِكَ وَخَالِصَتِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ وأَعْطِهِ الْفَضْلَ وَالْفَضِيلَةَ وَالْوَسِيلَةَ وَالدَّرَجَةَ الرَّفِيعَةَ وَابْعَثْهُ مَقَاماً مَحْمُوداً يَغْبِطُهُ بِهِ الأَوَّلُونَ وَالآخِرُونَ اَللَّهمَّ إِنَّكَ قُلتَ وَلَوْ أَنَّهُمْ إِذ ظَّلَمُوا أَنفُسَهُمْ جَاءُوكَ فَاسْتَغْفَرُوا اللَّـهَ وَاسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللَّـهَ تَوَّابًا رَّحِيمًا إِلَهِي فَقَدْ أَتَيْتُ نَبِيَّكَ مُسْتَغْفِراً تَائِباً مِنْ ذُنُوبِي فَصَلِّ عَلَى مُحَمَّدٍ وَّآلِهِ وَاغْفِرْهَا لِي يا سَيِّدَنَا أَتَوَجَّهُ بِكَ وَبأَهْلِ بَيْتِكَ إِلَى اللهِ تَعالى رَبِّكَ وَرَبِّي لِيَغْفِرَ لِي

ثُمَّ قُلْ ثلاثاً إِنَّا للهِ وَإِنَّا إِلَيْهِ راجِعُونَ

ثُمَّ قُلْ اُصِبْنَا بِكَ يَا حَبِيبَ قُلُوبِنَا فَما أعْظَمَ الْمُصِيبَةَ بِكَ حَيْثُ انْقَطَعَ عَنَّا الْوَحْيُ وَحَيْثُ فَقَدْنَاكَ فإِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ يَا سَيِّدَنَا يَا رَسُولَ اللهِ صَلَوَاتُ الله عَلَيْكَ وَعَلَى آلِ بَيْتِكَ الطَّاهِرِينَ هَذَا يَومُ السَّبْتِ وَهُوَ يَوْمُكَ وَأَنَا فِيهِ ضَيْفُكَ وَجَارُكَ فَأَضِفْنِي وَأَجِرْنِي فَإِنَّكَ كَرِيمٌ تُحِبُّ الضِّيافَةَ وَمَأْمُورٌ بِالإِجَارَةِ فَأَضِفْنِي وَأَحْسِنْ ضِيَافَتِي وَأَجِرْنَا وَأَحْسِنْ إِجَارَتَنَا بِمَنْزِلَةِ اللهِ عِنْدَك وَعِنْدَ آلِ بَيْتِكَ وَبِمَنْزِلَتِهِمْ عِنْدَهُ وَبِمَا اسْتَوْدَعَكُمْ مِنْ عِلْمِهِ فَإِنَّه أَكْرَمُ الأَكْرَمِينَ

يقولُ مؤلّف الكتاب عبّاس القُمِّي عُفي عنهُ إِنِّي كلّما زرته صلّى الله عليه وآله بهذه الزّيارة بَدَأتُ بزيارته على نحو ما علّمه الإمامُ الرِّضا عليه السلام البزنطيَّ ثُمَّ قرأتُ هذهِ الزّيارة فَقَد رُوي بسند صحيح أنَّ ابن أبي بصير سأل الرِّضا عليه السلام كَيفَ يصَلِّي على النَّبيّ صلّى الله عليه وآله ويسلِّم عَلَيهِ بعد الصلاة فأجابَ عليه السلام تقول اَلسَّلامُ عَلَيْكَ يَا رَسُولَ اللهِ وَرَحْمَةُ الله وَبَرَكاتُهُ اَلسَّلامُ عَلَيْكَ يا مُحَمَّدُ بْنَ عَبْدِ اللهِ اَلسَّلامُ عَلَيْكَ يَا خِيَرَةَ اللهِ اَلسَّلامُ عَلَيْكَ يَا حَبِيبَ اللهِ اَلسَّلامُ عَلَيْكَ يَا صَفْوَةَ اللهِ اَلسَّلامُ عَلَيْكَ يَا أَمِينَ اللهِ أَشْهَدُ أَنَّكَ رَسُوُلُ اللهِ وَأَشْهَدُ أَنَّكَ مُحَمَّدُ بْنُ عَبْدِ اللهِ وَأَشْهَدُ أَنَّكَ قَدْ نَصَحْتَ لاُُمَّتِكَ وَجَاهَدتَّ فِي سَبِيلِ رَبِّكَ وَعَبَدتَّهُ حَتَّى أَتَاكَ الْيَقِينُ فَجَزاكَ اللهُ يَا رَسُولَ اللهِ أَفْضَلَ ماجَزَى نَبِيًّا عَنْ أُمَّتِهِ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ أَفْضَلَ مَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَّجِيدٌ''',
    ),
    Ziyarat(
      title: 'زيارة يوم الأحد',
      benefits: 'زيارة أمير المؤمنين والزهراء (ع)',
      text: '''بسم الله الرحمن الرحيم 

اَلسَّلامُ عَلَى الشَّجَرَةِ النَّبَوِيَّةِ وَالدَّوْحَةِ الْهَاشِمِيَّةِ الْمُضِيئَةِ الْمُثْمِرَةِ بِالنُّبُوَّةِ المُونِقَةِ بِالإِمَامَةِ وَعَلَى ضَجِيعَيْكَ آدَمَ وَنُوحٍ عَلَيْهِمَا السَّلامُ اَلسَّلامُ عَلَيْكَ وَعَلَى أَهْلِ بَيْتِكَ الطَّيِّبِينَ الطَّاهِرِينَ السَّلامُ عَلَيْكَ وَعَلَى الْمَلائِكَةِ الْمُحْدِقِينَ بِكَ وَالْحَافِّينَ بِقَبْرِكَ يَا مَوْلايَ يَا أَمِيرَ الْمُؤْمِنِينَ هَذَا يَومُ الأَحَدِ وَهُوَ يَوْمُكَ وَبِاسْمِكَ وَأَنَا ضَيْفُكَ فِيهِ وَجَارُكَ فَأَضِفْنِي يَا مَوْلايَ وَأَجِرْنِي فإِنَّكَ كَرِيمٌ تُحِبُّ الضِّيافَةَ وَمَأْمُورٌ بِالإِجارَةِ فَافْعَلْ مَارَغِبْتُ إِلَيْكَ فِيهِ وَرَجَوْتُهُ مِنْكَ بِمَنْزِلَتِكَ وَآلِ بَيْتِكَ عِنْدَ اللهِ وَمَنْزِلَتِهِ عِنْدَكُمْ وَبِحَقِّ ابْنِ عَمِّكَ رَسُولِ اللهِ صَلَّى الله ُعَلَيْهِ وَآلِهِ وَسَلَّمَ وعَلَيْهِمْ أَجْمَعِينَ

زِيارة الزَّهراءِ سَلامُ الله عَليها يومَ الأحد اَلسَّلامُ عَلَيْكِ يَا مُمْتَحَنَةُ اِمْتَحَنَكِ الَّذِي خَلَقَكِ فَوَجَدَكِ لِمَا امْتَحَنَكِ صَابِرَةً أَنَا لَكِ مُصَدِّقٌ صَابِرٌ عَلَى مَا أَتَى بِهِ أَبُوكِ وَوَصِيُّهُ صَلَوَاتُ اللهِ عَلَيْهِمَا وَأَنَا أَسْألُكِ إِنْ كُنْتُ صَدَّقْتُكِ إِلَّا أَلْحَقْتِنِي بِتَصْدِيقِي لَهُمَا لِتُسِرَّ نَفْسِي فَاشْهَدِي أَنِّي طَاهِرٌ بِوَلايَتِكِ وَوَلايَةِ آلِ بَيْتِكِ صَلَوَاتُ اللهِ عَلَيْهِمْ أَجْمَعِينَ

أيضاً زِيارتُها عليها السلام بِرواية اُخرى اَلسَّلامُ عَلَيْكِ يَا مُمْتَحَنَةُ اِمْتَحَنَكِ الَّذِي خَلَقَكِ قَبْلَ أَن يَّخْلُقَكِ وَكُنْتِ لِمَا امْتَحَنَكِ بِهِ صَابِرَةً وَنَحْنُ لَكِ أَوْلِيَاءُ مُصَدِّقُونَ وَلِكُّلِ مَا أَتَى بِهِ أَبُوكِ صَلَّى اللهُ عَلَيهِ وَآلِهِ وَأَتَى بِهِ وَصِيُّهُ عَلَيْهِ السَّلَامُ مُسَلِّمُونَ وَنَحْنُ نَسْأَلُكَ اللَّهُمَّ إِذْ كُنَّا مُصَدِّقِينَ لَهُمْ أَنْ تُلْحِقَنَا بِتَصْدِيقِنَا بِالدَّرَجَةِ الْعَالِيَةِ لِنُبَشِّرَ أَنْفُسَنَا بِأَنَّا قَدْ طَهُرْنَا بِوَلايَتِهِمْ عَلَيْهِمُ السَّلَامُ''',
    ),
    Ziyarat(
      title: 'زيارة يوم الاثنين',
      benefits: 'زيارة الإمامين الحسن والحسين (ع)',
      text: '''زِيارة الحَسَنِ عليه السلام يومَ الإثنين السَّلامُ عَلَيْكَ يَا بْنَ رَسُولِ رَبِّ الْعَالَمِينَ السَّلامُ عَلَيْكَ يَا بْنَ أَمِيرِ الْمُؤْمِنِينَ السَّلامُ عَليْكَ يَا بْنَ فاطِمَةَ الزَّهْراءِ السَّلامُ عَلَيْكَ يَا حَبِيبَ اللهِ السَّلامُ عَلَيْكَ يَا صَفْوَةَ اللهِ السَّلامُ عَلَيْكَ يَا أمِينَ اللهِ السَّلامُ عَلَيْكَ يَا حُجَّةَ اللهِ السَّلامُ عَلَيْكَ يَا نُورَ اللهِ السَّلامُ عَلَيْكَ يَا صِرَاطَ اللهِ السَّلامُ عَلَيْكَ يَا بَيَانَ حُكْمِ اللهِ السَّلامُ عَلَيْكَ يَا نَاصِرَ دِينِ اللهِ السَّلامُ عَلَيْكَ أَيُّهَا السَّيِّدُ الزَّكيُّ السَّلامُ عَلَيْكَ أَيُّهَا البَرُّ الوَفِيُّ السَّلامُ عَلَيْكَ أَيُّهَا الْقَائِمُ الأَمِينُ السَّلامُ عَلَيْكَ أَيُّهَا الْعَالِمُ بِالتَّأْوِيلِ السَّلامُ عَلَيْكَ أَيُّهَا الْهَادِي المَهْديُّ السَّلامُ عَلَيْكَ أَيُّهَا الطَّاهِرُ الزَّكِيُّ السَّلامُ عَلَيْكَ أَيُّهَا التَّقِيُّ النَّقِيُّ السَّلامُ عَلَيْكَ أَيُّهَا الْحَقُّ الْحَقِيقُ السَّلامُ عَلَيْكَ أَيُّهَا الشَّهِيدُ الصِّدِّيقُ السَّلامُ عَلَيْكَ يَا أَبَا مُحَمَّدٍ الْحَسَنَ بْنَ عَلِيٍّ وَّرَحْمَةُ اللهِ وَبَرَكَاتُهُ  

زِيارَة الحُسَين عليه السلام يومَ الإثنين اَلسَّلامُ عَلَيْكَ يَا بْنَ رَسُولِ اللهُ السَّلامُ عَلَيْكَ يَا بْنَ أَمِيرِ الْمُؤْمِنِينَ السَّلامُ عَلَيْكَ يَا بْنَ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ أَشْهَدُ أَنَّكَ أَقَمْتَ الصَّلاةَ وَآتَيْتَ الزَّكَاةَ وَأَمَرْتَ بِالْمَعْرُوفِ وَنَهَيْتَ عَنِ الْمُنْكَرِ وَعَبَدتَّ الله مُخْلِصاً وَجاهَدتَّ فِي اللهِ حَقَّ جِهَادِهِ حَتَّى أَتَاكَ الْيَقِينُ فَعَلَيْكَ السَّلامُ مِنِّي مَابَقِيتُ وَبَقِيَ اللَّيْلُ وَالنَّهَارُ وَعَلَى آلِ بَيْتِكَ الطَّيِّبِينَ الطَّاهِرِينَ أَنَا يَا مَوْلايَ مَوْلًى لَّكَ وَلآلِ بَيْتِكَ سِلْمٌ لِّمَنْ سَالَمَكُمْ وَحَرْبٌ لِّمَنْ حَارَبَكُمْ مُؤْمِنٌ بِسرِّكُمْ وَجَهْرِكُمْ وَظَاهِرِكُمْ وَبَاطِنِكُمْ لَعَنَ اللهُ أَعْدَاءَكُم مِّنَ الأَوَّلِينَ وَالآخِرِينَ وَأَنَا أَبْرَأُ إِلَى اللهِ تَعَالَى مِنْهُمْ يَا مَوْلايَ يَا أَبَا مُحَمَّدٍ يَا مَوْلايَ يَا أَبَا عَبْدِ اللهِ هَذَا يَوْمُ الإِثْنَيْنِ وَهُوَ يَوْمُكُمَا وَبِاسْمِكُمَا وَأَنَا فِيهِ ضَيْفُكُمَا فَأَضِيفَانِي وَأَحسِنَا ضِيَافَتِي فَنِعْمَ مَنِ اسْتُضِيفَ بِهِ أَنْتُمَا وَأَنَا فِيهِ مِنْ جِوَارِكُمَا فَأَجِيرَانِي فَإِنَّكُمَا مَأمُورَانِ بِالضِّيَافَةِ وَالإِجَارَةِ فَصَلَّى اللهُ عَلَيْكُمَا وَآلِكُمَا الطَّيِّبِينَ''',
    ),
    Ziyarat(
      title: 'زيارة يوم الثلاثاء',
      benefits: 'زيارة الأئمة السجاد والباقر والصادق (ع)',
      text: '''بسم الله الرحمن الرحيم 

زيارة علي بن الحسين ومحمد بن علي الباقر وجعفر بن محمد الصادق صلوات الله عليهم أجمعين يوم الثلاثاء اَلسَّلامُ عَلَيْكُمْ يَا خُزَّانَ عِلْمِ اللهِ اَلسَّلامُ عَلَيْكُمْ يَا تَرَاجِمَةَ وَحْيِ اللهِ اَلسَّلامُ عَلَيْكُمْ يَا أئِمَّةَ الْهُدَى اَلسَّلامُ عَلَيْكُم يَا أعْلامَ التُّقَى اَلسَّلامُ عَلَيْكُمْ يَا أوْلادَ رَسُولِ اللهِ أَنَا عَارِفٌ بِحَقِّكُمْ مُسْتَبْصِرٌ بِشَأْنِكُمْ مُعَادٍ لِّأَعْدَائِكُمْ مُوَالٍ لِّأَوْلِيَائِكُمْ بِأَبِي أَنْتُمْ وَاُمِّي صَلَوَاتُ اللهِ عَلَيْكُمْ اَللَّهُمَّ إِنِّي أَتَوَالَى آخِرَهُمْ كَمَا تَوَالَيْتُ أَوَّلَهُمْ وَأَبْرَأُ مِنْ كُلِّ وَلِيجَةٍ دُونَهُمْ وَأَكْفُرُ بِالْجِبْتِ وَالطَّاغُوتِ وَاللَّاتِ وَالْعُزَّى صَلَوَاتُ اللهِ عَلَيْكُمْ يَا مَوالِيَّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ اَلسَّلامُ عَلَيْكَ يَا سَيِّدَ الْعَابِدِينَ وَسُلالَةَ الْوَصِيِّينَ اَلسَّلامُ عَلَيْكَ يَا بَاقِرَ عِلْمِ النَّبِيِّينَ اَلسَّلامُ عَلَيْكَ يَا صَادِقاً مُصَدَّقاً فِي الْقَوْلِ وَالْفِعْلِ يَا مَوالِيَّ هَذَا يَوْمُكُمْ وَهُوَ يَوْمُ الثُّلاثاءِ وَأَنَا فِيهِ ضَيْفٌ لَّكُمْ وَمُسْتَجِيرٌ بِكُمْ فَأَضِيفُونِي وَأَجِيرُونِي بِمَنْزِلَةِ اللهِ عِنْدَكُمْ وَآلِ بَيْتِكُمُ الطَّيِّبِينَ الطَّاهِرِينَ''',
    ),
    Ziyarat(
      title: 'زيارة يوم الأربعاء',
      benefits: 'زيارة الأئمة الكاظم والرضا والجواد والهادي (ع)',
      text: '''بسم الله الرحمن الرحيم 

اَلسَّلامُ عَلَيْكُم يَا أوْلِيَاء اللهِ اَلسَّلامُ عَلَيْكُم يَا حُجَجَ اللهِ اَلسَّلامُ عَلَيْكُمْ يَا نُورَ اللهِ فِي ظُلُمَاتِ الأَرْضِ اَلسَّلامُ عَلَيْكُمْ صَلَواتُ اللهِ عَلَيْكُمْ وَعَلَى آلِ بَيْتِكُمْ الطَّيِّبِينَ الطَّاهِرِينَ بِأَبِي أَنْتُمْ وَاُمِّي لَقَدْ عَبَدتُّمُ اللهَ مُخْلِصِينَ وَجاهَدتُّمْ فِي اللهِ حَقَّ جِهَادِهِ حَتَّى أَتَاكُمُ الْيَقِينُ فَلَعَنَ اللهُ أَعْدَاءَكُمْ مِنَ الْجِنِّ وَالإِنْسِ أَجْمَعِينَ وَأَنَا أَبْرَأُ إِلَى اللهِ وَإِلَيْكُم مِّنْهُمْ يَا مَوْلايَ يَا أَبَا إِبْرَاهِيمَ مُوسَى بْنَ جَعْفَرٍ يَا مَوْلايَ يَا أَبَا الْحَسَنِ عَلِيَّ بْنَ مُوسَى يَا مَوْلايَ يَا أَبَا جَعْفَرٍ مُحَمَّدَ بْنَ عَلِيٍّ يَا مَوْلايَ يَا أَبَا الْحَسَنِ عَلِيَّ بْنَ مُحَمَّدٍ أَنَا مَوْلًى لَّكُمْ مُؤْمِنٌ بِسِرِّكُمْ وَجَهْرِكُمْ مُتَضَيِّفٌ بِكُمْ فِي يَوْمِكُمْ هَذَا وَهُوَ يَوْمُ الأَرْبِعَاءِ وَمُسْتَجِيرٌ بِكُمْ فَأَضِيفُونِي وَأَجِيرُونِي بِآلِ بَيْتِكُمُ الطَّيِّبِينَ الطَّاهِرِينَ''',
    ),
    Ziyarat(
      title: 'زيارة يوم الخميس',
      benefits: 'زيارة الإمام العسكري (ع)',
      text: '''بسم الله الرحمن الرحيم 

اَلسَّلامُ عَلَيْكَ يَا وَلِيَّ اللهِ اَلسَّلامُ عَلَيْكَ يَا حُجَّةَ اللهِ وَخَالِصَتَهُ اَلسَّلامُ عَلَيْكَ يَا إِمَامَ الْمُؤْمِنِينَ وَوَارِثَ الْمُرْسَلِينَ وَحُجَّةَ رَبِّ الْعَالَمِينَ صَلَّى اللهُ عَلَيْكَ وَعَلَى آلِ بَيْتِكَ الطَّيِّبِينَ الطَّاهِرِينَ يَا مَوْلايَ يَا أَبَا مُحَمَّدٍ الْحَسَنَ بْنَ عَلِيٍّ أَنَا مَولًى لَّكَ وَلآلِ بَيْتِكَ وَهَذَا يَوْمُكَ وَهُوَ يَوْمُ الْخَمِيسِ وَأَنَا ضَيْفُكَ فِيهِ وَمُسْتَجِيرٌ بِكَ فِيهِ فَأَحْسِنْ ضِيَافَتِي وَإِجَارَتِي بِحَقِّ آلِ بَيْتِكَ الطَّيِّبِينَ الطَّاهِرِينَ''',
    ),
    Ziyarat(
      title: 'زيارة يوم الجمعة',
      benefits: 'زيارة الإمام المهدي (عج)',
      text: '''بسم الله الرحمن الرحيم 

اَلسَّلامُ عَلَيْكَ يَا حُجَّةَ اللهِ فِي أَرْضِهِ اَلسَّلامُ عَلَيْكَ يَا عَيْنَ اللهِ فِي خَلْقِهِ اَلسَّلامُ عَلَيْكَ يا نُورَ اللهِ الَّذِي يَهْتَدِي بِهِ الْمُهتَدُونَ ويُفَرَّجُ بِهِ عَنِ الْمُؤْمِنِينَ اَلسَّلامُ عَلَيْكَ أَيُّهَا الْمُهَذَّبُ الْخَائِفُ اَلسَّلامُ عَلَيْكَ أَيُّهَا الْوَليُّ النَّاصِحُ اَلسَّلامُ عَلَيْكَ يَا سَفِينَةَ النَّجَاةِ اَلسَّلامُ عَلَيْكَ يَا عَيْنَ الْحَياةِ اَلسَّلامُ عَلَيْكَ صَلَّى الله عَلَيْكَ وَعَلَى آلِ بَيْتِكَ الطَّيِّبِينَ الطَّاهِرِينَ اَلسَّلامُ عَلَيْكَ عَجَّلَ الله لَكَ مَا وَعَدَكَ مِنَ النَّصْرِ وَظُهُورِ الأَمْرِ اَلسَّلامُ عَلَيْكَ يَا مَوْلايَ أَنَا مَوْلاكَ عَارِفٌ بِأُولاكَ وأُخْرَاكَ أَتَقَرَّبُ إِلَى اللهِ تَعَالَى بِكَ وَبِآلِ بَيْتِكَ وَأَنْتَظِرُ ظُهُورَكَ وَظُهُورَ الْحَقِّ عَلَى يَدَيْكَ وَأَسْأَلُ اللهَ أَن يُّصَلِّيَ عَلَى مُحَمَّدٍ وَّآلِ مُحَمَّدٍ وَّأَن يَّجْعَلَنِي مِنَ الْمُنْتَظِرِينَ لَكَ وَالتَّابِعِينَ وَالنَّاصِرِينَ لَكَ عَلَى أَعْدَائِكَ وَالْمُسْتَشْهَدِينَ بَيْنَ يَدَيْكَ فِي جُمْلَةِ أَوْلِيَائِكَ يَا مَوْلايَ يَا صَاحِبَ الزَّمَانِ صَلَوَاتُ اللهِ عَلَيْكَ وَعَلَى آلِ بَيْتِكَ هَذَا يَوْمُ الْجُمُعَةِ وَهُوَ يَوْمُكَ الْمُتَوَقَّعُ فِيهِ ظُهُورُكَ وَالْفَرَجُ فِيهِ لِلْمُؤْمِنِينَ عَلَى يَدَيْكَ وَقَتْلُ الْكَافِرِينَ بِسَيْفِكَ وَأَنَا يَا مَوْلايَ فِيهِ ضَيْفُكَ وَجَارُكَ وَأَنْتَ يَا مَوْلايَ كَرِيمٌ مِّنْ أَوْلادِ الْكِرَامِ وَمَأْمُورٌ بِالضِّيَافَةِ وَالإِجَارَةِ فَأَضِفْنِي وَأَجِرْنِي صَلَوَاتُ اللهِ عَلَيْكَ وعَلَى أَهْلِ بَيْتِكَ الطَّاهِرِينَ''',
    ),
  ];

  // =========================================================================
  // الأذكار (المناجاة، التسبيحات، التعويذات، أذكار أيام الأسبوع)
  // =========================================================================

  static final List<Dhikr> munajats = [
    Dhikr(
      title: "المناجاة المنظومة لأمير المؤمنين عليه السلام",
      benefits:
          "مناجاة عظيمة مروية عن الإمام علي (ع).",
      text: '''بسم الله الرحمن الرحيم

لَكَ الْحَمْدُ يَا ذَا الْجُودِ وَالْمَجْدِ وَالْعُلَى تَبَارَكْتَ تُعْطِي مَنْ تَشَاءُ وَتَمْنَعُ
إِلَهِي وَخَلَّاقِي وَحِرْزِي وَمَوْئِلِي إِلَيْكَ لَدَى الْإِعْسَارِ وَالْيُسْرِ أَفْزَعُ
إِلَهِي لَئِنْ جَلَّتْ وَجَمَّتْ خَطِيئَتِي فَعَفْوُكَ عَنْ ذَنْبِي أَجَلُّ وَأَوْسَعُ
إِلَهِي تَرَى حَالِي وَفَقْرِي وَفَاقَتِي وَأَنْتَ مُنَاجَاتِي الْخَفِيَّةَ تَسْمَعُ
إِلَهِي فَلَا تَقْطَعْ رَجَائِي وَلا تُزِغْ فُؤَادِي فَلِي فِي سَيْبِ جُودِكَ مَطْمَعُ
إِلَهِي لَئِنْ خَيَّبْتَنِي أَوْ طَرَدتَّنِي فَمَنْ ذَا الَّذِي أَرْجُو وَمَنْ ذَا أُشَفِّعُ
إِلَهِي أَجِرْنِي مِنْ عَذَابِكَ إِنَّنِي أَسِيرٌ ذَلِيلٌ خَائِفٌ لَكَ أَخْضَعُ
إِلَهِي فَآنِسْنِي بِتَلْقِينِ حُجَّتِي إِذَا كَانَ لِي فِي الْقَبْرِ مَثْوًى وَمَضْجَعُ
إِلَهِي لَئِنْ عَذَّبْتَنِي أَلْفَ حِجَّةٍ فَحَبْلُ رَجَائِي مِنْكَ لَا يَتَقَطَّعُ
إِلَهِي أَذِقْنِي طَعْمَ عَفْوِكَ يَوْمَ لَا بَنُونَ وَلَا مالٌ هُنَالِكَ يَنْفَعُ
إِلَهِي لَئِن لَّمْ تَرْعَنِي كُنْتُ ضَائِعاً وَإِنْ كُنْتَ تَرْعَانِي فَلَسْتُ أُضَيَّعُ
إِلَهِي إِذَا لَمْ تَعْفُ عَنْ غَيْرِ مُحْسِنٍ فَمَن لِّمُسِيءٍ بِالْهَوَى يَتَمَتَّعُ
إِلَهِي لَئِنْ فَرَّطتُّ فِي طَلَبِ التُّقَى فَهَا أَنَا إِثْرَ الْعَفْوِ أَقْفُو وَأتْبَعُ
إِلَهِي لَئِنْ أَخْطاْتُ جَهْلاً فَطَالَمَا رَجَوْتُكَ حَتَّى قِيلَ مَا هُوَ يَجْزَعُ
إِلَهِي ذُنُوبِي بَذَّتِ الطَّوْدَ وَاعتَلَتْ وَصَفْحُكَ عَنْ ذَنْبِي أَجَلُّ وَأَرْفَعُ
إِلَهِي يُنَجِّي ذِكْرُ طَوْلِكَ لَوْعَتِي وَذِكْرُ الْخَطَايَا الْعَيْنَ مِنِّي يُدَمِّعُ
إِلَهِي أَقِلْنِي عَثْرَتِي وَامْحُ حَوْبَتِي فَإِنّي مُقِرٌّ خَائِفٌ مُتَضَرِّعُ
إِلَهِي أَنِلْنِي مِنْكَ رَوْحاً وَرَاحَةً فَلَسْتُ سِوَى أَبْوَابِ فَضْلِكَ أَقْرَعُ
إِلَهِي لَئِنْ أَقْصَيْتَنِي أَوْ أَهَنْتَنِي فَمَا حِيلَتِي يَا رَبِّ أَمْ كَيْفَ أَصْنَعُ
إِلَهِي حَلِيفُ الْحُبِّ فِي اللَّيْلِ سَاهِرٌ يُنَاجِي وَيَدْعُو وَالْمُغَفَّلُ يَهْجَعُ
إِلَهِي وَهَذَا الْخَلْقُ مَا بَيْنَ نَائِمٍ وَمُنْتَبِهٍ فِي لَيْلَهِ يَتَضَرَّعُ
وكُلُّهُمُ يَرْجُو نَوَالَكَ رَاجِياً لِرَحْمَتِكَ الْعُظْمَى وَفِي الْخُلْدِ يَطْمَعُ
إِلَهِي يُمَنِّينِي رَجَائِي سَلامَةً وَقُبْحُ خَطِيئَاتِي عَلَيَّ يُشَنِّعُ
إِلَهِي فَإِنْ تَعْفُو فَعَفْوُكَ مُنْقِذِي وَإِلَّا فَبِالذَّنْبِ الْمُدَمِّرِ أُصْرَعُ
إِلَهِي بِحَقِّ الْهَاشِميِّ مُحَمَّدٍ وَحُرْمَةِ أَطْهَارٍ هُمُ لَكَ خُضَّعُ
إِلَهِي بِحَقِّ الْمُصْطَفَى وَابْنِ عَمِّهِ وَحُرْمَةِ أَبْرار هُمُ لَكَ خُشَّعُ
إِلَهِي فَأَنْشِرْنِي عَلَى دِينِ أَحْمَدٍ مُنِيباً تَقِيًّا قَانِتاً لَكَ أَخْضَعُ
وَلا تَحْرِمْنِّي يَا إِلَهِي وَسَيِّدِي شَفاعَتَهُ الْكُبْرَى فَذَاكَ الْمُشَفَّعُ
وَصَلِّ عَلَيْهِم مَّا دَعَاكَ مُوَحِّدٌ وَنَاجَاكَ أَخْيَارٌ بِبَابِكَ رُكَّعُ''',
    ),
    Dhikr(
      title: "مناجاة التائبين",
      benefits:
          "مناجاة عظيمة مروية عن الإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي أَلْبَسَتْنِي الْخَطَايَا ثَوْبَ مَذَلَّتِي وَجَلَّلَنِي التَّبَاعُدُ مِنْكَ لِباسَ مَسْكَنَتِي وَأَمَاتَ قَلْبِي عَظِيمُ جِنَايَتِي فَأَحْيِهِ بِتَوْبَةٍ مِّنْكَ يَا أَمَلِي وَبُغْيَتِي وَيَا سُؤْلِي وَمُنْيَتِي فَوَعِزَّتِكَ مَا أَجِدُ لِذُنُوبِي سِوَاكَ غَافِراً وَلا أَرَى لِكَسْرِي غَيْرَكَ جَابِراً وَقَدْ خَضَعْتُ بِالإِنَابَةِ إِلَيْكَ وَعَنَوْتُ بِالِاسْتِكانَةِ لَدَيْكَ فَإِنْ طَرَدْتَنِي مِنْ بَابِكَ فَبِمَنْ أَلُوذُ وَإِن رَّدَدْتَنِي عَنْ جَنَابِكَ فَبِمَنْ أعُوذُ فَوا أَسَفَاهُ مِنْ خَجْلَتِي وَافْتِضَاحِي وَوَا لَهْفَاهُ مِنْ سُوءِ عَمَلِي وَاجْتِرَاحِي أَسْأَلُكَ يَا غَافِرَ الذَّنْبِ الكَبِيرِ وَيَا جابِرَ الْعَظْمِ الْكَسِيرِ أَنْ تَهَبَ لِي مُوبِقَاتِ الْجَرَائِرِ وَتَسْتُرَ عَلَيَّ فَاضِحَاتِ السَّرَائِرِ وَلا تُخْلِنِي فِي مَشْهَدِ الْقِيَامَةِ مِنْ بَرْدِ عَفْوِكَ وَغَفْرِكَ وَلا تُعْرِنِي مِنْ جَمِيلِ صَفْحِكَ وَسَتْرِكَ إِلَهِي ظَلِّلْ عَلَى ذُنُوبِي غَمَامَ رَحْمَتِكَ وَأَرْسِلْ عَلَى عُيُوبِي سَحَابَ رَأْفَتِكَ إِلَهِي هَلْ يَرْجِعُ الْعَبْدُ الآبِقُ إِلَّا إِلَى مَوْلَاهُ أَمْ هَلْ يُجِيرُهُ مِنْ سَخَطِهِ أَحَدٌ سِوَاهُ إِلَهِي إِنْ كَانَ النَّدَمُ عَلَى الذَّنْبِ تَوْبَةً فَإِنِّي وَعِزَّتِكَ مِنَ النَّادِمِينَ وَإِنْ كَانَ الِاسْتِغْفَارُ مِنَ الْخَطِيئَةِ حِطَّةً فَإنِّي لَكَ مِنَ المُسْتَغْفِرِينَ لَكَ الْعُتْبَى حَتَّى تَرْضَى إِلَهِي بِقُدْرَتِكَ عَلَيَّ تُبْ عَلَيَّ وَبِحِلْمِكَ عَنِّي اعْفُ عَنِّي وَبِعِلْمِكَ بِي ارْفَقْ بِي إِلَهِي أَنْتَ الَّذِي فَتَحْتَ لِعِبَادِكَ بَاباً إِلَى عَفْوِكَ سَمَّيْتَهُ التَّوْبَةَ فَقُلْتَ تُوبُوا إِلَى اللهِ تَوْبَةً نَصُوحاً فَمَا عُذْرُ مَنْ أَغْفَلَ دُخُولَ الْبَابِ بَعْدَ فَتْحِهِ إِلَهِي إنْ كَانَ قَبُحَ الذَّنْبُ مِنْ عَبْدِكَ فَلْيَحْسُنِ الْعَفْوُ مِنْ عِنْدِكَ إِلهِي مَا أَنَا بِأَوَّلِ مَنْ عَصَاكَ فَتُبْتَ عَلَيْهِ وَتَعَرَّضَ لِمَعْرُوفِكَ فَجُدتَّ عَلَيْهِ يَا مُجِيبَ الْمُضْطَرِّ يَا كَاشِفَ الضُّرِّ يا عَظِيمَ الْبِرِّ يَا عَلِيماً بِمَا فِي السِّرِّ يا جَمِيلَ السِّتْرِ اِسْتَشْفَعْتُ بِجُودِكَ وَكَرمِكَ إِلَيْكَ وَتَوَسَّلُتُ بِجَنَابِكَ وَتَرَحُّمِكَ لَدَيْكَ فَاسْتَجِبْ دُعَائِي وَلا تُخَيِّبْ فِيكَ رَجَائِي وَتَقَبَّلْ تَوْبَتِي وَكَفِّرْ خَطِيئَتِي بِمَنِّكَ وَرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة الراجين",
      benefits:
          "من المناجاة الخمس عشرة، تقرأ لتقوية الرجاء بالله وعدم اليأس من رحمته تعالى.",
      text: '''بسم الله الرحمن الرحيم

يَا مَنْ إِذَا سَأَلَهُ عَبْدٌ أَعْطَاهُ وَإِذَا أَمَّلَ مَا عِنْدَهُ بَلَّغَهُ مُنَاهُ وَإذَا أَقْبَلَ عَلَيْهِ قَرَّبَهُ وَأَدْنَاهُ وَإِذَا جَاهَرَهُ بِالْعِصْيانِ سَتَرَ عَلَى ذَنْبِهِ وَغَطَّاهُ وَإِذَا تَوَكَّلَ عَلَيْهِ أَحْسَبَهُ وَكَفَاهُ إِلَهِي مَنِ الَّذِي نَزَلَ بِكَ مُلْتَمِساً قِرَاكَ فَمَا قَرَيْتَهُ وَمَنِ الَّذِي أَنَاخَ بِبَابِكَ مُرْتَجِياً نَدَاكَ فَمَا أَوْلَيْتَهُ أَيَحْسُنُ أَنْ أَرْجِعَ عَنْ بَابِكَ بالْخَيْبَةِ مَصْرُوفاً وَلَسْتُ أَعْرِفُ سِوَاكَ مَوْلًى بِالإِحْسَانِ مَوْصُوفاً كَيْفَ أَرْجُو غَيْرَكَ وَالْخَيْرُ كُلُّهُ بِيَدِكَ وَكَيْفَ أُؤَمِّلُ سِوَاكَ وَالْخَلْقُ وَالأَمْرُ لَكَ أَأَقْطَعُ رَجَائِي مِنْكَ وَقَدْ أَوْلَيْتَنِي ما لَمْ أَسْأَلْهُ مِنْ فَضْلِكَ أَمْ تُفْقِرُنِي إِلَى مِثْلِي وَأَنَا أَعْتَصِمُ بِحَبْلِكَ يا مَنْ سَعَِدَ بِرَحْمَتِهِ الْقَاصِدُونَ وَلَمْ يَشْقَ بِنِقْمَتِهِ المُسْتَغْفِرُونَ كَيْفَ أَنْسَاكَ وَلَمْ تَزَلْ ذَاكِرِي وَكَيْفَ أَلْهُو عَنْكَ وَأَنْتَ مُراقِبِي إِلَهِي بِذَيْلِ كَرَمِكَ أَعْلَقْتُ يَدِي وَلِنَيْلِ عَطَايَاكَ بَسَطتُّ أَمَلِي فَأَخْلِصْنِي بِخَالِصَةِ تَوْحِيدِكَ وَاجْعَلْنِي مِنْ صَفْوَةِ عَبِيدِكَ يَا مَنْ كُلُّ هَارِبٍ إِلَيْهَ يَلْتَجِئُ وَكُلُّ طَالِبٍ إِيَّاهُ يَرْتَجِي يا خَيْرَ مَرْجُوٍّ وَيَا أَكْرَمَ مَدْعُوٍّ وَيا مَن لّا يُرَدُّ سَائِلُهُ وَلا يُخَيَّبُ آمِلُهُ يا مَنْ بابُهُ مَفْتُوحٌ لِداعِيهِ وَحِجابُهُ مَرْفُوعٌ لِرَاجِيهِ أَسْأَلُكَ بِكَرَمِكَ أَنْ تَمُنَّ عَلَيَّ مِنْ عَطَائِكَ بِمَا تَقِرُّ بِهِ عَيْنِي وَمِن رَّجائِكَ بِمَا تَطْمَئِنُّ بِهِ نَفْسِي وَمِنَ الْيَقِينِ بِمَا تُهَوِّنْ بِهِ عَلَيَّ مُصِيبَاتِ الدُّنْيَا وَتَجْلُو بِهِ عَنْ بَصِيرَتِي غَشَوَاتِ الْعَمَى بِرَحْمَتِكَ يا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة المطيعين لله",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

اَللَّهُمَّ أَلْهِمْنَا طَاعَتَكَ وَجَنِّبْنَا مَعْصِيَتَكَ وَيَسِّرْ لَنَا بُلُوغَ مَا نَتَمَنَّى مِنِ ابْتِغَاءِ رِضْوَانِكَ وَأَحْلِلْنَا بُحْبُوحَةَ جِنَانِكَ وَاقْشَعْ عَنْ بَصَائِرِنَا سَحَابَ الِارْتِيَابِ وَاكْشِفْ عَنْ قُلُوبِنَا أَغْشِيَةَ الْمِرْيَةِ وَالْحِجَابِ وَأَزْهِقِ الْبَاطِلَ عَنْ ضَمَائِرِنَا وَأَثْبِتِ الْحَقَّ فِي سَرَائِرِنَا فَإنَّ الشُّكُوكَ وَالظُّنُونَ لَوَاقِحُ الْفِتَنِ وَمُكَدِّرَةٌ لِّصَفْوِ الْمَنَائِحِ وَالْمِنَنِ اَللَّهُمَّ احْمِلْنَا فِي سُفُنِ نَجَاتِكَ وَمَتِّعْنَا بِلَذِيذِ مُنَاجَاتِكَ وَأَوْرِدْنَا حِيَاضَ حُبِّكَ وَأَذِقْنَا حَلاوَةَ وُدِّكَ وَقُرْبِكَ وَاجْعَلْ جِهَادَنا فِيْكَ وَهَمَّنَا فِي طَاعَتِكَ وَأَخْلِصْ نِيَّاتِنَا فِي مُعَامَلَتِكَ فَإنَّا بِكَ وَلَكَ وَلا وَسِيلَةَ لَنَا إِلَيْكَ إِلّا أَنْتَ إِلَهِي اجْعَلْنِي مِنَ المُصْطَفَيْنَ الأَخْيَارِ وأَلْحِقْنِي بِالصَّالِحِينَ الأَبْرَارِ السَّابِقِينَ إِلَى الْمَكْرُمَاتِ الْمُسَارِعِينَ إِلَى الْخَيْرَاتِ الْعَامِلِينَ لِلْبَاقِيَاتِ الصَّالِحَاتِ السَّاعِينَ إِلَى رَفِيعِ الدَّرَجَاتِ إنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَبِالإِجَابَةِ جَدِيرٌ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة المتوسلين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي لَيْسَ لِي وَسِيلَةٌ إِلَيْكَ إِلّا عَوَاطِفُ رَأْفَتِكَ وَلا لِي ذَرِيعَةٌ إِلَيْكَ إِلّا عَوَارِفُ رَحْمَتِكَ وَشَفَاعَةُ نَبِيِّكَ نَبِيِّ الرَّحْمَةِ وَمُنْقِذِ الأُمَّةِ مِنَ الغُمَّةِ فَاجْعَلْهُمَا لِي سَبَباً إِلَى نَيْلِ غُفْرَانِكَ وَصَيِّرْهُمَا لِي وُصْلَةً إِلَى الْفَوْزِ بِرِضْوَانِكَ وَقَدْ حَلَّ رَجَائِي بِحَرَمِ كَرَمِكَ وَحَطَّ طَمَعِي بِفِنَاءِ جُودِكَ فَحَقِّقْ فِيكَ أَمَلِي وَاخْتِمْ بِالْخَيْرِ عَمَلِي وَاجْعَلْنِي مِنْ صَفْوَتِكَ الَّذِينَ أَحْلَلْتَهُمْ بُحْبُوحَةَ جَنَّتِكَ وَبَوَّأْتَهُمْ دَارَ كَرَامَتِكَ وَأَقْرَرْتَ أَعْيُنَهُمْ بِالنَّظَرِ إِلَيْكَ يَوْمَ لِقَائِكَ وَأَوْرِدْنَا مَنَازِلَ الصِّدْقِ فِي جِوارِكَ يا مَنْ لا يَفِدُ الْوَافِدُونَ عَلَى أَكْرَمَ مِنْهُ وَلا يَجِدُ الْقَاصِدُونَ أَرْحَمَ مِنْهُ يَا خَيْرَ مَنْ خَلا بِهِ وَحِيدٌ وَيَا أَعْطَفَ مَنْ أَوَى إِلَيْهِ طَرِيدٌ إِلَى سَعَةِ عَفْوِكَ مَدَدْتُ يَدِي وَبِذَيْلِ كَرَمِكَ أَعْلَقْتُ كَفِّي فَلا تُولِنِي الْحِرْمَانَ وَلا تُبْلِنِي بِالْخَيْبَةِ وَالْخُسْرانِ يَا سَمِيعَ الدُّعَاءِ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة الذاكرين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي لَوْلا الْواجِبُ مِنْ قَبُولِ أَمْرِكَ لَنَزَّهْتُكَ عَنْ ذِكْرِي إِيَّاكَ عَلَى أَنَّ ذِكْرِي لَكَ بِقَدْرِي لا بِقَدْرِكَ وَمَا عَسَى أَن يَّبْلُغَ مِقْدَارِي حَتَّى أُجْعَلَ مَحَلًّا لِّتَقْدِيسِكَ وَمِنْ أَعْظَمِ النِّعَمِ عَلَيْنَا جَرَيَانُ ذِكْرِكَ عَلَى أَلْسِنَتِنَا وَإِذْنُكَ لَنَا بِدُعَائِكَ وَتَنْزِيهِكَ وَتَسْبِيحِكَ إِلَهِي فَأَلْهِمْنَا ذِكْرَكَ فِي الْخَلَاءِ وَالْمَلَاءِ وَاللَّيْلِ وَالنَّهَارِ وَالإِعْلانِ وَالإِسْرَارِ وَفِي السَّرَّاءِ وَالضَّرَّاءِ وَآنِسْنَا بِالذِّكْرِ الخَفِيِّ وَاسْتَعْمِلْنَا بِالْعَمَلِ الزَّكِيِّ وَالسَّعْيِ الْمَرْضِيِّ وَجَازِنَا بِالْمِيزَانِ الْوَفِيِّ إِلَهِي بِكَ هَامَتِ الْقُلُوبُ الْوالِهَةُ وَعَلَى مَعْرِفَتِكَ جُمِعَتِ الْعُقُولُ الْمُتَبَايِنَةُ فَلا تَطْمَئِنُّ الْقُلُوبُ إِلَّا بِذِكْرَاكَ وَلا تَسْكُنُ النُّفُوسُ إِلَّا عِنْدَ رُؤْيَاكَ أَنْتَ الْمُسَبَّحُ فِي كُلِّ مَكَانٍ وَالْمَعْبُودُ فِي كُلِّ زَمَانٍ وَالْمَوْجُودُ فِي كُلِّ أَوَانٍ وَالْمَدْعُوُّ بِكُلِّ لِسَانٍ وَالمُعَظَّمُ فِي كُلِّ جَنَانٍ وَأَسْتَغْفِرُكَ مِنْ كُلِّ لَذَّةٍ بِغَيْرِ ذِكْرِكَ وَمِنْ كُلِّ رَاحَةٍ بِغَيْرِ أُنْسِكَ وَمِنْ كُلِّ سُرُورٍ بِغَيْرِ قُرْبِكَ وَمِنْ كُلِّ شُغْلٍ بِغَيْرِ طَاعَتِكَ إِلَهِي أَنْتَ قُلْتَ وَقَوْلُكَ الْحَقُّ يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللهَ ذِكْراً كَثِيراً وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً وَقُلْتَ وَقَوْلُكَ الحَقُّ فَاذْكُرُونِي أَذْكُرْكُمْ فَأَمَرْتَنَا بِذِكْرِكَ وَوَعَدتَّنَا عَلَيْهِ أَنْ تَذْكُرَنَا تَشْرِيفاً لَّنَا وَتَفْخِيماً وَإِعْظَاماً وَهَا نَحْنُ ذاكِرُوكَ كَمَا أَمَرْتَنَا فَأَنْجِزْ لَنَا مَا وَعَدتَّنَا يَا ذاكِرَ الذَّاكِرِينَ وَيَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة الشاكين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي إِلَيْكَ أَشْكُو نَفْساً بِالسُّوءِ أَمَّارَةً وَإِلَى الْخَطِيئَةِ مُبَادِرَةً وَبِمَعَاصِيكَ مُولَعَةً وَلِسَخَطِكَ مُتَعَرِّضَةً تَسْلُكُ بِي مَسَالِكَ الْمَهَالِكِ وَتَجْعَلُنِي عِنْدَكَ أَهْوَنَ هَالِكٍ كَثِيرَةَ الْعِلَلِ طَوِيلَةَ الأَمَلِ إن مَّسَّها الشَّرُّ تَجْزَعُ وَإن مَّسَّهَا الْخَيْرُ تَمْنَعُ مَيَّالَةً إِلَى اللَّعِبِ وَاللَّهْوِ مَمْلُوءَةً بِالْغَفْلَةِ وَالسَّهْوِ تُسْرِعُ بِي إِلَى الْحَوْبَةِ وَتُسَوِّفُنِي بِالتَّوْبَةِ إِلَهِي أَشْكُو إِلَيْكَ عَدُوًّا يُضِلُّنِي وَشَيْطَاناً يُغْوِينِي قَدْ مَلَأَ بالوَسْواسِ صَدْرِي وَأَحَاطَتْ هَواجِسُهُ بِقَلْبِي يُعَاضِدُ لِيَ الْهَوَى وَيُزَيِّنُ لِي حُبَّ الدُّنْيَا وَيَحُولُ بَيْنِي وَبَيْنَ الطَّاعَةِ وَالزُّلْفَى إِلَهِي إِلَيْكَ أَشْكُو قَلْباً قاسِياً مَعَ الوَسْوَاسِ مُتَقَلِّباً وَبِالرَّيْنِ وَالطَّبْعِ مُتَلَبِّساً وَعَيْناً عَنِ البُكاءِ مِنْ خَوْفِكَ جَامِدَةً وَإِلَى ما يَسُرُّها طَامِحَةً إِلَهِي لا حَوْلَ لِي وَلا قُوَّةَ إِلّا بِقُدْرَتِكَ وَلا نَجَاةَ لِي مِن مَّكارِهِ الدُّنْيَا إِلّا بِعِصْمَتِكَ فَأَسْأَلُكَ بِبَلاغَةِ حِكْمَتِكَ وَنَفَاذِ مَشِيَّتِكَ أَنْ لا تَجْعَلَنِي لِغَيْرِ جُودِكَ مُتَعَرِّضاً ولا تُصَيِّرَنِي لِلْفِتَنِ غَرَضاً وَكُن لِّي عَلَى الأَعْدَاءِ ناصِراً وَعَلَى الْمَخازِي وَالعُيُوبِ سَاتِراً وَمِنَ الْبَلاءِ وَاقِياً وَعَنِ الْمَعَاصِي عَاصِماً بِرَأْفَتِكَ وَرَحْمَتِكَ يا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة الراغبين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي إِنْ كَانَ قَلَّ زَادِي فِي الْمَسِيرِ إِلَيْكَ فَلَقَدْ حَسُنَ ظَنِّي بِالتَّوَكُّلِ عَلَيْكَ وَإِنْ كَانَ جُرْمِي قَدْ أَخَافَنِي مِنْ عُقُوبَتِكَ فَإنَّ رَجَائِي قَدْ أَشْعَرَنِي بِالأَمْنِ مِن نِّقْمَتِكَ وَإِنْ كانَ ذَنْبِي قَدْ عَرَضَنِي لِعِقابِكَ فَقَدْ آذَنَنِي حُسْنُ ثِقَتِي بِثَوَابِكَ وَإِنْ أَنامَتْنِي الْغَفْلَةُ عَن الِاسْتِعْدَادِ لِلِقَائِكَ فَقَدْ نَبَّهَتْنِي الْمَعْرِفَةُ بِكَرَمِكَ وَآلائِكَ وَإِنْ أَوْحَشَ مَا بَيْنِي وَبَيْنَكَ فَرْطُ الْعِصْيَانِ وَالطُّغْيَانِ فَقَدْ آنَسَنِي بُشْرَى الْغُفْرَانِ وَالرِّضْوَانِ أَسْأَلُكَ بِسُبُحَاتِ وَجْهِكَ وَبِأَنْوَارِ قُدْسِكَ وَأَبْتَهِلُ إِلَيْكَ بِعَوَاطِفِ رَحْمَتِكَ وَلَطَائِفِ بِرِّكَ أَنْ تُحَقِّقَ ظَنِّي بِمَا أُؤَمِّلُهُ مِنْ جَزِيلِ إكْرَامِكَ وَجَمِيلِ إنْعَامِكَ فِي الْقُرْبَى مِنْكَ والزُّلْفَى لَدَيْكَ وَالتَّمَتُّعِ بِالنَّظَرِ إِلَيْكَ وَهَا أَنَا مُتَعَرِّضٌ لِّنَفَحَاتِ رَوْحِكَ وَعَطْفِكَ وَمُنْتَجِعٌ غَيْثَ جُودِكَ وَلُطْفِكَ فارٌّ مِّنْ سَخَطِكَ إِلَى رِضَاكَ هَارِبٌ مِنْكَ إِلَيْكَ رَاجٍ أحْسَنَ مَا لَدَيْكَ مُعَوِّلٌ عَلَى مَوَاهِبِكَ مُفْتَقِرٌ إِلَى رِعَايَتِكَ إِلَهِي مَا بَدَأْتَ بِهِ مِنْ فَضْلِكَ فَتَمِّمْهُ وَمَا وَهَبْتَ لِي مِنْ كَرَمِكَ فَلَا تَسْلُبْهُ وَمَا سَتَرْتَهُ عَلَيَّ بِحِلْمِكَ فَلَا تَهْتِكْهُ وَمَا عَلِمْتَهُ مِنْ قَبِيحِ فِعْلِي فَاغْفِرْهُ إِلَهِي اسْتَشْفَعْتُ بِكَ إِلَيْكَ وَاسْتَجَرْتُ بِكَ مِنْكَ أَتَيْتُكَ طَامِعاً فِي إحْسَانِكَ راغِباً فِي امْتِنَانِكَ مُسْتَسْقِياً وَابِلَ طَوْلِكَ مُسْتَمْطِراً غَمَامَ فَضْلِكَ طَالِباً مَرْضَاتَكَ قَاصِداً جَنَابَكَ وَارِداً شَرِيعَةَ رِفْدِكَ مُلْتَمِساً سَنِيَّ الْخَيْرَاتِ مِنْ عِنْدِكَ وَافِداً إِلَى حَضْرَةِ جَمَالِكَ مُرِيداً وَجْهَكَ طَارِقاً بَابَكَ مُسْتَكِيناً بِعظَمَتِكَ وَجَلالِكَ فَافْعَلْ بِي مَا أَنْتَ أَهْلُهُ مِنَ الْمَغْفِرَةِ وَالرَّحْمَةِ وَلا تَفْعَلْ بِي مَا أَنَا أهْلُهُ مِنَ الْعَذَابِ وَالنِّقْمَةِ بِرَحْمَتِكَ يا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة المريدين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

سُبْحَانَكَ مَا أَضْيَقَ الطُّرُقَ عَلَى مَن لَّمْ تَكُنْ دَلِيلَهُ وَمَا أَوْضَحَ الْحَقَّ عِنْدَ مَنْ هَدَيْتَهُ سَبِيلَهُ إِلَهِي فَاسْلُكْ بِنَا سُبُلَ الْوُصُولِ إِلَيْكَ وَسَيِّرْنَا فِي أقْرَبِ الطُّرُقِ لِلْوُفُودِ عَلَيْكَ وَقَرِّبْ عَلَيْنَا الْبَعِيدَ وَسَهِّلْ عَلَيْنَا الْعَسِيرَ الشَّدِيدَ وَأَلْحِقْنَا بِعِبَادِكَ الَّذِينَ هُمْ بِالْبِدَارِ إِلَيْكَ يُسَارِعُونَ وَبَابَكَ عَلَى الدَّوَامِ يَطْرُقُونَ وَإيَّاكَ فِي اللَّيْلِ وَالنَّهَارِ يَعْبُدُونَ وَهُم مِّنْ هَيْبَتِكَ مُشْفِقُونَ الَّذِينَ صَفَّيْتَ لَهُمُ الْمَشَارِبَ وَبَلَّغْتَهُمُ الرَّغَائِبَ وَأَنْجَحْتَ لَهُمُ الْمَطَالِبَ وَقَضَيْتَ لَهُم مِّنْ فَضْلِكَ المَآرِبَ وَمَلَأتَ لَهُمْ ضَمَائِرَهُمْ مِنْ حُبِّكَ وَرَوَّيْتَهُمْ مِنْ صَافِي شِرْبِكَ فَبِكَ إِلَى لَذِيذِ مُنَاجَاتِكَ وَصَلُوا وَمِنْكَ أَقْصَى مَقَاصِدِهِمْ حَصَلُوا فَيَا مَنْ هُوَ عَلَى الْمُقْبِلِينَ عَلَيْهِ مُقْبِلٌ وَبِالْعَطْفِ عَلَيْهِمْ عائِدٌ مُفْضِلٌ وَبالْغَافِلِينَ عَنْ ذِكْرِهِ رَحِيمٌ رَؤُوفٌ وَبِجَذْبِهِمْ إِلَى بَابِهِ وَدُودٌ عَطُوفٌ أَسْأَلُكَ أَنْ تَجْعَلَنِي مِنْ أَوْفَرِهِم مِّنْكَ حَظًّا وَأَعْلاهُمْ عِنْدَكَ مَنْزِلاً وأَجْزَلِهِم مِّنْ وُدِّكَ قِسْماً وَأَفْضَلِهِمْ فِي مَعْرِفَتِكَ نَصِيباً فَقَدِ انْقَطَعَتْ إِلَيْكَ هِمَّتِي وَانْصَرَفَتْ نَحْوَكَ رَغْبَتِي فَأَنْتَ لا غَيْرُكَ مُرَادِي وَلَكَ لا لِسِوَاكَ سَهَرِي وَسُهَادِي وَلِقَاؤُكَ قُرَّةُ عَيْنِي وَوَصْلُكَ مُنَى نَفْسِي وَإِلَيْكَ شَوْقِي وَفِي مَحَبَّتِكَ وَلَهِي وَإِلَى هَوَاكَ صَبَابَتِي وَرِضَاكَ بُغْيَتِي وَرُؤْيَتُكَ حَاجَتِي وَجِوَارُكَ طَلَبِي وَقُرْبُكَ غَايَةُ سُؤْلِي وَفِي مُنَاجَاتِكَ رَوْحِي وَرَاحَتِي وَعِنْدَكَ دَوَاءُ عِلَّتِي وَشِفاءُ غُلَّتِي وَبَرْدُ لَوْعَتِي وَكَشْفُ كُرْبَتِي فَكُنْ أَنِيسِي فِي وَحْشَتِي وَمُقِيلَ عَثْرَتِي وَغَافِرَ زَلَّتِي وَقَابِلَ تَوْبَتِي وَمُجِيبَ دَعْوَتِي وَوَلِيَّ عِصْمَتِي وَمُغْنِيَ فَاقَتِي وَلا تَقْطَعْنِي عَنْكَ ولا تُبْعِدْنِي مِنْكَ يَا نَعيمِي وَجَنَّتِي ويا دُنْيَايَ وَآخِرَتِي يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة المفتقرين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي كَسْرِي لا يَجْبُرُهُ إِلَّا لُطْفُكَ وَحَنَانُكَ وَفَقْرِي لا يُغْنِيهِ إِلَّا عَطْفُكَ وَإحْسَانُكَ وَرَوْعَتِي لا يُسَكِّنُهَا إِلَّا أَمَانُكَ وَذِلَّتِي لا يُعِزُّهَا إِلَّا سُلْطَانُكَ وَأُمْنِيَّتِي لا يُبَلِّغُنِيهَا إِلَّا فَضْلُكَ وَخَلَّتِي لا يَسُدُّها إِلَّا طَوْلُكَ وَحَاجَتِي لا يَقْضِيهَا غَيْرُكَ وَكَرْبِي لا يُفَرِّجُهُ سِوَى رَحْمَتِكَ وَضُرِّي لا يَكْشِفُهُ غَيْرُ رَأْفَتِكَ وَغُلَّتِي لا يُبَرِّدُهَا إِلَّا وَصْلُكَ وَلَوْعَتِي لا يُطْفِيهَا إِلَّا لِقَاؤُكَ وَشَوْقِي إِلَيْكَ لا يَبُلُّهُ إِلَّا النَّظَرُ إِلَى وَجْهِكَ وَقَرَارِي لا يَقِرُّ دُونَ دُنُوِّي مِنْكَ وَلَهْفَتِي لا يَرُدُّهَا إِلَّا رَوْحُكَ وَسُقْمِي لا يَشْفِيهِ إِلَّا طِبُّكَ وَغَمِّي لا يُزِيلُهُ إِلَّا قُرْبُكَ وَجُرْحِي لا يُبْرِئُهُ إِلَّا صَفْحُكَ وَرَيْنُ قَلْبِي لا يَجْلُوهُ إِلَّا عَفْوُكَ وَوَسْوَاسُ صَدْرِي لا يُزِيحُهُ إِلَّا أَمْرُكَ فَيَا مُنْتَهَى أَمَلِ الآمِلِينَ وَيَا غَايَةَ سُؤْلِ السَّائِلِينَ وَيَا أَقْصَى طَلِبَةِ الطَّالِبِينَ ويَا أَعْلَى رَغْبَةِ الرَّاغِبِينَ وَيَا وَلِيَّ الصَّالِحِينَ وَيا أَمَانَ الْخَائِفِينَ وَيَا مُجِيبَ دَعْوَةِ الْمُضْطَرِّينَ وَيَا ذُخْرَ الْمُعْدِمِينَ وَيَا كَنْزَ الْبَائِسِينَ وَيَا غِيَاثَ الْمُسْتَغِيثِينَ وَيَا قَاضِيَ حَوَائِجِ الْفُقَرَاءِ وَالْمَسَاكِينِ وَيَا أَكْرَمَ الأَكْرَمِينَ وَيَا أَرْحَمَ الرَّاحِمِينَ لَكَ تَخَضُّعِي وَسُؤَالِي وَإِلَيْكَ تَضَرُّعِي وَابْتِهَالِي أَسْأَلُكَ أَنْ تُنِيلَنِي مِن رَّوْحِ رِضْوَانِكَ وَتُدِيمَ عَلَيَّ نِعَمَ امْتِنَانِكَ وَهَا أَنَا بِبَابِ كَرَمِكَ وَاقِفٌ وَلِنَفَحَاتِ بِرِّكَ مُتَعَرِّضٌ وَبِحَبْلِكَ الشَّدِيدِ مُعْتَصِمُ وَبِعُرْوَتِك الْوُثْقَى مُتَمَسِّكٌ إِلَهِي ارْحَمْ عَبْدَكَ الذَّلِيلَ ذَا اللِّسَانِ الكَلِيلِ وَالْعَمَلِ الْقَلِيلِ وَامْنُنْ عَلَيْهِ بِطَوْلِكَ الْجَزِيلِ وَاكْنُفْهُ تَحْتَ ظِلِّكَ الظَّلِيلِ يَا كَرِيمُ يَا جَمِيلُ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة المعتصمين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

اَللَّهُمَّ يَا مَلَاذَ اللَّائِذِينَ وَيَا مَعَاذَ الْعَائِذِينَ وَيَا مُنْجِيَ الْهَالِكِينَ وَيَا عَاصِمَ الْبَائِسِينَ وَيَا رَاحِمَ الْمَسَاكِينَ وَيَا مُجِيبَ الْمُضْطَرِّينَ وَيَا كَنْزَ الْمُفْتَقِرِينَ وَيَا جَابِرَ الْمُنْكَسِرِينَ وَيَا مَأْوَى الْمُنْقَطِعِينَ وَيَا نَاصِرَ الْمُسْتَضْعَفِينَ وَيَا مُجِيرَ الْخَائِفِينَ وَيَا مُغِيثَ الْمَكْرُوبِينَ وَيَا حِصْنَ اللَّاجِئِينَ إِن لَّمْ أَعُذْ بِعِزَّتِكَ فَبِمَنْ أَعُوذُ وَإِن لَّمْ أَلُذْ بِقُدْرَتِكَ فَبِمَنْ أَلُوذُ وَقَدْ أَلْجَأَتْنِي الذُّنُوبُ إِلَى التَّشَبُّثِ بِأَذْيَالِ عَفْوِكَ وَأَحْوَجَتْنِي الْخَطَايَا إِلَى اسْتِفْتَاحِ أَبْوَابِ صَفْحِكَ وَدَعَتْنِي الْإِسَاءَةُ إِلَى الْإِنَاخَةِ بِفِنَاءِ عِزِّكَ وَحَمَلَتْنِي الْمَخَافَةُ مِنْ نِقْمَتِكَ عَلَى التَّمَسُّكِ بِعُرْوَةِ عَطْفِكَ وَمَا حَقُّ مَنِ اعْتَصَمَ بِحَبْلِكَ أَن يُّخْذَلَ وَلا يَلِيقُ بِمَنِ اسْتَجَارَ بَعِزِّكَ أَن يُّسْلَمَ أَوْ يُهْمَلَ إِلَهِي فَلَا تُخْلِنَا مِنْ حِمَايَتِكَ وَلا تُعْرِنَا مِن رِّعَايَتِكَ وَذُدْنَا عَن مَّوارِدِ الْهَلَكَةِ فَإِنَّا بِعَيْنِكِ وَفِي كَنَفِكَ وَلَكَ أَسْأَلُكَ بِأَهْلِ خَاصَّتِكَ مِن مَّلائِكَتِكَ وَالصَّالِحِينَ مِنْ بَرِيَّتِكَ أَنْ تَجْعَلَ عَلَيْنَا وَاقِيَةً تُنْجِينَا مِنَ الْهَلَكَاتِ وَتُجَنِّبُنَا مِنَ الآفَاتِ وَتُكِنُّنَا مِنْ دَوَاهِي الْمُصِيبَاتِ وَأَنْ تُنْزِلَ عَلَيْنَا مِنْ سَكِينَتِكَ وَأَنْ تُغَشِّيَ وَجُوهَنَا بِأَنْوارِ مَحَبَّتِكَ وَأَنْ تُؤْوِيَنَا إِلَى شَدِيدِ رُكْنِكَ وَأَنْ تَحْوِيَنَا فِي أَكْنَافِ عِصْمَتِكَ بِرَأْفَتِكَ وَرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة الخائفين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي أَتُرَاكَ بَعْدَ الإِيمَانِ بِكَ تُعَذِّبُنِي أَمْ بَعْدَ حُبِّي إِيَّاكَ تُبْعِّدُنِي أَم مَّعَ رَجَائِي لِرَحْمَتِكَ وَصَفْحِكَ تَحْرِمُنِي أَم مَّعَ اسْتِجَارَتِي بِعَفْوِكَ تُسْلِمُنِي حَاشَا لِوَجْهِكَ الْكَرِيمِ أَنْ تُخَيِّبَنِي لَيْتَ شِعْرِي أَلِلْشَقَاءِ وَلَدَتْنِي أُمِّي أَمْ لِلْعَنَاءِ رَبَّتْنِي فَلَيْتَهَا لَمْ تَلِدْنِي وَلَمْ تُرَبِّنِي وَلَيْتَنِي عَلِمْتُ أَمِنْ أَهْلِ السَّعَادَةِ جَعَلْتَنِي وَبِقُرْبِكَ وَجِوَارِكَ خَصَصْتَنِي فَتَقِرَّ بِذَلِكَ عَيْنِي وَتَطْمَئِنَّ لَهُ نَفْسِي إِلَهِي هَلْ تُسَوِّدُ وَجُوهاً خَرَّتْ سَاجِدَةً لِعَظَمَتِكَ أَوْ تُخْرِسُ أَلْسِنَةً نَّطَقَتْ بِالثَّنَّاءِ عَلَى مَجْدِكَ وَجَلالَتِكَ أَوْ تَطْبَعُ عَلَى قُلُوبٍ انْطَوَتْ عَلَى مَحَبَّتِكَ أَوْ تُصِمُّ أَسْمَاعاً تَلَذَّذَتْ بِسَمَاعِ ذِكْرِكَ فِي إِرَادَتِكَ أَوْ تَغُلُّ أَكُفًّا رَّفَعَتْهَا الآمَالُ إِلَيْكَ رَجاءَ رَأْفَتِكَ أَوْ تُعَاقِبُ أَبْدَاناً عَمِلَتْ بِطاعَتِكَ حَتَّى نَحِلَتْ فِي مُجَاهَدَتِكَ أَوْ تُعَذِّبُ أَرْجُلاً سَعَتْ فِي عِبَادَتِكَ إِلَهِي لا تُغْلِقْ عَلَى مُوَحِّدِيكَ أَبْوَابَ رَحْمَتِكَ وَلا تَحْجُبْ مُشْتَاقِيكَ عَنِ النَّظَرِ إِلَى جَمِيلِ رُؤْيَتِكَ إِلَهِي نَفْسٌ أَعْزَزْتَهَا بِتَوْحِيدِكَ كَيْفَ تُذِلُّها بِمَهَانَةِ هِجْرَانِكَ وَضَمِيرٌ انْعَقَدَ عَلَى مَوَدَّتِكَ كَيْفَ تُحْرِقُهُ بِحَرَارَةِ نِيرَانِكَ إِلَهِي أَجِرْنِي مِنْ أَلِيمِ غَضَبِكَ وَعَظِيمِ سَخَطِكَ يا حَنَّانُ يا مَنَّانُ يا رَحِيمُ يا رَحْمَنُ يَا جَبَّارُ يَا قَهَّارُ يَا غَفَّارُ يَا سَتَّارُ نَجِّنِي بِرَحْمَتِكَ مِنْ عَذَابِ النَّارِ وَفَضِيحَةِ الْعَارِ إذَا امْتازَ الأخْيَارُ مِنَ الأَشْرَارِ وَحالَتِ الأَحْوَالِ وَهَالَتِ الأَهْوَالِ وَقَرُبَ المُحْسِنُونَ وَبَعُدَ المُسِيئُونَ وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لا يُظْلَمُونَ''',
    ),
    Dhikr(
      title: "مناجاة الشاكرين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي أَذْهَلَنِي عَنْ إقَامَةِ شُكْرِكَ تَتَابُعُ طَوْلِكَ وَأَعْجَزَنِي عَنْ إحْصَاءِ ثَنَائِكَ فَيْضُ فَضْلِكَ وَشَغَلَنِي عَنْ ذِكْرِ مَحَامِدِكَ تَرَادُفُ عَوَائِدِكَ وَأَعْيَانِي عَن نَّشْرِ عَوَارِفِكَ تَوَالِي أَيَادِيكَ وَهذا مَقامُ مَنِ اعْتَرَفَ بِسُبُوغِ النَّعْمَاءِ وَقَابَلَهَا بِالتَّقْصِيرِ وَشَهِدَ عَلَى نَفْسِهِ بِالإِهْمَالِ وَالتَّضْيِيعِ وَأنْتَ الرَّؤُوفُ الرَّحِيمُ الْبَرُّ الْكَرِيمُ الَّذِي لا يُخَيِّبُ قَاصِدِيهِ وَلا يَطْرُدُ عَنْ فِنَائِهِ آمِلِيهِ بِسَاحَتِكَ تَحُطُّ رِحَالُ الرَّاجِينَ وَبِعَرْصَتِكَ تَقِفُ آمَالُ الْمُسْتَرْفِدِينَ فَلا تُقَابِلْ آمَالَنَا بِالتَّخْيِيبِ وَالإِيئَاسِ ولا تُلْبِسْنا سِرْبَالَ الْقُنُوطِ وَالإبْلاسِ إِلَهِي تَصَاغَرَ عِنْدَ تَعَاظُمِ آلائِكَ شُكْرِي وَتَضَاءَلَ فِي جَنْبِ إكْرَامِكَ إيَّايَ ثَنَائِي وَنَشْرِي جَلَّلَتْنِي نِعَمُكَ مِنْ أَنْوَارِ الإِيمَانِ حُلَلاً وَضَرَبَتْ عَلَيَّ لَطَائِفُ بِرِّكَ مِنَ الْعِزِّ كِلَلاً وَقَلَّدَتْنِي مِنَنُكَ قَلائِدَ لاتُحَلُّ وَطَوَّقَتْنِي أَطْوَاقاً لا تُفَلُّ فَآلاؤُكَ جَمَّةٌ ضَعُفَ لِسَانِي عَنْ إحْصَائِهَا وَنَعْمَاؤُكَ كَثِيرةٌ قَصُرَ فَهْمِي عَنْ إدْرَاكِهَا فَضْلاً عَنِ اسْتِقْصَائِهَا فَكَيْفَ لِي بِتَحْصِيلِ الشُّكْرِ وَشُكْرِي إِيَّاكَ يَفْتَقِرُ إِلَى شُكْرٍ فَكُلَّما قُلْتُ لَكَ الحَمْدُ وَجَبَ عَلَيَّ لِذَلِكَ أَنْ أَقُولَ لَكَ الحَمْدُ إِلَهِي فَكَمَا غَذَّيْتَنَا بِلُطْفِكَ وَرَبَّيْتَنَا بِصُنْعِكَ فَتَمِّمْ عَلَيْنَا سَوَابِغَ النِّعَمِ وَادْفَعْ عَنَّا مَكَارِهَ النِّقَمِ وَآتِنَا مِنْ حُظُوظِ الدَّارَيْنِ أَرْفَعَهَا وَأَجَلَّهَا عَاجِلاً وَآجِلاً وَلَكَ الحَمْدُ عَلَى حُسْنِ بَلائِكَ وَسُبُوغِ نَعْمَائِكَ حَمْداً يُّوافِقُ رِضَاكَ وَيَمْتَرِي الْعَظِيمَ مِنْ بِرِّكَ وَنَدَاكَ يَا عَظِيمُ يَا كَرِيمُ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة المحبين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي مَنْ ذَا الَّذِي ذَاقَ حَلاوَةَ مَحَبَّتِكَ فَرَامَ مِنْكَ بَدَلاً وَمَنْ ذَا الَّذِي أَنِسَ بِقُرْبِكَ فَابْتَغى عَنْكَ حِوَلاً إِلَهِي فَاجْعَلْنَا مِمَّنِ اصْطْفَيْتَهُ لِقُرْبِكَ وَوِلايَتِكَ وَأَخْلَصْتَهُ لِوُدِّكَ وَمَحَبَّتِكَ وَشَوَّقْتَهُ إِلَى لِقائِكَ وَرَضَّيْتَهُ بِقَضَائِكَ وَمَنَحْتَهُ بِالنَّظَرِ إِلَى وَجْهِكَ وَحَبَوْتَهُ بِرِضَاكَ وَأَعَذْتَهُ مِنْ هَجْرِكَ وَقِلاكَ وَبَوَّأْتَهُ مَقْعَدَ الصِّدْقِ فِي جِوارِكَ وَخَصَصْتَهُ بِمَعْرِفَتِكَ وأَهَّلْتَهُ لِعِبَادَتِكَ وَهَيَّمْتَ قَلْبَهُ لِإِرَادَتِكَ وَاجْتَبَيْتَهُ لِمُشَاهَدَتِكَ وَأَخْلَيْتَ وَجْهَهُ لَكَ وَفَرَّغْتَ فُؤَادَهُ لِحُبِّكَ وَرَغَّبْتَهُ فِيمَا عِنْدَكَ وَأَلْهَمْتَهُ ذِكْرَكَ وَأَوْزَعْتَهُ شُكْرَكَ وَشَغَلْتَهُ بِطَاعَتِكَ وَصَيَّرْتَهُ مِنْ صَالِحِي بَرِيَّتِكَ وَاخْتَرْتَهُ لِمُنَاجَاتِكَ وَقَطَعْتَ عَنْهُ كُلَّ شَيْءٍ يَقْطَعُهُ عَنْكَ اَللَّهُمَّ اجْعَلْنَا مِمَّنْ دَأْبُهُمُ الِارْتِيَاحُ إِلَيْكَ وَالْحَنِينُ وَدَهْرُهُمُ الزَّفْرَةُ وَالأَنِينُ جِبَاهُهُمْ سَاجِدَةٌ لِعَظَمَتِكَ وَعُيُونُهُمْ سَاهِرَةٌ فِي خِدْمَتِكَ وَدُمُوعُهُمْ سَائِلَةٌ مِّنْ خَشْيَتِكَ وَقُلُوبُهُمْ مُتَعَلِّقَةٌ بِمَحَبَّتِكَ وَأَفْئِدَتُهُمْ مُنْخَلِعَةٌ مِّن مَّهَابَتِكَ يَا مَنْ أَنْوَارُ قُدْسِهِ لِأَبْصَارِ مُحِبِّيهِ رَائِقَةٌ وَسُبُحَاتُ وَجْهِهِ لِقُلُوبِ عَارِفِيهِ شَائِقَةٌ يَا مُنَى قُلُوبِ الْمُشْتَاقِينَ وَيَا غايَةَ آمَالِ الْمُحِبِّينَ أَسْأَلُكَ حُبَّكَ وَحُبَّ مَن يُّحِبُّكَ وَحُبَّ كُلِّ عَمَلٍ يُوصِلُنِي إِلَى قُرْبِكَ وَأَنْ تَجْعَلَكَ أَحَبَّ إِلَيَّ مِمَّا سِوَاكَ وَأَنْ تَجْعَلَ حُبِّي إِيَّاكَ قَائِداً إِلَى رِضْوَانِكَ وَشَوْقِي إِلَيْكَ ذَائِداً عَنْ عِصْيَانِكَ وَامْنُنُ بِالنَّظَرِ إِلَى وَجْهِكَ عَلَيَّ وَانْظُرْ بِعَيْنِ الْوُدِّ وَالْعَطْفِ إِليَّ وَلا تَصْرِفْ عَنِّي وَجْهَكَ وَاجْعَلْنِي مِنْ أَهْلِ الإسْعَادِ وَالْحُظْوَةِ عِنْدَكَ يا مُجِيبُ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة العارفين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي قَصُرَتِ الأَلْسُنُ عَنْ بُلُوغِ ثَنَائِكَ كَمَا يَلِيقُ بِجَلالِكَ وَعَجَزَتِ الْعُقُولُ عَنْ إدْرَاكِ كُنْهِ جَمَالِكَ وَانْحَسَرَتِ الأَبْصَارُ دُونَ النَّظَرِ إِلَى سُبُحَاتِ وَجْهِكَ وَلَمْ تَجْعَل لِّلْخَلْقِ طَرِيقاً إِلَى مَعْرِفَتِكَ إِلَّا بِالْعَجْزِ عَن مَّعْرِفَتِكَ إِلَهِي فَاجْعَلْنَا مِنَ الَّذِينَ تَرَسَّخَتْ أَشْجَارُ الشَّوْقِ إِلَيْكَ فِي حَدَائِقِ صُدُورِهِمْ وَأَخَذَتْ لَوْعَةُ مَحَبَّتِكَ بِمَجَامِعِ قُلُوبِهِمْ فَهُمْ إِلَى أَوْكَارِ الأَفْكَارِ يَأْوُونَ وَفِي رِيَاضِ الْقُرْبِ وَالْمُكاشَفَةِ يَرْتَعُونَ وَمِنْ حِيَاضِ الْمَحَبَّةِ بِكَأْسِ الْمُلاطَفَةِ يَكْرَعُونَ وَشَرَائِعَ الْمُصَافَاتِ يَرِدُونَ قَدْ كُشِفَ الْغِطَاءُ عَنْ أَبْصَارِهِمْ وَانْجَلَتْ ظُلْمَةُ الرَّيْبِ عَنْ عَقَائِدِهِمْ وَضَمَائِرِهِمْ وَانْتَفَتْ مُخَالَجَةُ الشَّكِّ عَنْ قُلُوبِهِمْ وَسَرَائِرِهِمْ وَانْشَرَحَتْ بِتَحْقِيقِ الْمَعْرِفَةِ صُدُورُهُمْ وَعَلَتْ لِسَبْقِ السَّعَادَةِ فِي الزَّهَادَةِ هِمَمُهُمْ وَعَذُبَ فِي مَعِينِ الْمُعَامَلَةِ شِرْبُهُمْ وَطَابَ فِي مَجْلِسِ الأُنْسِ سِرُّهُمْ وَأَمِنَ فِي مَوْطِنِ الْمَخَافَةِ سِرْبُهُمْ وَاطْمَأَنَّتْ بِالرُّجُوعِ إِلَى رَبِّ الأَرْبَابِ أَنْفُسُهُمْ وَتَيَقَّنَتْ بِالْفَوْزِ وَالْفَلاحِ أَرْوَاحُهُمْ وَقَرَّتْ بِالنَّظَرِ إِلَى مَحْبُوبِهْم أَعْيُنُهُمْ وَاسْتَقَرَّ بِإِدْرَاكِ السُّؤْلِ وَنَيْلِ الْمَأْمُولِ قَرَارُهُمْ وَرَبِحَتْ فِي بَيْعِ الدُّنْيَا بِالآخِرَةِ تِجَارَتُهُمْ إِلَهِي مَا أَلَذَّ خَوَاطِرَ الإِلْهَامِ بِذِكْرِكَ عَلَى الْقُلُوبِ وَمَا أَحْلَى الْمَسِيرَ إِلَيْكَ بِالأَوْهَامِ فِي مَسَالِكِ الْغُيُوبِ وَمَا أَطْيَبَ طَعْمَ حُبِّكَ وَمَا أَعْذَبَ شِرْبَ قُرْبِكَ فَأعِذْنَا مِنْ طَرْدِكَ وَإبْعَادِكَ وَاجْعَلْنَا مِنْ أَخَصِّ عَارِفِيكَ وَأَصْلَحِ عِبَادِكَ وَأَصْدَقِ طَائِعِيكَ وَأَخْلَصِ عُبَّاِدِكَ يَا عَظِيمُ يَا جَلِيلُ يَا كَرِيمُ يَا مُنِيلُ بِرَحْمَتِكَ وَمَنِّكَ يَا أَرْحَمَ الرَّاحِمِينَ''',
    ),
    Dhikr(
      title: "مناجاة الزاهدين",
      benefits:
          "من المناجاة الخمس عشرة، للإمام زين العابدين (ع).",
      text: '''بسم الله الرحمن الرحيم

إِلَهِي أَسْكَنْتَنَا دَاراً حَفَرَتْ لَنَا حُفَرَ مَكْرِهَا وَعَلَّقَتْنَا بِأَيْدِي الْمَنَايَا فِي حَبَائِل غَدْرِهَا فَإِلَيْكَ نَلْتَجِئُ مِن مَّكَائِدِ خُدَعِهَا وَبِكَ نَعْتَصِمُ مِنَ الِاغْتِرَارِ بِزَخَارِفِ زِينَتِهَا فَإِنَّهَا الْمُهْلِكَةُ طُلَّابَهَا المُتْلِفَةُ حُلَّالَهَا الْمَحْشُوَّةُ بِالآفَاتِ الْمَشْحُونَةُ بِالنَّكَبَاتِ إِلَهِي فَزَهِّدْنَا فِيهَا وَسَلِّمْنَا مِنْهَا بِتَوْفِيقِكَ وَعِصْمَتِكَ وَانْزَعْ عَنَّا جَلابِيبَ مُخَالَفَتِكَ وَتَوَلَّ أُمُورَنَا بِحُسْنِ كِفَايَتِكَ وَأَوْفِرْ مَزِيدَنَا مِنْ سَعَةِ رَحْمَتِكَ وَأَجْمِلْ صِلاتِنَا مِنْ فَيْضِ مَوَاهِبِكَ وَاغْرِسْ فِي أَفْئِدَتِنَا أَشْجَارَ مَحَبَّتِكَ وَأَتْمِمْ لَنَا أَنْوَارَ مَعْرِفَتِكَ وَأَذِقْنَا حَلاوَةَ عَفْوِكَ وَلَذَّةَ مَغْفِرَتِكَ وَأَقْرِرْ أَعْيُنَنَا يَوْمَ لِقَائِكَ بِرُؤْيَتِكَ وَأَخْرِجْ حُبَّ الدُّنْيَا مِنْ قُلُوبِنَا كَمَا فَعَلْتَ بِالصَّالِحِينَ مِنْ صَفْوَتِكَ وَالأَبْرَارِ مِنْ خاصَّتِكَ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ وَيَا أَكْرَمَ الأَكْرَمِينَ''',
    ),
  ];

  static final List<Dhikr> tasbihat = [
    Dhikr(
      title: "تسبيح يوم السبت",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

سُبْحَانَ الْإِلَهِ الْحَقِّ سُبْحَانَ الْقَابِضِ الْبَاسِطِ سُبْحَانَ الضَّارِّ النَّافِعِ سُبْحَانَ الْقَاضِي بِالْحَقِّ سُبْحَانَهُ وَ بِحَمْدِهِ سُبْحَانَ الْعَلِيِّ الْأَعْلَى سُبْحَانَ مَنْ عَلَا فِي الْهَوَاءِ سُبْحَانَهُ وَ تَعَالَى سُبْحَانَ الْحَسَنِ الْجَمِيلِ سُبْحَانَ الرَّءُوفِ الرَّحِيمِ سُبْحَانَ الْخَالِقِ الْبَارِئِ سُبْحَانَ الْغَنِيِّ الْحَمِيدِ سُبْحَانَ الرَّفِيعِ الْأَعْلَى سُبْحَانَ الْعَظِيمِ الْأَعْظَمِ سُبْحَانَ مَنْ هُوَ هَكَذَا وَ لَا يَكُونُ هَكَذَا غَيْرُهُ سُبُّوحٌ قُدُّوسُ لِرَبِّي الْحَيِّ الْحَلِيمِ سُبْحَانَ اللَّهِ الْعَظِيمِ وَ بِحَمْدِهِ سُبْحَانَ مَنْ هُوَ دَائِمٌ لَا يَسْهُو سُبْحَانَ مَنْ هُوَ قَائِمٌ لَا يَلْهُو سُبْحَانَ مَنْ هُوَ غَنِيٌّ لَا يَفْتَقِرُ سُبْحَانَ مَنْ تَوَاضَعَ كُلُّ شَيْءٍ لِعَظَمَتِهِ سُبْحَانَ مَنْ ذَلَّ كُلُّ شَيْءٍ لِعِزَّتِهِ سُبْحَانَ مَنْ اسْتَسْلَمَ كُلُّ شَيْءٍ لِقُدْرَتِهِ سُبْحَانَ مَنْ خَضَعَ كُلُّ شَيْءٍ لِمُلْكِهِ سُبْحَانَ مَنِ انْقَادَتْ لَهُ الْأُمُورُ بِأَزِمَّتِهَا''',
    ),
    Dhikr(
      title: "تسبيح يوم الأحد",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

سُبْحَانَ مَنْ مَلَأَ الدَّهْرَ قُدْسُهُ سُبْحَانَ مَنْ يَغْشَى الْأَبَدَ نُورُهُ سُبْحَانَ مَنْ أَشْرَقَ كُلَّ شَيْءٍ ضَوْؤُهُ سُبْحَانَ مَنْ يُدَانُ بِدِينِهِ كُلُّ دِينٍ وَ لَا يُدَانُ بِغَيْرِ دِينِهِ سُبْحَانَ مَنْ قَدَرَ بِقُدْرَتِهِ كُلَّ قَدَرٍ وَ لَا يَقْدِرُ أَحَدٌ قَدْرَهُ سُبْحَانَ مَنْ لَا يُوصَفُ عِلْمُهُ سُبْحَانَ مَنْ لَا يَعْتَدِي عَلَى أَهْلِ مَمْلَكَتِهِ سُبْحَانَ مَنْ لَا يَأْخُذُ أَهْلَ الْأَرْضِ بِأَلْوَانِ الْعَذَابِ سُبْحَانَ الرَّءُوفِ الرَّحِيمِ سُبْحَانَ مَنْ هُوَ مُطَّلِعٌ عَلَى خَزَائِنِ الْقُلُوبِ سُبْحَانَ مَنْ يُحْصِي عَدَدَ الذُّنُوبِ سُبْحَانَ مَنْ لَا تَخْفَى عَلَيْهِ خَافِيَةٌ فِي الْأَرْضِ وَ لَا فِي السَّمَاءِ سُبْحَانَ رَبِّيَ الْوَدُودِ سُبْحَانَ الْفَرْدِ الْوَتْرِ سُبْحَانَ الْعَظِيمِ الْأَعْظَمِ''',
    ),
    Dhikr(
      title: "تسبيح يوم الاثنين",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

سُبْحَانَ الْحَنَّانِ الْمَنَّانِ الْجَوَادِ سُبْحَانَ الْكَرِيمِ الْأَكْرَمِ سُبْحَانَ الْبَصِيرِ الْعَلِيمِ سُبْحَانَ السَّمِيعِ الْوَاسِعِ سُبْحَانَ اللَّهِ عَلَى إِقْبَالِ النَّهَارِ وَ إِقْبَالِ اللَّيْلِ سُبْحَانَ اللَّهِ عَلَى إِدْبَارِ النَّهَارِ وَ إِدْبَارِ اللَّيْلِ لَا إِلَهَ إِلَّا اللَّهُ فِي آنَاءِ اللَّيْلِ وَ آنَاءِ النَّهَارِ وَ لَهُ الْحَمْدُ وَ الْمَجْدُ وَ الْعَظَمَةُ وَ الْكِبْرِيَاءُ مَعَ كُلِّ نَفَسٍ وَ كُلِّ طَرْفَةٍ وَ كُلِّ لَمْحَةٍ سَبَقَتْ فِي عِلْمِهِ سُبْحَانَكَ عَدَدَ ذَلِكَ سُبْحَانَكَ زِنَةَ ذَلِكَ وَ مَا أَحْصَى كِتَابُكَ سُبْحَانَكَ زِنَةَ عَرْشِكَ سُبْحَانَ رَبِّنَا ذِي الْجَلالِ وَ الْإِكْرامِ سُبْحَانَ رَبِّنَا تَسْبِيحاً كَمَا يَنْبَغِي لِكَرَمِ وَجْهِهِ وَ عِزِّ جَلَالِهِ سُبْحَانَ رَبِّنَا تَسْبِيحاً مُقَدَّساً مُزَكًّى كَذَلِكَ فَعَلَ رَبُّنَا سُبْحَانَ الْحَيِّ الْحَلِيمِ سُبْحَانَ الَّذِي كَتَبَ عَلى نَفْسِهِ الرَّحْمَةَ سُبْحَانَ الَّذِي خَلَقَ آدَمَ وَ أَخْرَجَنَا مِنْ صُلْبِهِ سُبْحَانَ الَّذِي يُحْيِي الْأَمْوَاتَ وَ يُمِيتُ الْأَحْيَاءَ سُبْحَانَ مَنْ هُوَ رَحِيمٌ لَا يَعْجَلُ سُبْحَانَ مَنْ هُوَ رَقِيبٌ لَا يَغْفُلُ سُبْحَانَ مَنْ هُوَ جَوَادٌ لَا يَبْخَلُ سُبْحَانَ مَنْ هُوَ حَلِيمٌ لَا يَجْهَلُ سُبْحَانَ مَنْ جَلَّ ثَنَاؤُهُ وَ لَهُ الْمِدْحَةُ الْبَالِغَةُ فِي جَمِيعِ مَا يُثْنَى عَلَيْهِ مِنَ الْمَجْدِ سُبْحَانَ اللَّهِ الْحَلِيمِ وَ صَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَ آلِهِ الطَّاهِرِينَ''',
    ),
    Dhikr(
      title: "تسبيح يوم الثلاثاء",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

سُبْحَانَ مَنْ هُوَ فِي عُلُوِّهِ دَانٍ سُبْحَانَ مَنْ هُوَ فِي دُنُوِّهِ عَالٍ سُبْحَانَ مَنْ هُوَ فِي إِشْرَاقِهِ مُنِيرٌ سُبْحَانَ مَنْ هُوَ فِي سُلْطَانِهِ قَوِيٌّ سُبْحَانَ الْحَلِيمِ الْجَمِيلِ سُبْحَانَ الْغَنِيِّ الْحَمِيدِ سُبْحَانَ الْوَاسِعِ الْعَلِيِّ سُبْحَانَ مَنْ يَكْشِفُ الضُّرَّ وَ هُوَ الدَّائِمُ الصَّمَدُ الْفَرْدُ الْقَدِيمُ سُبْحَانَ مَنْ عَلَا فِي الْهَوَاءِ سُبْحَانَ الْحَيِّ الرَّفِيعِ سُبْحَانَ الْحَيِّ الْقَيُّومِ سُبْحَانَ الدَّائِمِ الْبَاقِي الَّذِي لَا يَزُولُ سُبْحَانَ الَّذِي لَا يَنْقُصُ خَزَائِنُهُ سُبْحَانَ مَنْ لَا يَنْفَدُ مَا عِنْدَهُ سُبْحَانَ مَنْ لَا تَبِيدُ مَعَالِمُهُ سُبْحَانَ مَنْ لَا يُشَاوِرُ فِي أَمْرِهِ أَحَداً سُبْحَانَ مَنْ لَا إِلَهَ غَيْرُهُ سُبْحَانَ اللَّهِ الْعَلِيِّ الْعَظِيمِ سُبْحَانَ اللَّهِ وَ بِحَمْدِهِ سُبْحَانَ ذِي الْعِزِّ الشَّامِخِ الْمُبِينِ سُبْحَانَ ذِي الْجَلَالِ الْفَاخِرِ الْقَدِيمِ سُبْحَانَ مَنْ هُوَ فِي عُلُوِّهِ دَانٍ وَ فِي دُنُوِّهِ عَالٍ وَ فِي إِشْرَاقِهِ مُنِيرٌ وَ فِي سُلْطَانِهِ قَوِيٌّ وَ فِي مُلْكِهِ دَائِمٌ وَ صَلَّى اللَّهُ عَلَى رَسُولِهِ سَيِّدِنَا مُحَمَّدٍ نَبِيِّهِ وَ أَهْلِ بَيْتِهِ الطَّاهِرِينَ''',
    ),
    Dhikr(
      title: "تسبيح يوم الأربعاء",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

سُبْحَانَ مَنْ تُسَبِّحُ لَهُ الْأَنْعَامُ بِأَصْوَاتِهَا يَقُولُونَ سُبُّوحاً قُدُّوساً سُبْحَانَ الْمَلِكِ الْحَقِّ الْمُبِينِ سُبْحَانَ مَنْ تُسَبِّحُ لَهُ الْبِحَارُ بِأَمْوَاجِهَا سُبْحَانَكَ رَبَّنَا وَ بِحَمْدِكَ سُبْحَانَ مَنْ تُسَبِّحُ لَهُ مَلَائِكَةُ السَّمَاوَاتِ بِأَصْوَاتِهَا سُبْحَانَ اللَّهِ الْمَحْمُودِ فِي كُلِّ مَقَالَةٍ سُبْحَانَ اللَّهِ الَّذِي يُسَبِّحُ لَهُ الْكُرْسِيُّ وَ مَا حَوْلَهُ وَ مَا تَحْتَهُ سُبْحَانَ الْمَلِكِ الْجَبَّارِ الَّذِي مَلَأَ كُرْسِيُّهُ السَّمَاوَاتِ السَّبْعَ وَ الْأَرَضِينَ السَّبْعَ سُبْحَانَ اللَّهِ بِعَدَدِ مَا سَبَّحَهُ الْمُسَبِّحُونَ وَ الْحَمْدُ لِلَّهِ بِعَدَدِ مَا حَمِدَهُ الْحَامِدُونَ وَ لَا إِلَهَ إِلَّا اللَّهُ بِعَدَدِ مَا هَلَّلَهُ الْمُهَلِّلُونَ وَ اللَّهُ أَكْبَرُ بِعَدَدِ مَا كَبَّرَهُ الْمُكَبِّرُونَ وَ أَسْتَغْفِرُ اللَّهَ بِعَدَدِ مَا اسْتَغْفَرَهُ الْمُسْتَغْفِرُونَ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ بِعَدَدِ مَا قَالَهُ الْقَائِلُونَ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ بِعَدَدِ مَا صَلَّى عَلَيْهِ الْمُصَلُّونَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ تُسَبِّحُ لَكَ الدَّوَابُّ فِي مَرَاعِيهَا وَ الْوُحُوشُ فِي مَظَانِّهَا وَ السِّبَاعُ فِي فَلَوَاتِهَا وَ الطَّيْرُ فِي وُكُورِهَا سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ تُسَبِّحُ لَكَ الْبِحَارُ بِأَمْوَاجِهَا وَ الْحِيتَانُ فِي مِيَاهِهَا وَ الْمِيَاهُ عَلَى مَجَارِيهَا وَ الْهَوَامُّ فِي أَمَاكِنِهَا سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ الْجَوَادُ الَّذِي لَا يَبْخَلُ الْغَنِيُّ الَّذِي لَا يُعْدِمُ الْجَدِيدُ الَّذِي لَا يَبْلَى الْحَمْدُ لِلَّهِ الْبَاقِي الَّذِي تَسَرْبَلَ بِالْبَقَاءِ الدَّائِمُ الَّذِي لَا يَفْنَى الْعَزِيزُ الَّذِي لَا يَذِلُّ الْمَلِكُ الَّذِي لَا يَزُولُ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ الْقَائِمُ الَّذِي لَا يَفْنَى الدَّائِمُ الَّذِي لَا يَبِيدُ الْعَلِيمُ الَّذِي لَا يَرْتَابُ الْبَصِيرُ الَّذِي لَا يَضِلُّ الْحَلِيمُ الَّذِي لَا يَجْهَلُ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ الْحَكِيمُ الَّذِي لَا يَحِيفُ الرَّقِيبُ الَّذِي لَا يَسْهُو الْمُحِيطُ الَّذِي لَا يَلْهُو الشَّاهِدُ الَّذِي لَا يَغِيبُ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ الْقَوِيُّ الَّذِي لَا يُرَامُ الْعَزِيزُ الَّذِي لَا يُضَامُ السُّلْطَانُ الَّذِي لَا يُغْلَبُ الْمُدْرِكُ الَّذِي لَا يُدْرَكُ الطَّالِبُ الَّذِي لَا يَعْجِزُ''',
    ),
    Dhikr(
      title: "تسبيح يوم الخميس",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ الْوَاسِعُ الَّذِي لَا يَضِيقُ الْبَصِيرُ الَّذِي لَا يَضِلُّ النُّورُ الَّذِي لَا يُخْمَدُ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ الْقَيُّومُ الَّذِي لَا يَهِنُ الصَّمَدُ الَّذِي لَا يُطْعَمُ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ مَا أَعْظَمَ شَأْنَكَ وَ أَعَزَّ سُلْطَانَكَ وَ أَعْلَى مَكَانَكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ مَا أَبَرَّكَ وَ أَرْحَمَكَ وَ أَحْلَمَكَ وَ أَعْظَمَكَ وَ أَسْمَحَكَ وَ أَجَلَّكَ وَ أَكْرَمَكَ وَ أَعْلَمَكَ وَ أَعَزَّكَ وَ أَعْلَاكَ وَ أَقْوَاكَ وَ أَسْمَعَكَ وَ أَبْصَرَكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ مَا أَكْرَمَ عَفْوَكَ وَ أَعْظَمَ تَجَاوُزَكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ مَا أَوْسَعَ رَحْمَتَكَ وَ أَكْثَرَ فَضْلَكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ مَا أَنْعَمَ آلَاءَكَ وَ أَسْبَغَ نَعْمَاءَكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ مَا أَفْضَلَ ثَوَابَكَ وَ أَجْزَلَ عَطَاءَكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ مَا أَوْسَعَ حُجَّتَكَ وَ أَوْضَحَ بُرْهَانَكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ مَا أَشَدَّ أَخْذَكَ وَ أَوْجَعَ عِقَابَكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ مَا أَشَدَّ مَكْرَكَ وَ أَمْتَنَ كَيْدَكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ تُسَبِّحُ لَكَ السَّمَاوَاتُ السَّبْعُ وَ الْأَرَضُونَ السَّبْعُ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ الْقَرِيبُ فِي عُلُوِّكَ الْمُتَعَالِي فِي دُنُوِّكَ الْمُتَدَانِي دُونَ كُلِّ شَيْءٍ مِنْ خَلْقِكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ الْقَرِيبُ قَبْلَ كُلِّ شَيْءٍ وَ الدَّائِمُ مَعَ كُلِّ شَيْءٍ وَ الْبَاقِي بَعْدَ فَنَاءِ كُلِّ شَيْءٍ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ تَصَاغَرَ كُلُّ شَيْءٍ لِجَبَرُوتِكَ وَ انْقَادَ كُلُّ شَيْءٍ لِسُلْطَانِكَ وَ ذَلَّ كُلُّ شَيْءٍ لِعِزَّتِكَ وَ خَضَعَ كُلُّ شَيْءٍ لِمُلْكِكَ وَ اسْتَسْلَمَ كُلُّ شَيْءٍ لِقُدْرَتِكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ مَلَكْتَ الْمُلُوكَ بِعَظَمَتِكَ وَ قَهَرْتَ الْجَبَابِرَةَ بِقُدْرَتِكَ وَ ذَلَّلْتَ الْعُظَمَاءَ بِعِزَّتِكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ تَسْبِيحاً يَفْضُلُ عَلَى تَسْبِيحِ الْمُسَبِّحِينَ كُلِّهِمْ مِنْ أَوَّلِ الدَّهْرِ إِلَى آخِرِهِ وَ مِلْءَ السَّمَاوَاتِ وَ الْأَرَضِينَ وَ مِلْءَ مَا خَلَقْتَ وَ مِلْءَ مَا قَدَّرْتَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ تُسَبِّحُ لَكَ السَّمَاوَاتُ بِأَقْطَارِهَا وَ الشَّمْسُ فِي مَجَارِيهَا وَ الْقَمَرُ فِي مَنَازِلِهِ وَ النُّجُومُ فِي سَيَرَانِهَا وَ الْفَلَكُ فِي مَعَارِجِهِ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ يُسَبِّحُ لَكَ النَّهَارُ بِضَوْئِهِ وَ اللَّيْلُ بِدُجَائِهِ وَ النُّورُ بِشُعَاعِهِ وَ الظُّلْمَةُ بِغُمُوضِهَا سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ تُسَبِّحُ لَكَ الرِّيَاحُ فِي مَهَبِّهَا وَ السَّحَابُ بِأَمْطَارِهَا وَ الْبَرْقُ بِأَخْطَافِهِ وَ الرَّعْدُ بِأَرْزَامِهِ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ تُسَبِّحُ لَكَ الْأَرْضُ بِأَقْوَاتِهَا وَ الْجِبَالُ بِأَطْوَادِهَا وَ الْأَشْجَارُ بِأَوْرَاقِهَا وَ الْمَرَاعِي فِي مَنَابِتِهَا سُبْحَانَكَ وَ بِحَمْدِكَ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ عَدَدَ مَا سَبَّحَكَ مِنْ شَيْءٍ وَ كَمَا تُحِبُّ يَا رَبِّ أَنْ تُحْمَدَ وَ كَمَا يَنْبَغِي لِعَظَمَتِكَ وَ كِبْرِيَائِكَ وَ عِزَّتِكَ وَ قُوَّتِكَ وَ قُدْرَتِكَ وَ صَلَّى اللَّهُ عَلَى رَسُولِهِ مُحَمَّدٍ خَاتَمِ النَّبِيِّينَ وَ آلِهِ أَجْمَعِينَ''',
    ),
    Dhikr(
      title: "تسبيح يوم الجمعة",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

سُبْحَانَ مَنْ لَبِسَ الْعِزَّ وَ فَازَ بِهِ سُبْحَانَ مَنْ تَعَطَّفَ بِالْمَجْدِ وَ تَكَرَّمَ بِهِ سُبْحَانَ مَنْ لَا يَنْبَغِي التَّسْبِيحُ إِلَّا لَهُ سُبْحَانَ مَنْ أَحْصَى كُلَّ شَيْءٍ بِعِلْمِهِ سُبْحَانَ ذِي الطَّوْلِ وَ الْفَضْلِ سُبْحَانَ ذِي الْمَنِّ وَ النِّعَمِ سُبْحَانَ ذِي الْقُدْرَةِ وَ الْكَرَمِ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِمَعَاقِدِ الْعِزِّ مِنْ عَرْشِكَ وَ مُنْتَهَى الرَّحْمَةِ مِنْ كِتَابِكَ وَ بِاسْمِكَ الْأَعْظَمِ وَ ذِكْرِكَ الْأَعْلَى وَ بِكَلِمَاتِكَ التَّامَّةِ وَ تَمَّتْ كَلِمَاتُكَ صِدْقاً وَ عَدْلًا لَا مُبَدِّلَ لِكَلِمَاتِكَ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ يَا ذَا الْجَلَالِ وَ الْإِكْرَامِ أَسْأَلُكَ بِمَا لَا يَعْدِلُهُ شَيْءٌ مِنْ مَسَائِلِكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ تَجْعَلَ لِي مِنْ أَمْرِي فَرَجاً وَ مَخْرَجاً وَ أَنْ تُوَسِّعَ عَلَيَّ رِزْقِي فِي يُسْرٍ مِنْكَ وَ عَافِيَةٍ سُبْحَانَ الْحَيِّ الْحَلِيمِ سُبْحَانَ الْحَكِيمِ الْكَرِيمِ سُبْحَانَ الْبَاعِثِ الْوَارِثِ سُبْحَانَ الْعَلِيِّ الْعَظِيمِ سُبْحَانَهُ وَ بِحَمْدِهِ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ وَ بَارَكْتَ عَلَى إِبْرَاهِيمَ وَ آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ''',
    ),
    Dhikr(
      title: "تسبيح الزهراء (عليها السلام)",
      benefits:
          "من أعظم التعقيبات بعد الصلاة المكتوبة، يطرد الشيطان ويرضي الرحمن ويوجب مغفرة الذنوب.",
      text: """اللهُ أَكْبَر (٣٤ مرة)
الْحَمْدُ لِلَّه (٣٣ مرة)
سُبْحَانَ اللَّه (٣٣ مرة)""",
    ),
    Dhikr(
      title: "التسبيحات الأربعة المباركة",
      benefits:
          "تعدل غرس شجرة في الجنة بكل تسبيحة، وتُقرأ في الركعتين الثالثة والرابعة من الصلاة.",
      text:
          """سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ""",
    ),
    Dhikr(
      title: "تسبيح نبي الله يونس (ع) - الذكر اليونسي",
      benefits: "نجاة من الغم والهموم الشديدة وقضاء الحاجات المتعسرة.",
      text:
          """لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ""",
    ),
    Dhikr(
      title: "تسبيح جبرائيل (عليه السلام)",
      benefits:
          "تسبيح عظيم مأثور عن النبي (ص) مروياً عن جبرائيل (ع)، لقضاء الحوائج وسعة الرزق.",
      text: """سُبْحَانَ الدَّائِمِ الْقَائِمِ،
سُبْحَانَ الْقَائِمِ الدَّائِمِ،
سُبْحَانَ الْوَاحِدِ الْأَحَدِ،
سُبْحَانَ الْفَرْدِ الصَّمَدِ،
سُبْحَانَ الْحَيِّ الْقَيُّومِ،
سُبْحَانَ اللهِ وَبِحَمْدِهِ،
سُبْحَانَ الْحَيِّ الَّذِي لَا يَمُوتُ.""",
    ),
    Dhikr(
      title: "الاستغفار السبعين",
      benefits:
          "مأثور عن أمير المؤمنين (ع)، يُقرأ 70 مرة للتوبة ومغفرة الذنوب وهو من أعظم الأذكار المعتبرة.",
      text: """أَسْتَغْفِرُ اللَّهَ رَبِّي وَأَتُوبُ إِلَيْهِ
(يُكرر 70 مرة)""",
    ),
    Dhikr(
      title: "تسبيح ما بعد صلاة الصبح",
      benefits:
          "من التعقيبات المستحبة بعد صلاة الفجر، لحفظ النفس في اليوم وبركة الوقت والرزق.",
      text:
          """لا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ وَيُمِيتُ وَيُحْيِي، وَهُوَ حَيٌّ لا يَمُوتُ، بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.
(يُكرر 10 مرات)""",
    ),
    Dhikr(
      title: "تسبيح ليلة الجمعة",
      benefits:
          "تُقرأ ليلة الجمعة بعد صلاة المغرب لاستجلاب الرحمة والبركة وغفران ذنوب الأسبوع.",
      text: """سُبْحَانَ مَنْ يَعْلَمُ جَوَارِحَ الْقُلُوبِ،
سُبْحَانَ مَنْ يُحْصِي عَدَدَ الذُّنُوبِ،
سُبْحَانَ مَنْ لا يَخْفَى عَلَيْهِ خَافِيَةٌ فِي السَّمَاوَاتِ وَالْأَرْضِ،
سُبْحَانَ الرَّؤُوفِ الرَّحِيمِ،
سُبْحَانَ الْغَفُورِ الرَّحِيمِ،
سُبْحَانَ الْعَزِيزِ الْحَكِيمِ،
سُبْحَانَ الْقَائِمِ الدَّائِمِ،
سُبْحَانَ الْمُحْيِي الْمُمِيتِ،
سُبْحَانَهُ وَتَعَالَى.""",
    ),

    Dhikr(
      title: "ذكر التهليل الكبير",
      benefits:
          "من أعظم الأذكار لتوحيد الله تعالى، يطرد الشيطان ويُنير القلب ويُكتب للمداوم أجر عظيم.",
      text: """لا إِلَهَ إِلَّا اللَّهُ الْمَلِكُ الْحَقُّ الْمُبِينُ.
لا إِلَهَ إِلَّا اللَّهُ الْعَدْلُ الْيَقِينُ.
لا إِلَهَ إِلَّا اللَّهُ رَبُّنَا وَرَبُّ آبَائِنَا الْأَوَّلِينَ.
سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ.
لا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.""",
    ),
  ];

  static final List<Dhikr> tawizat = [
    Dhikr(
      title: "عوذة يوم السبت",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

أُعِيذُ نَفْسِي بِاللَّهِ الَّذِي لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.  

(ثم تقرأ الحمد والمعوذتين والتوحيد)

ثم تقول:
كَذَلِكَ اللَّهُ رَبُّنَا وَ سَيِّدُنَا وَ مَوْلَانَا لَا إِلَهَ إِلَّا هُوَ نُورُ النُّورِ وَ مُدَبِّرُ الْأُمُورِ نُورُ السَّماواتِ وَ الْأَرْضِ مَثَلُ نُورِهِ كَمِشْكاةٍ فِيها مِصْباحٌ الْمِصْباحُ فِي زُجاجَةٍ الزُّجاجَةُ كَأَنَّها كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِنْ شَجَرَةٍ مُبارَكَةٍ زَيْتُونَةٍ لا شَرْقِيَّةٍ وَ لا غَرْبِيَّةٍ يَكادُ زَيْتُها يُضِيءُ وَ لَوْ لَمْ تَمْسَسْهُ نارٌ نُورٌ عَلى نُورٍ يَهْدِي اللَّهُ لِنُورِهِ مَنْ يَشاءُ وَ يَضْرِبُ اللَّهُ الْأَمْثالَ لِلنَّاسِ وَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ الَّذِي خَلَقَ السَّماواتِ وَ الْأَرْضَ بِالْحَقِّ وَ يَوْمَ يَقُولُ كُنْ فَيَكُونُ قَوْلُهُ الْحَقُّ وَ لَهُ الْمُلْكُ يَوْمَ يُنْفَخُ فِي الصُّورِ عالِمُ الْغَيْبِ وَ الشَّهادَةِ وَ هُوَ الْحَكِيمُ الْخَبِيرُ الَّذِي خَلَقَ سَبْعَ سَماواتٍ طِباقاً وَ مِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ اللَّهَ عَلى كُلِّ شَيْءٍ قَدِيرٌ وَ أَنَّ اللَّهَ قَدْ أَحاطَ بِكُلِّ شَيْءٍ عِلْماً وَ أَحْصى كُلَّ شَيْءٍ عَدَداً وَ مِنْ شَرِّ كُلِّ ذِي شَرِّ مُعْلِنٍ بِهِ أَوْ مُسِرٍّ وَ مِنْ شَرِّ الْجِنَّةِ وَ الْبَشَرِ وَ مِنْ شَرِّ مَا يَظْهَرُ بِاللَّيْلِ وَ يَكْمُنُ بِالنَّهَارِ وَ مِنْ شَرِّ طَوَارِقِ اللَّيْلِ وَ النَّهَارِ وَ مِنْ شَرِّ مَا يَنْزِلُ الْحَمَّامَاتِ وَ الْحُشُوشَ وَ الْخَرَابَاتِ وَ الْأَوْدِيَةَ وَ الصَّحَارِيَ وَ الغِيَاضَ وَ الشَّجَرَ وَ يَكُونُ فِي الْأَنْهَارِ وَ أُعِيذُ نَفْسِي وَ مَنْ يَعْنِينِي أَمْرُهُ بِاللَّهِ مالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشاءُ وَ تَنْزِعُ الْمُلْكَ مِمَّنْ تَشاءُ وَ تُعِزُّ مَنْ تَشاءُ وَ تُذِلُّ مَنْ تَشاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلى كُلِّ شَيْءٍ قَدِيرٌ تُولِجُ اللَّيْلَ فِي النَّهارِ وَ تُولِجُ النَّهارَ فِي اللَّيْلِ وَ تُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَ تُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَ تَرْزُقُ مَنْ تَشاءُ بِغَيْرِ حِسابٍ لَهُ مَقالِيدُ السَّماواتِ وَ الْأَرْضِ يَبْسُطُ الرِّزْقَ لِمَنْ يَشاءُ وَ يَقْدِرُ إِنَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ خَلَقَ الْأَرْضَ وَ السَّماواتِ الْعُلى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى لَهُ ما فِي السَّماواتِ وَ ما فِي الْأَرْضِ وَ ما بَيْنَهُما وَ ما تَحْتَ الثَّرى وَ إِنْ تَجْهَرْ بِالْقَوْلِ فَإِنَّهُ يَعْلَمُ السِّرَّ وَ أَخْفى اللَّهُ لا إِلهَ إِلَّا هُوَ لَهُ الْأَسْماءُ الْحُسْنى لَهُ الْخَلْقُ وَ الْأَمْرُ مُنْزِلُ التَّوْرَاةِ وَ الْإِنْجِيلِ وَ الزَّبُورِ وَ الْفُرْقَانِ الْعَظِيمُ مِنْ شَرِّ كُلِّ طَاغٍ وَ بَاغٍ وَ نَافِثٍ وَ شَيْطَانٍ وَ سُلْطَانٍ وَ سَاحِرٍ وَ كَاهِنٍ وَ نَاظِرٍ وَ طَارِقٍ وَ مُتَحَرِّكٍ وَ سَاكِنٍ وَ مُتَكَلِّمٍ وَ سَاكِتٍ وَ نَاطِقٍ وَ صَامِتٍ وَ مُتَخَيِّلٍ وَ مُتَمَثِّلٍ وَ مُحْتَقِرٍ وَ نَسْتَجِيرُ بِاللَّهِ حِرْزِنَا وَ نَاصِرِنَا وَ مُونِسِنَا وَ هُوَ يَدْفَعُ عَنَّا لَا شَرِيكَ لَهُ وَ لَا مُعِزَّ لِمَنْ أَذَلَّ وَ لَا مُذِلَّ لِمَنْ أَعَزَّ وَ هُوَ الْواحِدُ الْقَهَّارُ وَ صَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَ آلِهِ الطَّاهِرِينَ.''',
    ),
    Dhikr(
      title: "عوذة يوم الأحد",
      benefits: "",
      text: '''بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ

اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اسْتَوَى الرَّبُّ عَلَى الْعَرْشِ وَ قَامَتِ السَّمَاوَاتُ وَ الْأَرْضُ بِحِكْمَتِهِ وَ زَهَرَتِ النُّجُومُ بِأَمْرِهِ وَ رَسَتِ الْجِبَالُ بِإِذْنِهِ لَا يُجَاوِزُ اسْمُهُ مَنْ فِي السَّمَاوَاتِ وَ الْأَرْضِ الَّذِي دَانَتْ لَهُ الْجِبَالُ وَ هِيَ طَائِعَةٌ وَ انْبَعَثَتْ لَهُ الْأَجْسَادُ وَ هِيَ بَالِيَةٌ وَ بِهِ احْتَجَبْتُ بِاللَّهِ الَّذِي عَنْ كُلِّ غَاوٍ وَ بَاغٍ وَ طَاغٍ وَ جَبَّارٍ وَ حَاسِدٍ وَ بِاسْمِ اللَّهِ الَّذِي جَعَلَ بِهِ بَيْنَ الْبَحْرَيْنِ حاجِزاً وَ احْتَجَبْتُ بِاللَّهِ الَّذِي جَعَلَ فِي السَّماءِ بُرُوجاً وَ جَعَلَ فِيها سِراجاً وَ قَمَراً مُنِيراً وَ زَيَّنَهَا لِلنَّاظِرِينَ وَ حَفِظَهَا مِنْ كُلِّ شَيْطانٍ رَجِيمٍ وَ جَعَلَ فِي الْأَرْضِ رَوَاسِيَ جِبِالًا أَوْتَاداً أَنْ يُوصَلَ إِلَيَّ سُوءٌ أَوْ فَاحِشَةٌ أَوْ بَلِيَّةٌ حم حم حم تَنْزِيلٌ مِنَ الرَّحْمنِ الرَّحِيمِ حم حم حم عسق كَذلِكَ يُوحِي إِلَيْكَ وَ إِلَى الَّذِينَ مِنْ قَبْلِكَ اللَّهُ الْعَزِيزُ الْحَكِيمُ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ سَلَّمَ تَسْلِيماً.''',
    ),
    Dhikr(
      title: "عوذة يوم الاثنين",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

أُعِيذُ نَفْسِي بِرَبِّي الْأَكْبَرِ مِمَّا يَخْفَى وَ مَا يَظْهَرُ وَ مِنْ شَرِّ كُلِّ أُنْثَى وَ ذَكَرٍ وَ مِنْ شَرِّ مَا رَأَتِ الشَّمْسُ وَ الْقَمَرُ قُدُّوسٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَ الرُّوحِ أَدْعُوكُمْ أَيُّهَا الْجِنُّ إِنْ كُنْتُمْ سَامِعِينَ مُطِيعِينَ وَ أَدْعُوكُمْ أَيُّهَا الْإِنْسُ إِلَى اللَّطِيفِ الْخَبِيرِ وَ أَدْعُوكُمْ أَيُّهَا الْجِنُّ وَ الْإِنْسُ إِلَى الَّذِي خَتَمْتُهُ بِخَاتَمِ رَبِّ الْعَالَمِينَ وَ خَاتَمِ جِبْرِيلَ وَ مِيْكَالَ وَ إِسْرَافِيلَ وَ خَاتَمِ سُلَيْمَانَ بْنِ دَاوُدَ عَلَيْهِمُ السَّلَامُ وَ خَاتَمِ مُحَمَّدٍ سَيِّدِ الْمُرْسَلِينَ وَ النَّبِيِّينَ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ عَلَيْهِمْ أَجْمَعِينَ وَ أَزْجُرُ عَنْ نَفْسِي كُلَّمَا يَغْدُو وَ يَرُوحُ مِنْ ذِي حَيٍّ أَوْ عَقْرَبٍ أَوْ سَاحِرٍ أَوْ شَيْطَانٍ رَجِيمٍ أَوْ سُلْطَانٍ عَنِيدٍ أَخَذْتُ عَنْهُ مَا يُرَى وَ مَا لَا يُرَى وَ مَا رَأَتْ عَيْنُ نَائِمٍ أَوْ يَقْظَانٍ بِإِذْنِ اللَّهِ اللَّطِيفِ الْخَبِيرِ لَا سُلْطَانَ لَكُمْ عَلَى اللَّهِ لَا شَرِيكَ لَهُ وَ صَلَّى اللَّهُ عَلَى رَسُولِهِ سَيِّدِنَا مُحَمَّدٍ النَّبِيِّ وَ آلِهِ الطَّاهِرِينَ وَ سَلَّمَ تَسْلِيماً.''',
    ),
    Dhikr(
      title: "عوذة يوم الثلاثاء",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

أُعِيذُ نَفْسِي بِاللَّهِ الْأَكْبَرِ رَبِّ السَّمَاوَاتِ الْقَائِمَاتِ بِلَا عَمْدٍ وَ بِالَّذِي خَلَقَهَا فِي يَوْمَيْنِ وَ قَضَى فِي كُلِّ سَماءٍ أَمْرَها وَ خَلَقَ الْأَرْضَ فِي يَوْمَيْنِ وَ قَدَّرَ فِيها أَقْواتَها وَ جَعَلَ فِيهَا جِبِالًا أَوْتَاداً وَ جَعَلَهَا فِجاجاً سُبُلًا وَ أَنْشَأَ السَّحَابَ وَ سَخَّرَهُ وَ أَجْرَى الْفُلْكَ وَ سَخَّرَ الْبَحْرَ وَ جَعَلَ فِي الْأَرْضِ رَواسِيَ وَ أَنْهاراً مِنْ شَرِّ مَا يَكُونُ فِي اللَّيْلِ وَ النَّهَارِ وَ تَعْقِدُ عَلَيْهِ الْقُلُوبُ وَ تَرَاهُ الْعُيُونُ مِنَ الْجِنِّ وَ الْإِنْسِ كَفَانَا اللَّهُ كَفَانَا اللَّهُ كَفَانَا اللَّهُ لَا إِلَهَ إِلَّا اللَّهُ مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ الطَّاهِرِينَ وَ سَلَّمَ تَسْلِيماً.''',
    ),
    Dhikr(
      title: "عوذة يوم الأربعاء",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

أُعِيذُ نَفْسِي بِالْأَحَدِ الصَّمَدِ مِنْ شَرِّ النَّفَّاثاتِ فِي الْعُقَدِ وَ مِنْ شَرِّ ابْنِ قِتْرَةَ وَ مَا وَلَدَ أَسْتَعِيذُ بِاللَّهِ الْوَاحِدِ الْأَعْلَى مِنْ شَرِّ مَا رَأَتْ عَيْنِي وَ مَا لَمْ تَرَ أَسْتَعِيذُ بِاللَّهِ الْوَاحِدِ الْفَرْدِ الْكَبِيرِ الْأَعْلَى مِنْ شَرِّ مَنْ أَرَادَنِي بِأَمْرٍ عَسِيرٍ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ اجْعَلْنِي فِي جِوَارِكَ وَ حِصْنِكَ الْحَصِينِ الْعَزِيزِ الْجَبَّارِ الْمَلِكِ الْقُدُّوسِ الْقَهَّارِ السَّلَامِ الْمُؤْمِنِ الْمُهَيْمِنِ الْغَفَّارِ عَالِمِ الْغَيْبِ وَ الشَّهَادَةِ الْكَبِيرِ الْمُتَعَالِ هُوَ اللَّهُ هُوَ اللَّهُ هُوَ اللَّهُ لَا شَرِيكَ لَهُ مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ سَلَّمَ كَثِيراً.''',
    ),
    Dhikr(
      title: "عوذة يوم الخميس",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

أُعِيذُ نَفْسِي بِرَبِّ الْمَشارِقِ وَ الْمَغارِبِ مِنْ كُلِّ شَيْطَانٍ مَارِدٍ وَ قَائِمٍ وَ قَاعِدٍ وَ عَدُوٍّ وَ حَاسِدٍ وَ مُعَانِدٍ وَ يُنَزِّلُ عَلَيْكُمْ مِنَ السَّماءِ ماءً لِيُطَهِّرَكُمْ بِهِ وَ يُذْهِبَ عَنْكُمْ رِجْزَ الشَّيْطانِ وَ لِيَرْبِطَ عَلى قُلُوبِكُمْ وَ يُثَبِّتَ بِهِ الْأَقْدامَ ارْكُضْ بِرِجْلِكَ هذا مُغْتَسَلٌ بارِدٌ وَ شَرابٌ وَ أَنْزَلْنا مِنَ السَّماءِ ماءً طَهُوراً لِنُحْيِيَ بِهِ بَلْدَةً مَيْتاً وَ نُسْقِيَهُ مِمَّا خَلَقْنا أَنْعاماً وَ أَناسِيَّ كَثِيراً الْآنَ خَفَّفَ اللَّهُ عَنْكُمْ ذلِكَ تَخْفِيفٌ مِنْ رَبِّكُمْ وَ رَحْمَةٌ يُرِيدُ اللَّهُ أَنْ يُخَفِّفَ عَنْكُمْ فَسَيَكْفِيكَهُمُ اللَّهُ وَ هُوَ السَّمِيعُ الْعَلِيمُ لا إِلهَ إِلَّا اللَّهُ وَ اللَّهُ غالِبٌ عَلى أَمْرِهِ لَا إِلَهَ إِلَّا اللَّهُ مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ أَعُوذُ بِعِزَّةِ اللَّهِ وَ أَعُوذُ بِقُدْرَةِ اللَّهِ وَ أَعُوذُ بِرَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ سَلَّمَ تَسْلِيماً.''',
    ),
    Dhikr(
      title: "عوذة يوم الجمعة",
      benefits: "",
      text: '''بسم الله الرحمن الرحيم

لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ اللَّهُمَّ رَبَّ الْمَلَائِكَةِ وَ الرُّوحِ وَ النَّبِيِّينَ وَ الْمُرْسَلِينَ وَ قَاهِرَ مَنْ فِي السَّمَاوَاتِ وَ الْأَرَضِينَ وَ خَالِقَ كُلِّ شَيْءٍ وَ مَالِكَهُ كُفَّ عَنَّا بَأْسَ أَعْدَائِنَا وَ مَنْ أَرَادَ بِنَا سُوءاً مِنَ الْجِنِّ وَ الْإِنْسِ وَ أَعْمِ أَبْصَارَهُمْ وَ قُلُوبَهُمْ وَ اجْعَلْ بَيْنَنَا وَ بَيْنَهُمْ حِجَاباً وَ حَرَساً وَ مَدْفَعاً إِنَّكَ رَبُّنَا لَا حَوْلَ وَ لَا قُوَّةَ لَنَا إِلَّا بِاللَّهِ عَلَيْهِ تَوَكَّلْنَا وَ إِلَيْهِ أَنَبْنَا وَ هُوَ الْعَزِيزُ الْحَكِيمُ رَبَّنَا عَافِنَا مِنْ شَرِّ كُلِّ سُوءٍ وَ مِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِناصِيَتِها وَ مِنْ شَرِّ ما سَكَنَ فِي اللَّيْلِ وَ النَّهارِ وَ مِنْ شَرِّ كُلِّ سُوءٍ وَ مِنْ شَرِّ كُلِّ ذِي شَرٍّ رَبَّ الْعَالَمِينَ وَ إِلَهَ الْمُرْسَلِينَ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ أَجْمَعِينَ وَ أَوْلِيَائِكَ وَ خُصَّ مُحَمَّداً وَ آلَهُ بِأَتَمِّ ذَلِكَ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ بِسْمِ اللَّهِ وَ بِاللَّهِ أُومِنُ وَ بِاللَّهِ أَعُوذُ وَ بِاللَّهِ أَعْتَصِمُ وَ بِاللَّهِ أَسْتَجِيرُ وَ بِعِزَّةِ اللَّهِ وَ مَنَعَتِهِ أَمْتَنِعُ مِنْ شَيَاطِينِ الْإِنْسِ وَ الْجِنِّ وَ مِنْ رَجِلِهِمْ وَ خَيْلِهِمْ وَ رَكْضِهِمْ وَ عَطْفِهِمْ وَ رَجْعَتِهِمْ وَ كَيْدِهِمْ وَ شَرِّهِمْ وَ شَرِّ مَا يَأْتُونَ بِهِ تَحْتَ اللَّيْلِ وَ تَحْتَ النَّهَارِ مِنَ الْبُعْدِ وَ الْقُرْبِ وَ مِنْ شَرِّ الْغَائِبِ وَ الْحَاضِرِ وَ الشَّاهِدِ وَ الزَّائِرِ أَحْيَاءً وَ أَمْوَاتاً أَعْمَى وَ بَصِيراً وَ مِنْ شَرِّ الْعَامَّةِ وَ الْخَاصَّةِ وَ مِنْ نَفْسٍ وَ وَسْوَسَتِهَا وَ مِنْ شَرِّ الدَّنَاهِشِ وَ الْحِسِّ وَ اللَّمْسِ وَ اللَّبْسِ وَ مِنَ الْجِنِّ وَ الْإِنْسِ وَ بِالاسْمِ الَّذِي اهْتَزَّ لَهُ عَرْشُ بِلْقِيسَ وَ أُعِيذُ نَفْسِي وَ دِينِي وَ جَمِيعَ مَا تُحِيطُهُ عِنَايَتِي مِنْ شَرِّ كُلِّ صُورَةٍ وَ خِيَالٍ أَوْ بَيَاضٍ أَوْ سَوَادٍ أَوْ تِمْثَالٍ أَوْ مُعَاهَدٍ أَوْ غَيْرِ مُعَاهَدٍ مِمَّنْ يَسْكُنُ الْهَوَاءَ وَ السَّحَابَ وَ الظُّلُمَاتِ وَ النُّورَ وَ الظِّلَّ وَ الْحَرُورَ وَ الْبَرَّ وَ الْبُحُورَ وَ السَّهْلَ وَ الْوُعُورَ وَ الْخَرَابَ وَ الْعُمْرَانَ وَ الْآكَامَ وَ الْآجَامَ وَ الْمَغَايِضَ وَ الْكَنَائِسَ وَ النَّوَاوِيسَ وَ الْفَلَوَاتِ وَ الْجَبَّانَاتِ مِنَ الصَّادِرِينَ وَ الْوَارِدِينَ مِمَّنْ يَبْدُو بِاللَّيْلِ وَ تَبْتَشِرُ بِالنَّهَارِ وَ بِالْعَشِيِّ وَ الْإِبْكَارِ وَ الْغُدُوِّ وَ الْآصَالِ وَ الْمُرِيبِينَ وَ الْأَسَامِرَةِ وَ الْأَفَاتِرَةِ وَ الْفَرَاعِنَةِ وَ الْأَبَالِسَةِ وَ مِنْ جُنُودِهِمْ وَ أَزْوَاجِهِمْ وَ عَشَائِرِهِمْ وَ قَبَائِلِهِمْ وَ مِنْ هَمْزِهِمْ وَ لَمْزِهِمْ وَ نَفْثِهِمْ وَ وِقَاعِهِمْ وَ أَخْذِهِمْ وَ سِحْرِهِمْ وَ ضَرْبِهِمْ وَ عَيْشِهِمْ وَ لَمْحِهِمْ وَ احْتِيَالِهِمْ وَ أَخْلَاقِهِمْ وَ مِنْ شَرِّ كُلِّ ذِي شَرٍّ مِنَ السَّحَرَةِ وَ الْغِيلَانِ وَ أُمِّ الصِّبْيَانِ وَ مَا وَلَدُوا وَ مَا وَرَدُوا وَ مِنْ شَرِّ كُلِّ ذِي شَرٍّ دَاخِلٍ وَ خَارِجٍ وَ عَارِضٍ وَ مُتَعَرِّضٍ وَ سَاكِنٍ وَ مُتَحَرِّكٍ وَ ضَرَبَانِ عِرْقٍ وَ صُدَاعٍ وَ شَقِيقَةٍ وَ أُمِّ مِلْدَمٍ وَ الْحُمَّى وَ الْمُثَلَّثَةِ وَ الرِّبْعِ وَ الْغِبِّ وَ النَّافِضَةِ وَ الصَّالِبَةِ وَ الدَّاخِلَةِ وَ الْخَارِجَةِ وَ مِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِناصِيَتِها إِنَّكَ عَلى صِراطٍ مُسْتَقِيمٍ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدِ كَثِيراً وَ سَلَّمَ تَسْلِيماً.''',
    ),
    Dhikr(
      title: "حرز الامام الجواد عليه السلام",
      benefits:
          "للوقاية من العين والحسد، ودفع البلاء والشرور وتسهيل الأمور الصعبة.",
      text:
          '''بسم الله الرحمن الرحيم

يَا نُورُ يَا بُرْهَانُ يَا مُبِينُ يَا مُنِيرُ، يَا رَبِّ اكْفِنِي الشُّرُورَ، وَآفَاتِ الدُّهُورِ، وَأَسْأَلُكَ النَّجَاةَ يَوْمَ يُنْفَخُ فِي الصُّورِ.''',
    ),
    Dhikr(
      title: "حرز وعوذة أمير المؤمنين علي (ع)",
      benefits: "عوذة يومية مأثورة للتحصين الكامل وحفظ النفس والأهل والمال.",
      text:
          '''بسم الله الرحمن الرحيم

أُعِيذُ نَفْسِي وَدِينِي وَأَهْلِي وَمَالِي وَوَلَدِي وَخَوَاتِيمَ عَمَلِي وَمَا رَزَقَنِي رَبِّي وَخَوَّلَنِي بِعِزَّةِ اللهِ، وَعَظَمَةِ اللهِ، وَجَبَرُوتِ اللهِ، وَسُلْطَانِ اللهِ، وَرَحْمَةِ اللهِ، وَرَأْفَةِ اللهِ، وَغُفْرَانِ اللهِ، وَقُوَّةِ اللهِ، وَقُدْرَةِ اللهِ، وَبِآلِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ.''',
    ),

    Dhikr(
      title: "حرز الامام الرضا عليه السلام",
      benefits:
          "حرز مأثور عن الإمام الرضا (ع) يُقرأ للحفظ من جميع أنواع البلاء والأمراض والعين.",
      text:
          """بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ، بِسْمِ اللَّهِ وَبِاللَّهِ وَبِمُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ، وَلا حَوْلَ وَلا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ. اللَّهُمَّ أَسْتَوْدِعُكَ نَفْسِي وَدِينِي وَأَهْلِي وَمَالِي وَوُلْدِي وَخَوَاتِيمَ عَمَلِي وَمَا أَعْطَيْتَنِي، اللَّهُمَّ احْفَظْنِي بِحِفْظِ الإِيمَانِ مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي وَمِنْ تَحْتِي.""",
    ),
    Dhikr(
      title: "تعويذة آية الكرسي",
      benefits:
          "آية الكرسي أعظم آية في كتاب الله، تُقرأ للتحصين من الشرور والجن والعين ولحفظ البيت.",
      text:
          '''بسم الله الرحمن الرحيم

اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ''',
    ),
    Dhikr(
      title: "تعويذة المعوذتين (الفلق والناس)",
      benefits:
          "من أعظم السور للتحصين والحماية، أوصى النبي (ص) بقراءتهما صباحاً ومساءً.",
      text: """بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ
قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴿١﴾ مِنْ شَرِّ مَا خَلَقَ ﴿٢﴾ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿٣﴾ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ﴿٤﴾ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ
قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴿١﴾ مَلِكِ النَّاسِ ﴿٢﴾ إِلَٰهِ النَّاسِ ﴿٣﴾ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ﴿٤﴾ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴿٥﴾ مِنَ الْجِنَّةِ وَالنَّاسِ ﴿٦﴾""",
    ),
    Dhikr(
      title: "دعاء التحصين الصباحي",
      benefits:
          "يُقرأ كل صباح للتحصين والحماية طوال اليوم من كل شر ومكروه وعين وحسد.",
      text:
          '''بسم الله الرحمن الرحيم

أَصْبَحْتُ بِاللَّهِ مُؤْمِناً، وَبِلِقَائِهِ مُوقِناً، وَبِحُجَّتِهِ مُعْتَرِفاً، وَمِنْ ذَنْبِي مُسْتَغْفِراً، وَلِرُبُوبِيَّةِ اللَّهِ خَاضِعاً، وَإِلَى الصَّلاةِ مُسَارِعاً.
أَعُوذُ بِاللَّهِ مِنْ شَرِّ مَا خَلَقَ وَذَرَأَ وَبَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ.''',
    ),
    Dhikr(
      title: "دعاء التحصين المسائي",
      benefits:
          "يُقرأ كل مساء للحماية في الليل من الشرور والوساوس والأحلام المزعجة.",
      text:
          '''بسم الله الرحمن الرحيم

أَمْسَيْتُ بِاللَّهِ مُؤْمِناً، وَبِلِقَائِهِ مُوقِناً، وَبِحُجَّتِهِ مُعْتَرِفاً، وَمِنْ ذَنْبِي مُسْتَغْفِراً.
أَعُوذُ بِعِزَّةِ اللَّهِ وَجَلالِهِ وَقُدْرَتِهِ عَلَى مَا يَشَاءُ مِنْ شَرِّ مَا خَلَقَ وَذَرَأَ وَبَرَأَ.
بِسْمِ اللَّهِ الَّذِي لا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ. (ثلاث مرات)
اللَّهُمَّ احْفَظْنِي فِي مَنَامِي وَيَقَظَتِي، وَاكْفِنِي شَرَّ الشَّيْطَانِ وَجُنُودِهِ، يَا أَرْحَمَ الرَّاحِمِينَ.''',
    ),
  ];

  static final List<Map<String, String>> weekAzkar = [
    {
      "day": "السبت",
      "dhikr": "يَا رَبَّ الْعَالَمِين",
      "count": "100 مرة",
      "reward": "توجب استجابة الدعاء وقضاء الحوائج",
    },
    {
      "day": "الأحد",
      "dhikr": "يَا ذَا الْجَلَالِ وَالْإِكْرَام",
      "count": "100 مرة",
      "reward": "تزيد في الإيمان وتيسر الأمور",
    },
    {
      "day": "الإثنين",
      "dhikr": "يَا قَاضِيَ الْحَاجَات",
      "count": "100 مرة",
      "reward": "توجب نيل المقامات والبركة في الرزق",
    },
    {
      "day": "الثلاثاء",
      "dhikr": "يَا أَرْحَمَ الرَّاحِمِين",
      "count": "100 مرة",
      "reward": "تفتح أبواب الرحمة وتدفع البلاء",
    },
    {
      "day": "الأربعاء",
      "dhikr": "يَا حَيُّ يَا قَيُّوم",
      "count": "100 مرة",
      "reward": "تزيد في العمر وصلاح المعاش والآخرة",
    },
    {
      "day": "الخميس",
      "dhikr": "لَا إِلٰهَ إِلَّا اللهُ الْمَلِكُ الْحَقُّ الْمُبِين",
      "count": "100 مرة",
      "reward": "توجب الغنى وطرد الفقر وحفظ القبر",
    },
    {
      "day": "الجمعة",
      "dhikr":
          "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَعَجِّلْ فَرَجَهُم",
      "count": "100 مرة",
      "reward": "تمحو السيئات وترفع الدرجات العظمى",
    },
  ];

  static final List<Map<String, String>> quranVirtues = [
    {
      "name": "الفاتحة",
      "benefits":
          "رُوي عن النبي الأكرم (ص) أنّه قال: «أيّما مسلم قرأ فاتحة الكتاب أُعطي من الأجر كأنّما قرأ ثلثي القرآن، وأُعطي من الأجر كأنّما تصدّق على كلّ مؤمن ومؤمنة». وعن الإمام الصادق (ع): «لو قُرئت الحمد على ميّت سبعين مرّة ثمّ ردّت فيه الروح ما كان ذلك عجباً». هي شفاء من كلّ داء وعافية من كلّ بلاء.",
      "hadithSource": "مجمع البيان",
    },
    {
      "name": "البقرة",
      "benefits":
          "رُوي عن الرسول الأكرم (ص): «إنّ لكل شيء سناماً وسنام القرآن سورة البقرة، من قرأها في بيته نهاراً لم يدخله شيطان ثلاثة أيام، ومن قرأها في بيته ليلاً لم يدخله شيطان ثلاث ليال». وتُعد حرزاً عظيماً من السحر والعين ودفع الضر.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "آل عمران",
      "benefits":
          "رُوي عن النبي (ص) قال: «من قرأ سورة آل عمران أُعطي بكل آية منها أماناً على جسر جهنم». وعن الإمام الصادق (ع): «من قرأ البقرة وآل عمران جاءتا يوم القيامة تظلانه على رأسه مثل الغمامتين أو مثل العباءتين».",
      "hadithSource": "مجمع البيان",
    },
    {
      "name": "النساء",
      "benefits":
          "رُوي عن أمير المؤمنين (ع): «من قرأ سورة النساء في كل جمعة أُمن من ضغطة القبر». وتورث قارئها الوقار وحسن الشأن والمغفرة العظيمة للذنوب والخطايا.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "المائدة",
      "benefits":
          "رُوي عن الإمام الباقر (ع): «من قرأ سورة المائدة في كل يوم خميس لم يلبس إيمانه بظلم ولم يشرك بربه أحداً». وتوجب نيل المغفرة الإلهية والوفاء بالعهود والمواثيق.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الأنعام",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «نزلت سورة الأنعام جملة واحدة وشيعها سبعون ألف ملك حتى أنزلت على محمد (ص)، فعظموها ورتلوها فإن اسم الله فيها في سبعين موضعاً، ولو يعلم الناس ما في قراءتها ما تركوها».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الأعراف",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الأعراف في كل شهر كان يوم القيامة من الذين لا خوف عليهم ولا هم يحزنون، فإن قرأها في كل جمعة كان ممن لا يحاسب يوم القيامة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الأنفال",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ الأنفال وبراءة في كل شهر لم يدخله نفاق أبداً، وكان من شيعة أمير المؤمنين (ع) حقاً، ويأكل يوم القيامة من موائد الجنة معهم حتى يفرغ الناس من الحساب».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "التوبة",
      "benefits":
          "رُوي عن النبي الأكرم (ص): «من قرأ سورة التوبة بعثه الله يوم القيامة بريئاً من النفاق». وتوجب النصر على الأعداء وتحصين النفس والدين من الشكوك والأهواء.",
      "hadithSource": "مجمع البيان",
    },
    {
      "name": "يونس",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة يونس في كل شهر أو شهرين لم يخف عليه أن يكون من الجاهلين، وكان يوم القيامة من المقربين». وتدفع كيد الحاسدين الحاقدين.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "هود",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من قرأ سورة هود في كل جمعة بعثه الله عز وجل يوم القيامة في زمرة النبيين، وحوسب حساباً يسيراً، ولم تكتب له خطيئة عملها يوم القيامة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "يوسف",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة يوسف في كل يوم أو في كل ليلة بعثه الله يوم القيامة وجماله مثل جمال يوسف، ولا يصيبه فزع يوم القيامة، وكان من خيار عباد الله الصالحين».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الرعد",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من أكثر قراءة سورة الرعد لم يصبه الله بصاعقة أبداً ولو كان ناصبياً، وإذا كان مؤمناً أدخله الله الجنة بلا حساب، وشفّع فيمن يعرفه من أهل بيته وإخوانه».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "إبراهيم",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة إبراهيم والحجر في ركعتين جميعاً في كل جمعة لم يصبه فقر أبداً ولا جنون ولا بلوى». وتوجب التوفيق للأعمال الصالحة وصيانة الأموال والأنفس.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الحجر",
      "benefits":
          "رُوي عن النبي الأكرم (ص) قال: «من قرأ سورة الحجر أُعطي من الأجر عشر حسنات بعدد المهاجرين والأنصار». وتورث حفظ البركة في الرزق وتيسير قضاء الأمور المستعصية.",
      "hadithSource": "مجمع البيان",
    },
    {
      "name": "النحل",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من قرأ سورة النحل في كل شهر كُفي المغرم في الدنيا وسبعين نوعاً من أنواع البلاء أهونها الجنون والجذام والبرص، وكان مسكنه في جنة عدن وهي وسط الجنان».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الإسراء",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة بني إسرائيل (الإسراء) في كل ليلة جمعة لم يمت حتى يدرك القائم (عج) ويكون من أصحابه». وتكشف الحقائق وتزيد في نور البصيرة الإيمانية.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الكهف",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الكهف في كل ليلة جمعة لم يمت إلا شهيداً، وبعثه الله مع الشهداء، ووقف يوم القيامة مع الشهداء». وتضيء نوراً لقارئها يمتد إلى الجمعة التالية.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "مريم",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من أدمع قراءة سورة مريم لم يمت حتى يصيب ما يغنيه في نفسه وماله وولده، وكان في الآخرة من أصحاب عيسى بن مريم (ع)، وأُعطي في الآخرة ملكاً مثل ملك سليمان».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "طه",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «لا تدعوا قراءة سورة طه فإن الله يحبها ويحب من يقرأها، ومن أدمع قراءتها أعطاه الله كتابه يوم القيامة بيمينه، ولم يحاسبه بما عمل في الإسلام، وأعطي في الآخرة من الأجر حتى يرضى».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الأنبياء",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الأنبياء حباً لها كان كمن رافق النبيين أجمعين في جنات النعيم، وكان مهيباً في أعين الناس في الحياة الدنيا». وتيسر قضاء الحوائج الصعبة ودفع الهموم.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الحج",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الحج في كل ثلاثة أيام لم تخرج سنته حتى يخرج إلى بيت الله الحرام، وإن مات في سفره أدخله الله الجنة». وتوجب نيل المغفرة وثواب الحجاج والمعتمرين.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "المؤمنون",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة المؤمنين ختم الله له بالسعادة إذا كان يدمن قراءتها في كل جمعة، وكان منزله في الفردوس الأعلى مع النبيين والمرسلين».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "النور",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «حصنوا أموالكم وفروجكم بتلاوة سورة النور، وحصنوا بها نساءكم، فإن من أدمن قراءتها في كل يوم أو في كل ليلة لم يزنِ أحد من أهل بيته أبداً حتى يموت».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الفرقان",
      "benefits":
          "رُوي عن الإمام موسى الكاظم (ع) أنه قال: «لا تدع قراءة سورة تبارك الذي نزل الفرقان، فإن من قرأها في كل ليلة لم يعذبه الله أبداً ولم يحاسبه وكان منزله في الفردوس الأعلى».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الشعراء",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ الطواسين الثلاث (الشعراء والنمل والقصص) في ليلة جمعة كان من أولياء الله وفي جواره وكنفه، ولم يصبه في الدنيا بؤس أبداً، وأعطي في الآخرة حتى يرضى وزيادة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "النمل",
      "benefits":
          "رُوي عن النبي الأكرم (ص) قال: «من قرأ سورة النمل كان له من الحسنات عشر بعدد من صدق بسليمان وهود وشعيب وصالح وإبراهيم وكذب بهم، ويخرج من قبره وهو ينادي لا إله إلا الله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "القصص",
      "benefits":
          "رُوي عن النبي الأكرم (ص): «من قرأ سورة القصص أُعطي من الأجر عشر حسنات بعدد من صدق بموسى وكذب به، ولم يبق ملك في السموات والأرض إلا شهد له يوم القيامة أنه كان صادقاً».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "العنكبوت",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة العنكبوت والروم في ليلة شهر رمضان المبارك (ليلة القدر) فهو والله يا أبا محمد من أهل الجنة، ولا أستثني فيه أحداً، ولا أخاف أن يكتب الله عليّ في حلفي إثماً».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الروم",
      "benefits":
          "رُوي عن النبي الأكرم (ص): «من قرأ سورة الروم كان له من الأجر عشر حسنات بعدد كل ملك سبّح لله ما بين السماء والأرض، وأدرك ما ضيع في يومه وليلته».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "لقمان",
      "benefits":
          "رُوي عن الإمام الباقر (ع): «من قرأ سورة لقمان في كل ليلة وكّل الله به في ليلته ثلاثين ملكاً يحفظونه من إبليس وجنوده حتى يصبح، فإذا قرأها بالنهار لم يزالوا يحفظونه من إبليس وجنوده حتى يمسي».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "السجدة",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة السجدة في كل ليلة جمعة أعطاه الله كتابه بيمينه، ولم يحاسبه بما كان منه، وكان من رفقاء محمد (ص) وأهل بيته (ع)». وتمنع وحشة وضغطة القبر.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الأحزاب",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من كان كثير القراءة لسورة الأحزاب كان يوم القيامة في جوار محمد (ص) وأزواجه». وتورث الهيبة والوقار ودفع حسد وكيد الخلائق.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "سبأ",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ الحمدين جميعاً (سورة سبأ وفاطر) في ليلة لم يزل في ليلته في حفظ الله وكلائه، فإذا قرأهما في نهاره لم يصبه في نهاره مكروه، وأعطي من خير الدنيا والآخرة ما لم يخطر على قلبه».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "فاطر",
      "benefits":
          "رُوي عن النبي الأكرم (ص) أنه قال: «من قرأ سورة فاطر يريد بها ما عند الله، دعته يوم القيامة ثمانية أبواب من الجنة أن ادخل من أيها شئت». وتورث البركة وتدفع المكاره.",
      "hadithSource": "تفسير البرهان",
    },
    {
      "name": "يس",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «إن لكل شيء قلباً وقلب القرآن يس، من قرأها في نهاره قبل أن يمسي كان في نهاره من المحفوظين والـمرزوقين، ومن قرأها في ليلة قبل أن ينام وكّل الله به ألف ملك يحفظونه من كل شيطان رجيم ومن كل آفة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الصافات",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة الصافات في كل يوم جمعة لم يزل محروساً من كل آفة، مدفوعاً عنه كل بلوى في الحياة الدنيا، مرزوقاً في الدنيا في أوسع ما يكون من الرزق».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "ص",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من قرأ سورة ص في ليلة جمعة أُعطي من خير الدنيا والآخرة ما لم يُعط أحد من الناس إلا نبي مرسل أو ملك مقرب، وأدخله الله الجنة وأحبابه ومن يحب من أهل بيته».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الزمر",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الزمر أعطاه الله شرف الدنيا والآخرة، وأعزه بلا مال ولا عشيرة حتى يهابه من يراه، وحرم جسده على النار، وبني له في الجنة ألف مدينة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "غافر",
      "benefits":
          "رُوي عن الإمام الباقر (ع): «من قرأ حم المؤمن (غافر) في كل ليلة غفر الله له ما تقدم من ذنبه وما تأخر، وألهمه كلمة التقوى، وجعل الآخرة له خيراً من الدنيا».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "فصلت",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ حم السجدة (فصلت) كانت له نوراً بين يديه يوم القيامة مد بصره، وسروراً وعاش في الدنيا حميداً محموداً وكان آمناً في دنياه وأخراه».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الشورى",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ حم عسق (الشورى) بعثه الله يوم القيامة ووجهه كالثلج أو كالشمس ضياءً حتى يقف بين يدي الله، فيقول عبدي أدمت قراءتها ولم تكن تدري ثوابها، ادخل الجنة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الزخرف",
      "benefits":
          "رُوي عن الإمام الباقر (ع): «من أدمن قراءة حم الزخرف آمنه الله في قبره من هوام الأرض وضغطة القبر حتى يقف بين يدي الله عز وجل، فتجيء السورة حتى تدخله الجنة بأمر الله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الدخان",
      "benefits":
          "رُوي عن الإمام الباقر (ع): «من قرأ سورة الدخان في فرائضه ونوافله بعثه الله من الآمنين يوم القيامة، وأظله تحت عرشه، وحاسبه حساباً يسيراً، وأعطاه كتابه بيمينه».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الجاثية",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الجاثية كان ثوابها أن لا يرى النار أبداً، ولا يسمع زفيرها ولا شهيقها، وهو مع محمد (ص) في الجنان». وتدفع جور السلاطين وكيد الأعداء.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الأحقاف",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الأحقاف في كل ليلة أو في كل جمعة لم يصبه الله بروعة في الحياة الدنيا، وآمنه من فزع يوم القيامة إن شاء الله». وتورث محبة الخلق والجاه السامي.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "محمد",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الذين كفروا (محمد) لم يداخله شك في دينه أبداً، ولم يبتله الله بفقر ولا خوف من سلطان أبداً، ولم يزل محفوظاً من الآفات حتى يموت».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الفتح",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «حصنوا أموالكم ونساءكم وما ملكت أيمانكم من التلف بقراءة إنا فتحنا لك فتحاً مبيناً، فإنه إذا كان ممن يدمن قراءتها نادى منادٍ يوم القيامة: أنت من عبادي المخلصين».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الحجرات",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الحجرات في كل ليلة أو في كل يوم كان من زوار محمد (ص)». وتوجب كف لسان السوء، وحفظ البيوت والأنفس من المكاره والشرور.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "ق",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من أدمن في فرائضه ونوافله سورة ق وسّع الله عليه في رزقه، وأعطاه كتابه بيمينه، وحاسبه حساباً يسيراً». وتسهل سكرات الموت لمن يمر بنزع الروح.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الذاريات",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة الذاريات في يومه أو ليلته أصلح الله له معيشته، وأتاه برزق واسع، ونوّر له في قبره بسراج يزهر إلى يوم القيامة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الطور",
      "benefits":
          "رُوي عن الإمام الباقر وأبي عبد الله (ع) قالا: «من قرأ سورة الطور جمع الله له خير الدنيا والآخرة». وتنجي قارئها من عذاب القبر وعذاب النار وآمنته في حشره يوم القيامة.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "النجم",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من كان يدمن قراءة سورة النجم في كل يوم أو في كل ليلة عاش حميداً بين الناس، وكان مغفوراً له، وكان محبوباً مهيباً في صدور العباد».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "القمر",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة اقتربت الساعة (القمر) أخرجه الله من قبره على ناقة من نوق الجنة ووجهه كالقمر ليلة البدر». وتيسر الأمور العسيرة وتدفع الشرور.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الرحمن",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «لا تدعوا قراءة سورة الرحمن، فإنها لا تقر في قلوب المنافقين، ويأتي بها الله يوم القيامة في صورة آدمي في أحسن صورة وأطيب ريح، وتشفع لمن قرأها».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الواقعة",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ في كل ليلة جمعة الواقعة أحبّه الله وأحبّه إلى الناس أجمعين، ولم ير في الدنيا بؤساً أبداً ولا فقراً ولا فاقة ولا آفة من آفات الدنيا، وكان من رفقاء أمير المؤمنين (ع)».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الحديد",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الحديد والمجادلة في فريضة أدمنها لم يعذبه الله حتى يموت أبداً، ولم ير في نفسه ولا في أهله سوءاً أبداً، ولا خصاصة في بدنه».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "المجادلة",
      "benefits":
          "رُوي عن النبي الأكرم (ص): «من قرأ سورة المجادلة كتب من حزب الله يوم القيامة». وتورث الطمأنينة والأمن من وساوس الجن والإنس وشر كل ذي شر.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الحشر",
      "benefits":
          "رُوي عن النبي الأكرم (ص): «من قرأ سورة الحشر لم يبق جنة ولا نار ولا عرش ولا كرسي ولا الحجب والسموات والأرضون إلا صلوا عليه واستغفروا له، وإن مات في يومه أو ليلته مات شهيداً».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الممتحنة",
      "benefits":
          "رُوي عن الإمام السجاد (ع) قال: «من قرأ سورة الممتحنة في فرائضه ونوافله أخلص الله قلبه للإيمان، ونور له بصره، ولم يصبه فقر أبداً، ولا جنون في بدنه ولا في ولده».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الصف",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من قرأ سورة الصف وأدمن قراءتها في فرائضه ونوافله حشره الله مع ملائكته وأنبيائه المرسلين في صف واحد إن شاء الله». وتورث النصر والظفر.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الجمعة",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «الواجب على كل مؤمن إذا كان لنا شيعة أن يقرأ في ليلة الجمعة بالجمعة وسبح اسم ربك الأعلى، وفي الظهر بالجمعة والمنافقين، فإذا فعل ذلك فكأنما يعمل بعمل رسول الله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "المنافقون",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة المنافقين برئ من النفاق كلياً، وأمن من شر المتربصين به والأعداء الحاقدين». وتوجب القبول والمحبة والإخلاص التام لله.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "التغابن",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة التغابن في فريضة شهدت له يوم القيامة عند من يجيز شهادتها، فلا تفارقه حتى يدخل الجنة». وتدفع المكاره وتجلب الأرزاق البركة.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الطلاق",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الطلاق والتحريم في فريضة عافاه الله من أن يكون يوم القيامة ممن يخاف أو يحزن، وعوفي من النار، وأدخله الله الجنة بتلاوتهما».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "التحريم",
      "benefits":
          "رُوي عن النبي الأكرم (ص): «من قرأ سورة التحريم أعطاه الله توبة نصوحاً لا يعود بعدها للذنب». وتسهل سكرات الموت وتهون الحساب يوم الدين والوقوف بين يدي الله.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الملك",
      "benefits":
          "رُوي عن الإمام الباقر (ع): «سورة الملك هي المانعة، تمنع من عذاب القبر، وهي مكتوبة في التوراة سورة الملك، من قرأها في ليلة فقد أكثر وأطاب ولم يكتب من الغافلين».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "القلم",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة ن والقلم في فريضة أو نافلة آمنه الله من أن يصيبه فقر أبداً، وأعاذه الله إذا مات من ضمة القبر». وتورث الفهم والعقل السليم.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الحاقة",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «أكثروا من قراءة سورة الحاقة فإن قراءتها في الفرائض والنوافل من الإيمان بالله ورسوله، ولم يسلب قارئها دينه حتى يلقى الله عز وجل».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "المعارج",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «أكثروا من قراءة سأل سائل (المعارج) فإن من أكثر قراءتها لم يسأله الله يوم القيامة عن ذنب عمله، وأسكنه الجنة مع محمد (ص) في أمانه».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "نوح",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من كان يؤمن بالله ويقرأ كتابه لا يدع قراءة سورة نوح، فإن من قرأها صابراً محتسباً في فريضته أو نافلته أسكنه الله في مساكن الأبرار».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الجن",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من أكثر قراءة قل أوحي إليّ (الجن) لم يصبه في الحياة الدنيا شيء من أعين الجن ولا نفثهم ولا سحرهم ولا كيدهم، وكان مع محمد (ص) في الجنة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "المزمل",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة المزمل في العشاء الآخرة أو في آخر الليل كان له الليل والنهار شاهدين مع سورة المزمل، وأحياه الله حياة طيبة وأماته ميتة طيبة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "المدثر",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من قرأ سورة المدثر في الفريضة كان حقاً على الله عز وجل أن يجعله مع محمد (ص) في درجته، ولا يدركه في الحياة الدنيا شقاء أبداً إن شاء الله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "القيامة",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من أدمن قراءة لا أقسم بيوم القيامة وكان يعمل بها، بعثه الله مع رسول الله (ص) من قبره في أحسن صورة، ويبشره ويضحك في وجهه حتى يدخل الجنة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الإنسان",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من قرأ سورة هل أتى على الإنسان في كل غداة خميس زوجّه الله من الحور العين ثمانمائة عذراء وأربعة آلاف ثيب، وكان مع محمد (ص) في الفردوس الأعلى».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "المرسلات",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة المرسلات عرفاً عرّف الله بينه وبين محمد (ص)». وتورث النصر والظفر على الخصوم والمنازعين والأمان من البلاء.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "النبأ",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة عم يتساءلون (النبأ) لم تخرج سنته إذا كان يدمنها في كل يوم حتى يزور بيت الله الحرام إن شاء الله تعالى».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "النازعات",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة النازعات لم يمت إلا رياناً، ولم يبعثه الله إلا رياناً، ولم يدخله الله الجنة إلا رياناً». وتوجب زوال الخوف عند النزع والوقوف بالحشر.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "عبس",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة عبس وتولى وعم يتساءلون كان تحت ظل الله وكرامته في جنانه، ولا يعظم ذلك على ربه إن شاء الله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "التكوير",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ إذا الشمس كورت كان في أمان الله وظله الجنة يوم تبلى السرائر ولم يفضح في قبره ولا حشره».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الانفطار",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ إذا السماء انفطرت وإذا السماء انشقت وجعل نصب عينه في فرائضه ونوافله لم يحجبه الله من حاجة، ولم يحجز بينه وبين الله حاجز».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "المطففين",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة المطففين في فريضته آمنه الله من النار يوم القيامة، ولم تره النار ولم يرها، ولم يمر على جسر جهنم».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الانشقاق",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ سورة الانشقاق أعطاه الله كتابه بيمينه، وكان آمناً من سوء الحساب وقضاء الحوائج العسيرة وتيسير الولادة للمرأة الحامل».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "البروج",
      "benefits":
          "رُوي عن النبي الأكرم (ص): «من قرأ سورة البروج أعطاه الله من الأجر بعدد كل يوم جمعة وكل يوم عرفة يكون في الدنيا عشر حسنات». وهي حرز عظيم من فزع الحشر القبر.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الطارق",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من كانت قراءته في فرائضه بالسماء والطارق كان له عند الله يوم القيامة جاه ومنزلة، وكان من رفقاء النبيين وأصحابهم في الجنة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الأعلى",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سبح اسم ربك الأعلى في فريضة أو نافلة قيل له يوم القيامة: ادخل الجنة من أي أبواب الجنة شئت إن شاء الله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الغاشية",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من أدمن قراءة هل أتاك حديث الغاشية في فرائضه ونوافله غشاه الله برحمته في الدنيا والآخرة، وآمنه من عذاب النار يوم الحساب».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الفجر",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «اقرأوا سورة الفجر في فرائضكم ونوافلكم فإنها سورة الحسين بن علي (ع)، من قرأها كان مع الحسين (ع) يوم القيامة في درجته من الجنة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "البلد",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من كان قراءته في فريضته لا أقسم بهذا البلد كان في الدنيا معروفاً أنه من الصالحين، وكان في الآخرة معروفاً أن له من الله مكاناً».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الشمس",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ والشمس وضحاها والليل إذا يغشى والضحى وألم نشرح في يوم أو ليلة شهد له كل شيء بالخير حتى شعره وبشره ولحمه ودمه وعظامه».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الليل",
      "benefits":
          "رُوي عن النبي الأكرم (ص): «من قرأ سورة الليل أعطاه الله حتى يرضى، وعافاه من العسر، ويسر له اليسرى». وتوجب نيل المغفرة وثواب الإنفاق في سبيل الله.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الضحى",
      "benefits":
          "رُوي عن النبي الأكرم (ص): «من قرأ سورة الضحى كان فيمن يرضاه الله، وشفع له محمد (ص)، وكتب له عشر حسنات بعدد كل يتيم وسائل». وتجلب الغائب والضائع بقراءتها.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الشرح",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ ألم نشرح في يومه أو ليلته شهد له كل شيء بالصلاح والخير، وكتب له عظيم الأجر ودفع عنه الهم والغم والضيق».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "التين",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ والتين في فرائضه ونوافله أُعطي من الجنة حيث يرضى». وتورث البركة وحفظ الصحة والسلامة من الآفات والبلايا.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "العلق",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ اقرأ باسم ربك الذي خلق في يومه أو ليلته ثم مات في يومه أو ليلته مات شهيداً وبعثه الله شهيداً، وكان كمن شاهر سيفه مع رسول الله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "القدر",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من قرأ إنا أنزلناه في ليلة القدر بجهر كان كشاهر سيفه في سبيل الله عز وجل، ومن قرأها سراً كان كالمتشحط بدمه في سبيل الله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "البينة",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من قرأ سورة لم يكن (البينة) كان بريئاً من الشرك، وأُدخل في دين محمد (ص)، وبعثه الله مؤمناً، وحاسبه حساباً يسيراً».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الزلزلة",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «لا تملوا من قراءة إذا زلزلت الأرض زلزالها، فإن من قرأها في نوافله لم يصبه الله بزلزلة أبداً، ولم يمت بها ولا بصاعقة ولا بآفة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "العاديات",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة العاديات وأدمن قراءتها بعثه الله مع أمير المؤمنين (ع) يوم القيامة خاصة، وكان في حيزه ومن رفقائه».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "القارعة",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من قرأ سورة القارعة آمنه الله عز وجل من فتنة الدجال أن يؤمن به، ومن قيء جهنم يوم القيامة إن شاء الله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "التكاثر",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ سورة ألهيكم التكاثر في فريضة كتب الله له ثواب أجر مائة حسنة، ومن قرأها في نافلة كتب الله له خمسين حسنة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "العصر",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ والعصر في نوافله بعثه الله يوم القيامة مشرقاً ووجهه يضحك مستبشراً وقرت عينه حتى يدخل الجنة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الهمزة",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ ويل لكل همزة في فرائضه نفت عنه الفقر، وجلبت له الرزق، ودفعت عنه ميتة السوء». وتورث حفظ الأموال وحمايتها.",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الفيل",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ ألم تر كيف فعل ربك بأصحاب الفيل في فرائضه شهد له يوم القيامة كل سهل وجبل وسبخ بأنه كان من المصلين».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "قريش",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من أكثر قراءة لإيلاف قريش بعثه الله يوم القيامة على مركب من مراكب الجنة حتى يجلس على موائد النور يوم القيامة».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الماعون",
      "benefits":
          "رُوي عن الإمام الباقر (ع) قال: «من قرأ أرأيت الذي يكذب بالدين في فرائضه ونوافله كان ممن قبل الله صلاته وصيامه، ولم يحاسبه بما كان منه في الدنيا».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الكوثر",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من كان قراءته إنا أعطيناك الكوثر في فرائضه ونوافله سقاه الله من الكوثر يوم القيامة، وكان محدثه عند رسول الله (ص)».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الكافرون",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ قل يا أيها الكافرون وقل هو الله أحد في فريضة من الفرائض غفر الله له ولوالديه وما ولد، وكانت له براءة من الشرك».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "النصر",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «من قرأ إذا جاء نصر الله والفتح في نافلة أو فريضة أعانه الله على جميع أعدائه يوم القيامة، وله أجر الفاتحين الأبرار».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "المسد",
      "benefits":
          "رُوي عن الإمام الصادق (ع) قال: «إذا قرأتم تبت يدا أبي لهب فادعوا على أبي لهب فإنه كان من الكذابين الذين يكذبون بالنبي (ص) وبما جاء به من عند الله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الإخلاص",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ قل هو الله أحد مرة واحدة فكأنما قرأ ثلث القرآن، ومن قرأها مرتين فكأنما قرأ ثلثي القرآن، ومن قرأها ثلاث مرات فكأنما قرأ القرآن كله».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الفلق",
      "benefits":
          "رُوي عن الإمام الصادق (ع): «من قرأ في بيته المعوذتين (الفلق والناس) في كل ليلة أمن من الجن والوساوس، وعوّذ بها من كل حسد وعين سارقة وسحر كاذب».",
      "hadithSource": "ثواب الأعمال",
    },
    {
      "name": "الناس",
      "benefits":
          "رُوي عن النبي الأكرم (ص) قال: «المعوذتان هما أحسن ما يتعوذ به العبد من شرور الشياطين ووساوس الصدور ونفثات السحرة في العقد وأعين الحاسدين».",
      "hadithSource": "ثواب الأعمال",
    },
  ];

  // =========================================================================
  // الأحاديث القصار للشريط المتحرك (Ticker)
  // =========================================================================
  static const List<Map<String, String>> shortHadiths = [
    {"author": "النبي محمد (ص)", "text": "إنما الأعمال بالنيات."},
    {"author": "النبي محمد (ص)", "text": "الدين النصيحة."},
    {"author": "النبي محمد (ص)", "text": "الكلمة الطيبة صدقة."},
    {"author": "النبي محمد (ص)", "text": "خيركم من تعلم القرآن وعلمه."},
    {
      "author": "النبي محمد (ص)",
      "text": "من حسن إسلام المرء تركه ما لا يعنيه.",
    },
    {"author": "الإمام علي (ع)", "text": "قيمة كل امرئ ما يحسنه."},
    {"author": "الإمام علي (ع)", "text": "من عرف نفسه فقد عرف ربه."},
    {
      "author": "الإمام علي (ع)",
      "text": "الصبر صبران: صبر على ما تكره، وصبر عما تحب.",
    },
    {
      "author": "الإمام علي (ع)",
      "text": "أعجز الناس من عجز عن اكتساب الإخوان.",
    },
    {"author": "الإمام علي (ع)", "text": "لا غنى كالعقل، ولا فقر كالجهل."},
    {
      "author": "السيدة فاطمة (ع)",
      "text": "من أصعد إلى الله خالص عبادته، أهبط الله عز وجل له أفضل مصلحته.",
    },
    {"author": "الإمام الحسن (ع)", "text": "حسن السؤال نصف العلم."},
    {"author": "الإمام الحسن (ع)", "text": "المزاح يأكل الهيبة."},
    {
      "author": "الإمام الحسين (ع)",
      "text": "إن قوماً عبدوا الله رغبة فتلك عبادة التجار.",
    },
    {"author": "الإمام الحسين (ع)", "text": "البخيل من بخل بالسلام."},
    {"author": "الإمام السجاد (ع)", "text": "الخير كله صيانة الإنسان نفسه."},
    {
      "author": "الإمام السجاد (ع)",
      "text": "عجبت لمن يحتمي من الطعام لمضرته كيف لا يحتمي من الذنب لمعرته.",
    },
    {
      "author": "الإمام الباقر (ع)",
      "text": "الكمال كل الكمال: التفقه في الدين، والصبر على النائبة.",
    },
    {
      "author": "الإمام الباقر (ع)",
      "text":
          "إنما يداق الله العباد في الحساب يوم القيامة على قدر ما آتاهم من العقول.",
    },
    {
      "author": "الإمام الصادق (ع)",
      "text":
          "ثلاثة تشكو إلى الله: مسجد خراب، وعالم بين جهال، ومصحف معلق لا يقرأ فيه.",
    },
    {
      "author": "الإمام الصادق (ع)",
      "text": "إن من حقيقة الإيمان أن تؤثر الحق وإن ضرك، على الباطل وإن نفعك.",
    },
    {"author": "الإمام الصادق (ع)", "text": "من صدق لسانه زكا عمله."},
    {
      "author": "الإمام الكاظم (ع)",
      "text": "ليس حسن الجوار كف الأذى، ولكن حسن الجوار الصبر على الأذى.",
    },
    {"author": "الإمام الكاظم (ع)", "text": "التودد إلى الناس نصف العقل."},
    {"author": "الإمام الرضا (ع)", "text": "صديق كل امرئ عقله، وعدوه جهله."},
    {
      "author": "الإمام الرضا (ع)",
      "text": "من لم يشكر المنعم من المخلوقين لم يشكر الله عز وجل.",
    },
    {
      "author": "الإمام الجواد (ع)",
      "text": "الثقة بالله تعالى ثمن لكل غالي، وسلم إلى كل عال.",
    },
    {"author": "الإمام الجواد (ع)", "text": "كيف يضيع من الله كافله."},
    {"author": "الإمام الهادي (ع)", "text": "من هانت عليه نفسه فلا تأمن شره."},
    {
      "author": "الإمام العسكري (ع)",
      "text": "ما أقبح بالمؤمن أن تكون له رغبة تذله.",
    },
    {"author": "الإمام المهدي (عج)", "text": "وأما بنعمة ربك فحدّث."},
    {
      "author": "الإمام المهدي (عج)",
      "text": "إنا غير مهملين لمراعاتكم، ولا ناسين لذكركم.",
    },
  ];

  // =========================================================================
  // دوال البحث والمساعدات
  // =========================================================================

  static Surah? getSurahByName(String name) {
    for (var s in surahs) {
      if (s.name == name) return s;
    }
    return null;
  }

  static Dua? getDuaByTitle(String title) {
    for (var d in duas) {
      if (d.title == title) return d;
    }
    for (var d in dailyDuas) {
      if (d.title == title) return d;
    }
    for (var d in prayerDuas) {
      if (d.title == title) return d;
    }
    return null;
  }

  static Ziyarat? getZiyaratByTitle(String title) {
    for (var z in ziyarats) {
      if (z.title == title) return z;
    }
    for (var z in dailyZiyarats) {
      if (z.title == title) return z;
    }
    return null;
  }
}

class Dhikr {
  final String title;
  final String text;
  final String benefits;

  Dhikr({required this.title, required this.text, required this.benefits});
}
